-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1:3306
-- Généré le :  lun. 06 sep. 2021 à 19:45
-- Version du serveur :  5.7.26
-- Version de PHP :  5.6.40

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données :  `bdd`
--

-- --------------------------------------------------------

--
-- Structure de la table `candidat`
--

DROP TABLE IF EXISTS `candidat`;
CREATE TABLE IF NOT EXISTS `candidat` (
  `NUM_INS` varchar(20) NOT NULL,
  `DATE_INS` date NOT NULL,
  `NOM_CANDIDAT` char(50) NOT NULL,
  `PRENOM_CANDIDAT` char(50) NOT NULL,
  `PRENOM_PERE` varchar(50) NOT NULL,
  `DATE_NAIS_CANDIDAT` date NOT NULL,
  `LIEU_NAIS_CANDIDAT` varchar(20) NOT NULL,
  `NIVEAU_SCOL_CANDIDAT` varchar(50) DEFAULT NULL,
  `ADRESSE_CANDIDAT` varchar(100) DEFAULT NULL,
  `SEX_CONDIDAT` char(10) DEFAULT NULL,
  `TYPE_CANDIDAT` varchar(20) DEFAULT NULL,
  `NUM_PERMIS` varchar(45) NOT NULL,
  `DATE_LIV_PERMIS` date DEFAULT NULL,
  `DATE_EXP_PERMIS` date DEFAULT NULL,
  `TYPE_PERMIS` varchar(50) DEFAULT NULL,
  `CATEGORIE_PERMIS` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `candidat`
--

INSERT INTO `candidat` (`NUM_INS`, `DATE_INS`, `NOM_CANDIDAT`, `PRENOM_CANDIDAT`, `PRENOM_PERE`, `DATE_NAIS_CANDIDAT`, `LIEU_NAIS_CANDIDAT`, `NIVEAU_SCOL_CANDIDAT`, `ADRESSE_CANDIDAT`, `SEX_CONDIDAT`, `TYPE_CANDIDAT`, `NUM_PERMIS`, `DATE_LIV_PERMIS`, `DATE_EXP_PERMIS`, `TYPE_PERMIS`, `CATEGORIE_PERMIS`) VALUES
('00001-2018-283', '2021-09-06', 'دحمان صبايحية', 'معمر', 'محمد', '1976-05-27', 'الشلف', 'ابتدائي', 'م 12 حي 100 مسكن عمارة 02 الشطية الشلف', 'ذكر', 'متعاقد', '02/1725/2016', '2016-05-23', NULL, 'القديم', 'B,C1,C2,D'),
('00001-2020-283', '2020-01-12', 'بلميلود', 'عبد الرزاق', 'محمد', '1979-02-02', 'الشلف', 'متوسط', 'م 04 رقم  332 الشطية - الشلف', 'ذكر', 'متعاقد', '02/4399/2015', '2015-02-15', '2020-02-14', 'القديم', 'B,C1,C2,D'),
('00001-2021-283', '2021-01-04', 'دحماني موسى', 'عنتر', 'محمد', '1979-07-24', 'الشلف', 'متوسط', 'م أ 01 رقم 154 الشطية الشلف', 'ذكر', 'حر', '02/2478/2016', '2016-07-28', NULL, 'القديم', 'B,C1,C2,E'),
('00002-2019-283', '2019-01-06', 'بوكبشة', 'العيد', 'عبد الهادي', '1972-03-29', 'أبو الحسن', 'ابتدائي', 'أغبال - تلعصة - أبو الحسن الشلف', 'ذكر', 'حر', '02/150/2017', '2017-05-30', NULL, 'القديم', 'B,C1,C2,D,E'),
('00002-2020-283', '2020-01-12', 'بلحاج', 'أحمد', 'رشيد', '1984-11-11', 'أولاد فارس', 'متوسط', 'المركز أولاد فارس - الشلف', 'ذكر', 'متعاقد', '02/465/2017', '2017-04-03', '2022-04-02', 'القديم', 'B,C1,C2'),
('00002-2021-283', '2021-01-04', 'عبوش', 'خليفة', 'أحمد', '1977-04-11', 'الصبحة', 'ابتدائي', 'أولاد الجيلالي الصبحة- الشلف', 'ذكر', 'حر', '02/316/2019', '2019-03-07', '2024-03-06', 'القديم', 'B,C1,E'),
('00003-2020-283', '2020-01-12', 'عاقب', 'أحمد', 'محمد', '1966-06-08', 'تنس', 'ابتدائي', ' حي الشعارير رقم 35 تنس -الشلف ', 'ذكر', 'متعاقد', '02/1197/2016', '2016-06-06', '2021-06-07', 'القديم', 'B,C1,C2'),
('00003-2021-283', '2021-01-05', 'مروش', 'صدام حسين', 'محمد', '1991-02-16', 'المصدق', 'متوسط', 'مصدق أولاد إبراهيم المرسى', 'ذكر', 'حر', 'A00530814', '2020-01-25', NULL, 'بيومتري', 'B,C'),
('00004-2021-283', '2021-01-05', 'عباد', 'كريم', 'محمد', '1983-07-08', 'الزبوجة', 'متوسط', 'الطواجين الزبوجة - الشلف', 'ذكر', 'حر', 'A01065766', '2020-11-09', '2030-11-08', 'بيومتري', 'B,D,C1,C'),
('00005-2020-283', '2020-01-13', 'بن براهيم', 'براهيم', 'علي', '1976-12-26', 'الزبوجة', 'متوسط', 'سنفيتة الزبوجة - الشلف', 'ذكر', 'حر', '02/4878/2015', '2015-12-30', '2020-12-29', 'القديم', 'B,C1,C2'),
('00005-2021-283', '2021-01-05', 'بوحريرة', 'مناد', 'محمد', '1979-04-02', 'الصبحة', 'ابتدائي', 'الصوالة الصبحة- الشلف', 'ذكر', 'متعاقد', '02/1202/2019', '2019-10-29', '2024-04-29', 'القديم', 'B,C1,C2'),
('00006-2019-283', '2019-01-07', 'سحنون', 'عبد الله', 'عبد القادر', '1989-02-08', 'الشلف', 'متوسط', 'حي صالحي رقم 07 سنجاس الشلف', 'ذكر', 'حر', '02/7340/2016', '2016-10-25', NULL, 'القديم', 'B,C1,C2,E'),
('00006-2019-283', '2019-01-13', 'دحلب', 'أحمد', 'هني', '1978-01-13', 'الشطية', 'ابتدائي', 'بقعة الحضر الشطية - الشلف', 'ذكر', 'متعاقد', '02/0276/2018', '2018-01-21', '2023-01-20', 'القديم', 'B,C1,C2'),
('00006-2021-283', '2021-01-05', 'بن دريس', 'عبد الحميد', 'عبد القادر', '1989-04-09', 'بوقادير', 'ابتدائي', 'بقعة أولاد الطاهر  بوقادير- الشلف', 'ذكر', 'متعاقد', '02/899/2018', '2018-05-28', '2025-05-28', 'القديم', 'B,C1'),
('00007-2020-283', '2020-01-13', 'قويدري', 'أحمد', 'محمد', '1966-06-12', 'الشلف', 'ابتدائي', ' رقم 29 الشطية K2 المدينة الجديدة عمارة ', 'ذكر', 'متعاقد', '02/10119/2015', '2015-06-21', '2021-08-10', 'القديم', 'B,C1,C2'),
('00007-2021-283', '2021-01-17', 'بن علو', 'يوسف', 'خليفة', '1979-12-30', 'الصبحة', 'ابتدائي', 'حي محمد خروبي الصبحة- الشلف', 'ذكر', 'حر', '02/716/2018', '2018-05-06', '2023-06-04', 'القديم', 'B,C1,C2'),
('00008-2020-283', '2020-01-13', 'مايسة', 'صفيان', 'معمر', '1981-07-16', 'الشلف', 'متوسط', 'بقعة الشرفة - الشلف', 'ذكر', 'متعاقد', '02/1261/2017', '2017-02-15', '2022-02-14', 'القديم', 'B,C1,C2,D,E'),
('00008-2021-283', '2021-01-18', 'حلو', 'جلول', 'أحمد', '1966-07-07', 'أولاد بن عبد القادر', 'ابتدائي', 'بقعة العوايس بلدية الحجاج -الشلف', 'ذكر', 'حر', '02/040/2017', '2017-01-30', '2022-01-29', 'القديم', 'B,C1,C2,E'),
('00009-2018-283', '2018-11-11', 'حليمة ريهوم', 'حميد', 'أمحمد', '1976-02-06', 'أولاد فارس', 'متوسط', 'القطايبية أولاد فارس - الشلف', 'ذكر', 'حر', '02/146/2016', '2016-11-06', '2021-10-26', 'القديم', 'B,C1,C2'),
('00009-2020-283', '2020-01-13', 'بوعريشة', 'ميلود', 'المهدي', '1974-03-22', 'أولاد بن عبد القادر', 'ابتدائي', 'حي العقيد جيلالي بونعامة أولاد بن عبد القادر ', 'ذكر', 'متعاقد', '02/528/2016', '2016-06-06', '2021-06-05', 'القديم', 'B,C1,C2'),
('00009-2021-283', '2021-01-18', 'بن دريس', 'محمد', 'جلول', '1964-05-05', 'بوقادير', 'ابتدائي', 'أولاد طاهر جنوب بوقادير الشلف', 'ذكر', 'متعاقد', '02/788/2016', '2016-02-22', NULL, 'القديم', 'B,C1,C2,E'),
('00010-2019-283', '2019-01-08', 'بوفريوة', 'علي', 'معمر', '1984-03-17', 'الشلف', 'متوسط', 'المدينة الجديدة د 03 رقم 44 الشطية - الشلف', 'ذكر', 'حر', '02/1360/2018', '2018-05-28', '2023-04-02', 'القديم', 'B,C1,C2,E'),
('00010-2020-283', '2020-01-13', 'حمايد', 'جمال', 'أحمد', '1977-04-16', 'أولاد فارس', 'متوسط', 'بقعة الزمالة أولاد فارس - الشلف', 'ذكر', 'حر', '02/623/2017', '2017-05-16', '2022-04-16', 'القديم', 'B,C1,C2,D,E'),
('00010-2021-283', '2021-01-19', 'يخلف', 'فاروق', 'أحمد', '1980-09-19', 'تاجنة', 'ابتدائي', 'تاجنة- أبو الحسن- الشلف', 'ذكر', 'حر', '02/408/2018', '2018-05-29', '2023-09-18', 'القديم', 'B,C1,C2,E'),
('00011-2020-283', '2020-01-11', 'دبحان', 'نصر الدين', 'محمد', '1986-04-19', 'الجزائر', 'متوسط', 'ط.الكريمية واد الفضة - الشلف', 'ذكر', 'حر', '02/1321/2019', '2019-09-11', '2024-09-10', 'القديم', 'B,C1,C2'),
('00011-2021-283', '2021-01-25', 'طهاري', 'عبد القادر', 'عابد', '1969-08-27', 'الشلف', 'ابتدائي', 'حي عزون أم الدروع- الشلف', 'ذكر', 'حر', '02/6715/2016', '2016-10-05', '2021-10-04', 'القديم', 'B,C1,C2'),
('00012-2019-283', '2019-01-09', 'يعقوبي', 'زيان', 'محمد', '1985-02-09', 'الشطية', 'متوسط', 'منطقة النشاطات الشطية - الشلف', 'ذكر', 'حر', '02/285/2016', '2016-01-25', '2021-01-24', 'القديم', 'B,C1,C2'),
('00012-2020-283', '2020-01-13', 'بن حليمة', 'سماعيل', 'صالح', '1984-10-16', 'أولاد فارس', 'متوسط', 'أولاد هني أولاد فارس - الشلف', 'ذكر', 'حر', '02/1103/2019', '2019-12-02', '2024-12-01', 'القديم', 'B,C1,C2,E'),
('00012-2021-283', '2021-01-31', 'عدو', 'محمد', 'محمد', '1955-12-31', 'المصدق', 'ابتدائي', 'بقعة البرازنة المصدق - الشلف', 'ذكر', 'حر', '02/157/2017', '2017-10-19', '2022-01-18', 'القديم', 'B,C1,C2,D,E'),
('00013-2019-283', '2019-01-09', 'وجيد', 'محمد', 'سحنون', '1981-08-23', 'بوقادير', 'متوسط', 'بقعة الشرفة - الشلف', 'ذكر', 'متعاقد', '02/28540/15', '2015-11-26', '2020-11-25', 'القديم', 'D,E'),
('00013-2020-283', '2020-01-13', 'علام', 'حسين', 'محمد', '1982-09-15', 'الشلف', 'متوسط', 'م 09 بناية الشطية - الشلف', 'ذكر', 'حر', '02/11192/2015', '2015-10-04', '2020-10-03', 'القديم', 'B,C1,C2,D,E'),
('00013-2021-283', '2021-01-13', 'غريون', 'فتحي', 'محمد', '1987-03-27', 'الشلف', 'متوسط', 'بقعة الخلايلية سنجاس - الشلف', 'ذكر', 'حر', '02/612/2019', '2019-08-19', '2024-08-18', 'القديم', 'B,C1'),
('00014-2020-283', '2020-01-13', 'بدراني', 'محمد', 'الحاج', '1976-11-27', 'أولاد بن عبد القادر', 'ابتدائي', 'حي الشرفة رقم 149 الشلف', 'ذكر', 'حر', '02/5647/2017', '2017-07-26', '2022-07-25', 'القديم', 'B,C1,C2,E'),
('00014-2021-283', '2021-02-01', 'بروج', 'محمد', 'الحاج', '1982-11-06', 'بوزغاية', 'متوسط', 'حي الصامت رقم 49 بوزغاية - الشلف', 'ذكر', 'حر', '02/441/2018', '2018-07-01', '2030-06-30', 'القديم', 'B,C1,C2,E'),
('00015-2019-283', '2019-01-12', 'بويكني', 'علي', 'عبد القادر', '1966-05-18', 'سنجاس / الشلف', 'ابتدائي', 'بقعة العبايب الحجاج - الشلف', 'ذكر', 'متعاقد', '02/442/2016', '2016-05-11', '2021-05-10', 'القديم', 'B,C1,C2,E'),
('00016-2019-283', '2019-01-12', 'بويكني', 'أحمد', 'عبد القادر', '1981-02-08', 'الشلف', 'متوسط', 'بقعة العبايب الحجاج - الشلف', 'ذكر', 'حر', '02/023/2018', '2018-01-22', '2023-01-21', 'القديم', 'B,C1,C2,E'),
('00016-2020-283', '2020-01-13', 'طهاري', 'إسماعيل', 'أحمد', '1986-04-19', 'الشلف', 'متوسط', 'بقة الأرض البيضاء الشطية- الشلف', 'ذكر', 'حر', '02/1235/2017', '2017-05-22', '2022-05-21', 'القديم', 'B,C1,C2'),
('00016-2021-283', '2021-02-01', 'عبادة', 'محمد', 'عبد القادر', '1966-08-28', 'بوزغاية', 'ابتدائي', 'القرية الفلاحية رقم 31  بوزغاية', 'ذكر', 'متعاقد', '02/031/2020', '2020-01-13', '2025-01-12', 'القديم', 'B,C1,C2,E'),
('00017-2019-283', '2019-01-12', 'بويكني', 'الحاج', 'عبد القادر', '1977-02-05', 'سنجاس', 'ابتدائي', 'بقعة العبايب الحجاج الشلف', 'ذكر', 'متعاقد', '02/008/2016', '2016-01-03', NULL, 'القديم', 'B,C1,C2,E'),
('00017-2020-283', '2020-01-13', 'بوناقة', 'حسين', 'محمد', '1988-12-31', 'الصبحة', 'ابتدائي', 'أولاد حمادي - الصبحة- الشلف', 'ذكر', 'حر', '02/1362/2017', '2017-10-09', '2022-10-08', 'القديم', 'B,C1'),
('00017-2021-283', '2021-02-01', 'مرسلي', 'عبد الله', 'حسين', '1979-04-08', 'سيدي عكاشة', 'ابتدائي', 'محطة نقل المسافرين سيدي عكاشة - الشلف', 'ذكر', 'حر', '02/447/2018', '2018-06-03', '2023-04-07', 'القديم', 'B,C1,C2,D,E'),
('00018-2018-283', '2018-11-11', 'بن سعدية', 'عبد القادر', 'محمد', '1985-04-23', 'أولاد بن عبد القادر', 'متوسط', 'حي القرية الفلاحية واد سلي - الشلف', 'ذكر', 'حر', '02/1040/2015', '2015-02-05', '2018-06-22', 'القديم', 'B,C1,C2'),
('00018-2019-283', '2019-01-12', 'بويكني', ' نور الدين', 'الجيلالي', '1990-06-17', 'الحجاج/ الشلف', 'متوسط', 'بقعة العبايب الحجاج - الشلف', 'ذكر', 'متعاقد', '02/162/2016', '2016-02-17', '2021-02-16', 'القديم', 'B,C1,E'),
('00018-2020-283', '2020-01-13', 'نورين معمر', 'هواري', 'عبد القادر', '1982-10-13', 'الهرانفة', 'ابتدائي', 'الروافعية بلدية الهرانفة -الشلف', 'ذكر', 'حر', '02/80/2020', '2020-02-11', '2025-02-09', 'القديم', 'B,C1,C2'),
('00019-2019-283', '2019-01-12', 'بويكني', 'محمد الأمين', 'محمد', '1989-01-06', 'الشلف', 'متوسط', 'بقعة العبايب الحجاج الشلف', 'ذكر', 'متعاقد', '02/967/1470440', '2015-02-26', NULL, 'القديم', 'B,C1,C2,E'),
('00019-2020-283', '2020-01-13', 'فاضل', 'فتحي', 'محمد', '1974-04-18', 'معسكر', 'متوسط', 'حي النصر م 11 رقم 92 - الشلف', 'ذكر', 'حر', '02/12589/2015', '2015-09-06', '2020-09-05', 'القديم', 'B,C1,C2,E'),
('00019-2021-283', '2021-02-07', 'لزاز', 'العيد', 'محمد', '1981-02-02', 'بوقادير الشلف', 'ابتدائي', 'كابير أولاد فارس الشلف', 'ذكر', 'حر', '02/288/2019', '2019-03-17', '2024-03-14', 'القديم', 'B,C1,C2'),
('00020-2019-283', '2019-01-20', 'بن علو', 'محمد', 'محمد', '1977-11-02', 'الشلف', 'ابتدائي', 'م 10 رقم 519 الشطية الشلف', 'ذكر', 'متعاقد', '02/273/2016', '2016-11-03', NULL, 'القديم', 'B,C1,C2,D,E'),
('00020-2020-283', '2020-01-13', 'بناط', 'عبد القادر', 'محمد', '1985-01-13', 'أبو الحسن', 'متوسط', 'حي الإخوة عزون أبو الحسن - الشلف', 'ذكر', 'حر', '02/656/2016', '2016-05-09', '2021-01-12', 'القديم', 'B,C1,C2,D'),
('00020-2021-283', '2021-02-10', 'فوقة', 'محمد', 'معمر', '1981-12-31', 'أبو الحسن', 'ابتدائي', 'حي المعلمين-أبو الحسن- الشلف', 'ذكر', 'حر', '02/700/2018', '2018-11-06', '2024-06-24', 'القديم', 'B,C1,C2,D,E'),
('00021-2019-283', '2019-01-12', 'طاهري', 'خالد', 'جيلالي', '1970-06-22', 'الشلف', 'ابتدائي', 'بقعة الرملية الشلف', 'ذكر', 'متعاقد', '02/5337/2017', '2017-07-19', NULL, 'القديم', 'B,C1,C2,E'),
('00021-2020-283', '2020-01-13', 'مروش', 'عبد القادر', 'جلول', '1983-10-17', 'أولاد بن عبد القادر', 'ابتدائي', 'بقعة شبكة الأبطال أ.بن عبد القادر', 'ذكر', 'حر', '02/438/2019', '2019-09-11', '2024-09-10', 'القديم', 'B,C1,C2,D,E'),
('00021-2021-283', '2021-02-28', 'بوزكري', 'طيب', 'محمد', '1978-11-06', 'الزبوجة', 'ابتدائي', 'حي النهضة رقم 85 الزبوجة -الشلف', 'ذكر', 'حر', '02/451/2018', '2018-06-18', '2023-03-19', 'القديم', 'B,C1,C2'),
('00022-2021-283', '2021-03-01', 'مقنين', 'مجيد', 'محمد', '1989-03-21', 'الشطية', 'متوسط', 'أولاد فارس الشلف', 'ذكر', 'حر', 'A00496287', '2020-01-14', NULL, 'بيومتري', 'B,C'),
('00023-2019-283', '2019-01-15', 'لحمر', 'معمر', 'جلول', '1977-07-23', 'بوقادير', 'ابتدائي', 'حي الحمر واد سلي الشلف', 'ذكر', 'متعاقد', '02/2168/2016', '2016-05-24', NULL, 'القديم', 'B,C1,C2,D,E'),
('00023-2021-283', '2021-03-02', 'ماموني', 'بوجمعة', 'أحمد', '1988-03-20', 'بني حواء', 'ابتدائي', 'بني حواء حي الشهيد عبدلي محمد', 'ذكر', 'حر', '02/086/2021', '2021-02-21', '2026-02-20', 'القديم', 'B,C1'),
('00024-2019-283', '2019-01-15', 'بن سعدية', 'معمر', 'أحمد', '1986-05-18', 'أولاد بن عبدد القادر', 'متوسط', 'حي سونالغاز واد سلي الشلف', 'ذكر', 'حر', '02/252/2018', '2018-02-08', NULL, 'القديم', 'B,C1,C2,D,E'),
('00024-2021-283', '2021-03-02', 'معامري', 'نور الدين', 'بن زيان ', '1982-12-10', 'سيدي عبد الرحمن ', 'متوسط', 'حي بن باديس تلعصة أبو الحسن الشلف', 'ذكر', 'حر', '02/27/2021', '2021-01-17', NULL, 'القديم', 'B,C1,C2,E'),
('00025-2019-283', '2019-01-15', 'لحمر', 'الطاهر', 'جلول', '1981-06-24', 'بوقادير', 'متوسط', 'حي لحمر واد سلي الشلف', 'ذكر', 'حر', '02/9772/2016', '2016-03-06', NULL, 'القديم', 'B,C1,C2,D,E'),
('00025-2020-283', '2020-02-05', 'لكحل', 'جيلالي', 'أمحمد', '1972-10-05', 'الشلف', 'ثانوي', 'م 12 رقم 151 الشطية- الشلف', 'ذكر', 'حر', '02/0393/2018', '2018-01-30', '2023-01-29', 'القديم', 'B,C1,C2'),
('00026-2018-283', '2018-12-01', 'دحماني', 'خليفة', 'محمد', '1976-11-06', 'الشلف', 'متوسط', 'أولاد سالم الصبحة - الشلف', 'ذكر', 'حر', '02/847/2018', '2018-07-08', '2023-07-07', 'القديم', 'B,C1,C2,D,E'),
('00026-2019-283', '2019-01-16', 'حمايدي', 'حميد', 'موسى', '1971-01-29', 'خميس مليانة', 'متوسط', 'حي النصر م 10 رقم 145 ', 'ذكر', 'حر', '44/05/2091/16', '2016-05-24', '2021-08-23', 'القديم', 'B,C1,C2,E'),
('00026-2020-283', '2020-11-02', 'بن واضح', 'خليفة', 'أمحمد', '1985-03-05', 'بوقادير', 'ابتدائي', 'بقعة الخلايف بوقادير الشلف', 'ذكر', 'حر', 'A013118670', '2021-02-03', NULL, 'بيومتري', 'B,C,BE,C1E,CE'),
('00026-2021-283', '2021-03-08', 'زياني', 'محمد', 'محمد', '1972-01-16', 'الشلف', 'ابتدائي', 'منطقة د3 رقم 919 الشطية الشلف', 'ذكر', 'حر', '02/632/2019', '2019-03-25', '2024-03-24', 'القديم', 'B,C1,C2,E'),
('00027-2018-283', '2018-12-01', 'بوهنة', 'زيان', 'غلام الله', '1985-03-11', 'الصبحة', 'متوسط', 'حي محمد عبوش الصبحة - الشلف', 'ذكر', 'حر', '02/1767/2016', '2016-04-25', '2021-03-08', 'القديم', 'B,C1,C2,E'),
('00027-2020-283', '2020-11-11', 'شبلي', 'جيلالي', 'محمد', '1966-04-16', 'الشلف', 'ابتدائي', 'م أ 01 رقم 107 الشطية الشلف', 'ذكر', 'حر', '02/11863/2015', '2015-12-06', '2020-12-05', 'القديم', 'B,C1,C2'),
('00027-2021-283', '2021-03-08', 'مخلوف', 'فيصل', 'محمد', '1984-03-07', 'عين مران', 'متوسط', 'حي الشهيد زيان معمر محمد السهايلية عين مران', 'ذكر', 'حر', '02/826/2020', '2020-08-05', '2025-08-03', 'القديم', 'B,C1,C2'),
('00028-2019-283', '2019-01-17', 'بروجي', 'حسين', 'عبد القادر', '1988-05-31', 'الشلف', 'متوسط', 'بقعة الحمام أم الدروع - الشلف', 'ذكر', 'حر', '02/799/2018', '2018-11-25', '2023-10-24', 'القديم', 'B,C1'),
('00028-2020-283', '2020-11-15', 'بن واضح', 'العربي', 'أمحمد', '1986-10-31', 'الصبحة', 'متوسط', 'بقعة الخلايف بوقادير - الشلف', 'ذكر', 'حر', '02/1123/2018', '2018-07-03', '2023-07-04', 'القديم', 'B,C1'),
('00028-2021-283', '2021-03-08', 'قلال', 'بن عودة', 'محمد', '1993-01-29', 'بني راشد', 'متوسط', 'بني راشد', 'ذكر', 'حر', 'A00114019', '2019-07-19', '2029-07-18', 'بيومتري', 'B,C'),
('00029-2021-283', '2021-03-10', 'وشان', 'سليمان', 'العربي', '1979-09-20', 'الشطية', 'ابتدائي', 'بقعة الأرض البيضاء الشطية- الشلف', 'ذكر', 'حر', '02/2111/2019', '2019-10-29', '2024-10-28', 'القديم', 'B,C1,C2'),
('00030-2019-283', '2019-01-19', 'عداتي', 'يوسف', 'محمد', '1981-08-31', 'الهرانفة', 'متوسط', 'بقعة الأرض البيضاء الشطية - الشلف', 'ذكر', 'حر', '02/1091/2015', '2015-02-02', '2020-02-01', 'القديم', 'B,C1,C2'),
('00030-2020-283', '2020-11-15', 'عمران', 'رضوان', 'أحمد', '1993-04-19', 'الشطية', 'متوسط', 'منطقة 11 رقم 150 الشطية- الشلف', 'ذكر', 'حر', '02/2954/2018', '2018-12-17', '2023-09-04', 'القديم', 'B,C1'),
('00030-2021-283', '2021-03-10', 'زناقي', 'عبد القادر', 'محمد', '1983-09-06', 'الشلف', 'ابتدائي', 'حي 130 مسكن رقم 23 الشلف', 'ذكر', 'حر', '02/1377/2019', '2019-03-07', '2024-03-06', 'القديم', 'B,C1,C2,E'),
('00031-2021-283', '2021-03-10', 'بسبع', 'عبد القادر', 'محمد', '1986-11-08', 'الهرانفة', 'ابتدائي', 'حي الشهيد بورياش عبد القادر عين مران', 'ذكر', 'حر', '02/64/2020', '2020-01-20', '2025-01-16', 'القديم', 'B,C1,C2,E'),
('00032-2018-283', '2018-11-04', 'دحماني', 'خليفة', 'محمد', '1985-01-22', 'الصبحة', 'متوسط', 'أولاد سالم الصبحة - الشلف', 'ذكر', 'حر', '02/023/2018', '2018-01-07', '2023-01-03', 'القديم', 'B,C1,C2,D'),
('00032-2020-283', '2020-11-29', 'عبدي', 'نبيل', 'جيلالي', '1990-06-17', 'أولاد فارس', 'متوسط', 'حي 250 مسكن 155 أولاد فارس', 'ذكر', 'متعاقد', '02/892/2018', '2018-07-24', '2023-07-23', 'القديم', 'B,C1'),
('00032-2021-283', '2019-01-19', 'مصطفاوي', 'أمحمد', 'عبد القادر', '1966-01-17', 'الشلف', 'ابتدائي', 'حي الحرية الشلف', 'ذكر', 'حر', '02/1799/2016', '2016-03-22', NULL, 'القديم', 'B,C1,C2,D,E'),
('00033-2018-283', '2018-12-04', 'دحماني', 'جيلالي', 'محمد', '1981-01-14', 'الصبحة / الشلف', 'متوسط', 'أولاد سالم الصبحة - الشلف', 'ذكر', 'حر', '02/879/2016', '2016-02-28', '2021-02-27', 'القديم', 'B,C1,C2,D'),
('00033-2019-283', '2019-01-19', 'رحموني', 'محمد', 'محمد', '1980-07-26', 'الشلف', 'متوسط', 'بقعة الأرض البيضاء الشطية - الشلف', 'ذكر', 'حر', '02/9179/2015', '2015-04-05', '2020-04-04', 'القديم', 'B,C1,C2'),
('00033-2020-283', '2020-12-06', 'بوشريط', 'معمر', 'محمد', '1964-06-28', 'الشلف', 'ابتدائي', '  رقم رقم 30 -الشلفXرحي السلام شارع ', 'ذكر', 'حر', '02/3965/2018', '2018-06-04', '2023-06-04', 'القديم', 'B,C1,C2,E'),
('00033-2021-283', '2021-03-14', 'عامر', 'عبد القادر', 'محمد', '1985-02-02', 'الشطية', 'متوسط', 'م أ 01 رقم 85 الشطية - الشلف', 'ذكر', 'متعاقد', '02/1068/2017', '2017-04-27', '2022-02-04', 'القديم', 'B,C1,C2,E'),
('00034-2018-283', '2018-12-04', 'جيلالي عياد', 'محمد', 'محمد', '1984-10-02', 'أولاد فارس', 'متوسط', 'القطايبية أولاد فارس - الشلف', 'ذكر', 'حر', '02/11431/2015', '2015-11-04', '2020-11-03', 'القديم', 'B,C1,C2'),
('00034-2019-283', '2019-01-20', 'فغول', 'محمد', 'معمر', '1981-06-15', 'أولاد فارس', 'متوسط', 'القطايبية أولاد فارس الشلف', 'ذكر', 'حر', '02/744/2017', '2017-06-15', NULL, 'القديم', 'B,C1,C2,E'),
('00034-2020-283', '2020-12-06', 'العثامنية', 'عبد الغني', 'عبد القادر', '1985-06-08', 'سنجاس', 'متوسط', 'حي بني ودرن سنجاس - الشلف', 'ذكر', 'حر', '02/198/2017', '2017-02-15', '2021-11-21', 'القديم', 'B,C1,D'),
('00034-2021-283', '2021-03-16', 'عومر', 'عابد', 'تواتي', '1982-02-15', 'الصبحة الشلف', 'ابتدائي', 'البخايتية الصبحة الشلف', 'ذكر', 'متعاقد', '02/300/2020', '2020-04-22', '2025-04-20', 'القديم', 'B,C1,C2,E'),
('00035-2020-283', '2020-12-09', 'بشير', 'حسان', 'محمد', '1979-07-25', 'أبو الحسن', 'ابتدائي', 'حي سيدي محمد أبو الحسن - الشلف', 'ذكر', 'حر', '02/470/2018', '2018-07-22', '2021-08-05', 'القديم', 'B,C1,C2'),
('00035-2021-283', '2019-01-20', 'شعبان', 'أحمد', 'محمد', '1984-03-20', 'الصبحة', 'ابتدائي', 'حي الشهيد بن يطو عبد القادر الصبحة الشلف', 'ذكر', 'حر', '02/1297/2017', '2017-09-28', NULL, 'القديم', 'B,C1,C2,D,E'),
('00036-2018-283', '2018-12-08', 'بن ساعو', 'محمد', 'عبد القادر', '1959-02-15', 'الشلف', 'بدون مستوى', 'بقعة الشرفة الشلف', 'ذكر', 'حر', '02/12004/2015', '2015-08-24', NULL, 'القديم', 'B,C1,C2,E'),
('00036-2019-283', '2019-01-20', 'بن عومر', 'محمد', 'برزق الله', '1982-12-31', 'عين مران', 'ابتدائي', 'الحشاليف الصبحة الشلف', 'ذكر', 'حر', '02/6634/2015', '2015-05-20', NULL, 'القديم', 'B,C1,C2'),
('00036-2021-283', '2021-03-22', 'بصيلات', 'معمر', 'معمر', '1975-07-10', 'تاجنة', 'ابتدائي', 'تاجنة أبو الحسن الشلف', 'ذكر', 'حر', '02/328/2017', '2021-08-23', NULL, 'القديم', 'B,C1,C2,E'),
('00037-2018-283', '2018-12-13', 'عامر', 'خليفة', 'عبد القادر', '1972-12-31', 'الهرانفة / الشلف', 'ابتدائي', 'أولاد الجيلالي الصبحة - الشلف', 'ذكر', 'حر', '02/1168/2017', '2017-08-27', '2022-08-26', 'القديم', 'B,C1,C2,D,E'),
('00037-2019-283', '2019-07-20', 'عالم', 'إبراهيم', 'محمد', '1982-08-02', 'الهرانفة', 'متوسط', 'أولاد الجيلالي الصبحة - الشلف', 'ذكر', 'حر', '02/575/2018', '2018-05-15', '2023-03-20', 'القديم', 'B,C1,C2,E'),
('00037-2020-283', '2020-12-09', 'بوطيبة', 'نور الدين', 'ميلود', '1979-05-09', 'بوقادير', 'متوسط', 'حي الحرية واد سلي - الشلف', 'ذكر', 'حر', '02/238/2021', '2021-02-23', '2026-02-21', 'القديم', 'B,C1,C2,D,E'),
('00037-2021-283', '2021-03-22', 'غلام', 'عبد القادر', 'محمد', '1989-11-05', 'أولاد فارس', 'متوسط', 'أولاد فارس', 'ذكر', 'حر', '00009441', '2021-03-14', '2021-10-14', 'بيومتري', 'B,C,CE'),
('00038-2018-283', '2018-12-15', 'سناد', 'عبد القادر', 'محمد', '1979-03-23', 'الظهرة', 'متوسط', 'بلدية الظهرة - الشلف', 'ذكر', 'حر', '02/1254/2014', '2014-11-16', '2019-09-14', 'القديم', 'B,C1,C2'),
('00038-2019-283', '2019-01-20', 'زيتوني', 'عبد القادر', 'سالم', '1976-07-07', 'بوقادير', 'متوسط', 'حي الشريف بوقادير الشلف', 'ذكر', 'حر', '02/4882/2015', '2015-04-13', NULL, 'القديم', 'B,C1,C2'),
('00038-2020-283', '2020-12-09', 'قلمام', 'محمد', 'طاهر', '1977-08-27', 'أولاد بن عبد القادر', 'متوسط', 'حي الحرية واد سلي - الشلف', 'ذكر', 'حر', '02/1587/2017', '2017-04-18', '2022-04-14', 'القديم', 'B,C1,C2,D'),
('00038-2021-283', '2021-03-22', 'وشان', 'رشيد', 'عبد القادر', '1977-01-14', 'الشلف', 'ابتدائي', 'حي الشرفة أولاد فارس- الشلف', 'ذكر', 'حر', '02/391/2020', '2020-05-04', '2025-05-03', 'القديم', 'B,C1,C2'),
('00039-2018-283', '2018-12-15', 'بوشكارة', 'سعيد', 'محمد', '1979-01-13', 'أولاد فارس', 'متوسط', 'القطايبية أولاد فارس الشلف', 'ذكر', 'حر', '02/2199/2015', '2015-02-08', NULL, 'القديم', 'B,C1,C2,E'),
('00039-2020-283', '2020-12-09', 'بوطيبة', 'رشيد', 'ميلود', '1980-12-15', 'بوقادير', 'متوسط', 'حي الحرية واد سلي - الشلف', 'ذكر', 'حر', '02/1212/2016', '2016-03-22', '2024-03-22', 'القديم', 'B,D'),
('00040-2019-283', '2019-01-22', 'بن داشة', 'العربي', 'محمد', '1982-03-07', 'الصبحة', 'ابتدائي', 'العوانة الصبحة الشلف', 'ذكر', 'حر', '02/117/2019', '2019-01-22', NULL, 'القديم', 'B,C1,C2,E'),
('00040-2020-283', '2020-12-09', 'جعفر موسى', 'عبد الله', 'أحمد', '1973-07-12', 'سنجاس', 'ابتدائي', 'أولاد بن عبد القادر الشلف', 'ذكر', 'حر', '02/323/2018', '2018-04-30', '2028-04-29', 'القديم', 'B,D'),
('00040-2021-283', '2021-03-24', 'عنتر', 'ناصر', 'أحمد', '1986-09-11', 'الشطية', 'متوسط', 'حي بن باديس تلعصة  أبو الحسن الشلف', 'ذكر', 'متعاقد', '02/258/2018', '2018-09-13', NULL, 'القديم', 'B,C1,C2'),
('00041-2018-283', '2018-12-16', 'عامر', 'شارف', 'عبد القادر', '1966-12-04', 'الهرانفة/ الشلف', 'ابتدائي', 'أولاد الجيلالي الصبحة - الشلف', 'ذكر', 'حر', '02/2431/2016', '2016-06-07', '2021-06-06', 'القديم', 'B,C1,C2,D,E'),
('00041-2019-283', '2019-01-24', 'عجيم', 'العربي', 'لخضر', '1986-03-26', 'الشطية', 'متوسط', 'منطقة 05 رقم255 الشطية الشلف', 'ذكر', 'حر', '02/052/2018', '2018-01-09', NULL, 'القديم', 'B,C1,C2,D'),
('00041-2020-283', '2020-12-09', 'شريف', 'محمد', 'عبد القادر', '1976-02-16', 'تاجنة', 'ابتدائي', 'تاجنة أبو الحسن الشلف', 'ذكر', 'حر', '02/530/2019', '2019-09-15', '2024-02-15', 'القديم', 'B,C1,C2,E'),
('00041-2021-283', '2021-03-24', 'زياني', 'علاء الدين', 'عبد الناصر', '1986-02-11', 'الشطية', 'متوسط', 'م ب 01 رقم 16 الشطية الشلف', 'ذكر', 'متعاقد', '02/1972/2020', '2020-12-10', NULL, 'القديم', 'B,C1,C2,D,E'),
('00042-2019-283', '2019-01-24', 'بن علي رقيق', 'زهير', 'محمد', '1982-02-09', 'بوقادير', 'ابتدائي', 'حي الدوايدية بوقادير - الشلف', 'ذكر', 'حر', '02/381/2017', '2017-02-21', '2022-02-13', 'القديم', 'B,C1,C2'),
('00042-2020-283', '2020-12-09', 'شريف', 'عبد الحق', 'عبد القادر', '1991-03-04', 'تاجنة', 'ابتدائي', 'تاجنة أبو الحسن الشلف', 'ذكر', 'حر', '02/628/2020', '2020-10-05', '2025-03-03', 'القديم', 'B,C2'),
('00042-2021-283', '2021-03-24', 'زياني', 'احمد', 'عبد الناصر', '1982-12-04', 'الشلف', 'متوسط', 'المركز أولاد فارس الشلف', 'ذكر', 'متعاقد', '02/360/2019', '2019-04-03', NULL, 'القديم', 'B,C1,C2,D,E'),
('00043-2020-283', '2020-12-09', 'مزار', 'أحمد', 'محمد', '1985-01-07', 'الكريمية', 'متوسط', 'سيدي مدور الكريمية - الشلف', 'ذكر', 'حر', 'R0181365', '2021-03-22', '2021-08-22', 'بيومتري', 'B,C1'),
('00043-2021-2', '2021-08-02', 'مجاجي', 'محمد', 'أمحمد', '1972-09-11', 'بوقادير', 'متوسط', 'حي بوكعبن بوقادير- الشلف', 'ذكر', 'متعاقد', '02/725/2019', '2019-05-29', '2024-05-27', 'القديم', 'B,C1,C2'),
('00043-2021-283', '2021-03-24', 'بلعلة', 'بن شاعة', 'زيان', '1953-12-31', 'تاجنة', 'ابتدائي', 'تاجنة أبو الحسن الشلف', 'ذكر', 'متعاقد', '02/654/2016', '2016-05-09', NULL, 'القديم', 'B,C1,C2,E'),
('00044-2021-283', '2021-03-24', 'حمايد', 'محمد', 'دلة', '1984-08-12', 'الشلف', 'ابتدائي', 'الزمالة أولاد فارس الشلف', 'ذكر', 'حر', '02/361/2020', '2020-04-21', '2025-04-18', 'القديم', 'B,C1,C2'),
('00045-2021-283', '2021-03-24', 'مباركي', 'كريم', 'عبد القادر', '1979-10-20', 'الشلف', 'ابتدائي', 'المنطقة 12 رقم 303 الشطية الشلف', 'ذكر', 'حر', '02/0185/2021', '2021-03-09', '2026-03-08', 'القديم', 'B,C1,C2,D,E'),
('00046-2020-283', '2020-12-21', 'كرفي قطيب', 'حكيم', 'بوعبد الله', '1981-04-12', 'أولاد فارس', 'متوسط', 'القطايبية أولاد فارس - الشلف', 'ذكر', 'حر', '02/441/2020', '2020-05-28', '2025-05-05', 'القديم', 'B,D'),
('00047-2019-283', '2019-01-29', 'قوجيل', 'معمر', 'قدور', '1965-12-02', 'الشلف', 'ابتدائي', 'حي النصر م 07ب رقم 21', 'ذكر', 'حر', '02/5654/2015', '2015-02-22', NULL, 'القديم', 'B,C1,C2,D,E'),
('00047-2020-283', '2020-12-21', 'مسعد قوشيش', 'العربي', 'محمد', '1966-09-02', 'أولاد فارس الشلف ', 'ابتدائي', 'أولاد ابراهيم أولاد فارس الشلف ', 'ذكر', 'حر', '02/1496/2017', '2021-11-27', '2022-10-19', 'القديم', 'B,C1,C2'),
('00047-2021-283', '2021-03-25', 'بنونة', 'عبد القادر', 'أحمد', '1983-08-10', 'المرسى', 'متوسط', 'حي المجاهد بلعباس أحمد بلدية المرسى -الشلف', 'ذكر', 'حر', '02/98/2021', '2021-03-16', '2026-03-15', 'القديم', 'B,C1,C2'),
('00048-2019-283', '2019-01-29', 'بويكني', 'العيد', 'محمد', '1973-01-13', 'الشلف', 'متوسط', 'بقعة العبايب الحجاج - الشلف', 'ذكر', 'حر', '02/951/12363767', '2011-09-12', '2015-09-12', 'القديم', 'B,C1,E'),
('00048-2021-283', '2018-12-28', 'حمودي', 'معمر', 'محمد', '1979-03-15', 'الشطية', 'ابتدائي', ' بقعة الشطية الشلف', 'ذكر', 'حر', '02/3702/2015', '2015-02-10', NULL, 'القديم', 'B,C1,C2'),
('00048-2021-283', '2021-03-24', 'قلوش', 'سماعيل', 'معمر', '1973-03-05', 'أولاد فارس الشلف', 'ابتدائي', 'السعايدية أولاد فارس الشلف', 'ذكر', 'حر', '02/263/2019', '2019-03-07', '2024-03-03', 'القديم', 'B,C1,C2'),
('00049-2020-283', '2020-12-27', 'مقروس', 'سعيد', 'عبد القادر', '1975-07-29', 'أولاد فارس', 'متوسط', 'القطايبية أولاد فارس - الشلف', 'ذكر', 'حر', '02/418/2019', '2019-04-22', '2024-01-19', 'القديم', 'B,C1,D,E'),
('00050-2019-283', '2019-01-02', 'عامر', 'عبد الحق', 'الشارف', '1993-04-22', 'أولاد فارس', 'متوسط', 'حي 280 مسكن أولاد فارس - الشلف', 'ذكر', 'حر', '02/1448/2018', '2018-12-13', '2023-09-22', 'القديم', 'B,C2'),
('00050-2020-283', '2020-12-31', 'جبور', 'علي', 'عبد القادر', '1979-01-29', 'أولاد فارس', 'ابتدائي', 'كابير أولاد فارس الشلف', 'ذكر', 'حر', '02/1453/2017', '2017-11-19', '2022-01-16', 'القديم', 'B,C1,C2'),
('00050-2021-283', '2021-03-27', 'دريزي', 'محمد', 'محمد', '1987-03-24', 'الهرانفة', 'ابتدائي', 'أولاد فارس', 'ذكر', 'حر', '00001740', '2021-02-08', '2021-10-08', 'القديم', 'B,C1'),
('00051-2020-283', '2020-12-31', 'جضري', 'سليمان', 'معمر', '1977-04-09', 'أولاد فارس', 'ابتدائي', 'المركز أولاد فارس الشلف', 'ذكر', 'حر', '02/118/2016', '2016-10-26', '2021-10-26', 'القديم', 'B,C1,C2'),
('00051-2021-283', '2018-12-30', 'ناجي', 'الشارف', 'لخضر', '1975-06-12', 'الهرانفة', 'ابتدائي', ' أولاد الجيلالي الصبحة -الشلف', 'ذكر', 'حر', '02/168/2018', '2018-02-05', '2023-02-04', 'القديم', 'B,C1,C2'),
('00052-2021-283', '2019-01-02', 'شوير', 'عبد القادر', 'ميلود', '1973-08-26', 'الشلف', 'ابتدائي', 'م 12 رقم 01 الشطية - الشلف', 'ذكر', 'متعاقد', '02/0163/2018', '2018-01-24', '2023-01-23', 'القديم', 'B,C1,C2,E'),
('00052-2021-283', '2021-03-29', 'حميدي بوجلطية', 'أحمد', 'محمد', '1982-10-30', 'الشلف', 'متوسط', 'م 02 رقم 90 الشطية - الشلف', 'ذكر', 'حر', '02/9449/2015', '2015-04-19', '2022-04-21', 'بيومتري', 'B,C1'),
('00053-2019-283', '2019-01-03', 'بوهادي', 'علي', 'محمد', '1983-12-28', 'الشلف', 'ابتدائي', 'بقعة الرملية الشلف', 'ذكر', 'حر', '02/7362/2018', '2018-10-30', '2023-10-29', 'القديم', 'B,C1'),
('00053-2020-283', '2020-01-31', 'طهراوي', 'مراد', 'عبد القادر', '1982-08-29', 'أولاد فارس', 'متوسط', 'السعايدية أولاد فارس - الشلف', 'ذكر', 'حر', '02/612/2017', '2017-05-14', '2023-03-23', 'القديم', 'B,C1,C2'),
('00053-2021-283', '2021-03-29', 'بن هني', 'حليم', 'محمد', '1978-12-24', 'الشلف', 'متوسط', 'حي الشقة رقم02 الشلف', 'ذكر', 'حر', 'A01213764', '2021-01-01', '2030-12-31', 'بيومتري', 'B,C1,C'),
('00054-2020-283', '2020-12-31', 'بلعلة', 'صديق', 'العربي', '1981-03-21', 'بوزغاية', 'متوسط', 'تاجنة بوزغاية الشلف', 'ذكر', 'متعاقد', '02/637/2019', '2019-10-29', NULL, 'القديم', 'B,C1,C2,D,E'),
('00054-2021-283', '2021-08-07', 'بن زناقي', 'نور الدين', 'أحمد ', '1979-11-15', 'الشلف', 'متوسط', 'سنجاس مركز الشلف', 'ذكر', 'حر', '02/789/2020', '2020-11-19', '2025-11-18', 'القديم', 'B,C1,C2'),
('00055-2021-283', '2021-03-30', 'عطافي', 'معمر', 'معمر', '1977-09-20', 'بوزغاية', 'متوسط', 'بقعة العطاطفة رقم 12 بوزغاية الشلف', 'ذكر', 'حر', '02/635/2020', '2020-10-20', NULL, 'القديم', 'B,C1,C2,D'),
('00056-2019-283', '2019-01-03', 'بن عودة', 'موراد', 'عبد القادر', '1981-04-17', 'الشلف', 'متوسط', 'حي عمارة غلام رقم 54 بوزغاية - الشلف', 'ذكر', 'حر', '02/5662/2017', '2017-03-07', '2021-03-09', 'القديم', 'B,C1,C2,E'),
('00056-2021-283', '2021-08-01', 'مواكني', 'أحمد', 'محمد', '1983-12-31', 'بوزغاية', 'ابتدائي', 'حي عمار غلام رقم 199', 'ذكر', 'حر', '209900051002890003', '2021-05-09', '2026-08-01', 'بيومتري', 'B,C,BE,CE'),
('00057-2021-283', '2021-03-30', 'دحمون', 'محمد', 'معمر', '1953-06-03', 'تاجنة', 'ابتدائي', 'تاجنة', 'ذكر', 'حر', '02/430/2018', '2018-05-31', '2023-06-02', 'القديم', 'B,C1,C2,E'),
('00058-2021-283', '2021-03-31', 'داج', 'بن عودة', 'حاج', '1958-12-16', 'أولاد فارس', 'ابتدائي', 'حي كابير أولاد فارس- الشلف', 'ذكر', 'حر', '02/754/2019', '2021-08-04', '2024-08-04', 'القديم', 'B,C1,C2,E'),
('00059-2021-283', '2021-03-31', 'فرحاوي', 'سليمان', 'جيلالي', '1985-01-21', 'تاجنة', 'ابتدائي', 'عجاب تاجنة الشلف', 'ذكر', 'حر', '02/571/2020', '2020-09-28', '2025-01-20', 'القديم', 'B,C1,C2'),
('00060-2021-283', '2021-03-31', 'ضربان', 'رشيد', 'محمد', '1988-04-24', 'الظهرة', 'ابتدائي', 'الهناشرية بلدية الظهرة-الشلف', 'ذكر', 'حر', '02/0317/2019', '2019-07-29', '2024-01-28', 'القديم', 'B,C1'),
('00061-2021-283', '2021-03-31', 'معايزية', 'محمد', 'محمد', '1976-09-03', 'الشلف', 'ابتدائي', 'بقعة المعايزية أم الدروع - الشلف', 'ذكر', 'حر', '02/379/2018', '2018-05-27', '2023-05-20', 'القديم', 'B,C1,C2,E'),
('00062-2021-283', '2021-03-31', 'تامي نورين', 'رياض', 'محمد', '1988-06-05', 'تاجنة', 'متوسط', 'سيدي زيان تاجنة الشلف', 'ذكر', 'حر', '02/459/2018', '2018-06-07', NULL, 'القديم', 'B,C1'),
('00064-2021-283', '2021-03-31', 'منصور', 'مولود', 'محمد', '1982-03-03', 'بوزغاية', 'ابتدائي', 'القرية الفلاحية الشطية الشلف', 'ذكر', 'حر', '0004462', '2021-03-17', NULL, 'بيومتري', 'B,C1,BE,C1E'),
('00065-2021-283', '2021-03-31', 'حو حامدي', 'معمر', 'معمر', '1981-08-16', 'الشلف', 'ابتدائي', 'القرية الفلاحية الشطية ', 'ذكر', 'حر', '02/2113/2020', '2020-11-02', '2025-11-01', 'القديم', 'B,C1,C2'),
('00067-2021-283', '2021-04-01', 'قوجيل', 'محمد', 'عبد القادر', '1963-03-09', 'الزبوجة', 'ابتدائي', 'بقعة الأرض البيضاء الشطية- الشلف', 'ذكر', 'حر', '02/1109/2017', '2021-05-07', '2022-05-06', 'القديم', 'B,C1,C2'),
('00068-2021-283', '2021-04-01', 'شرار', 'نبيل', 'معمر', '1997-01-12', 'الشطية الشلف', 'ابتدائي', 'بقعة الشطية الشلف', 'ذكر', 'حر', '02/2885/2018', '2018-12-09', '2023-12-08', 'القديم', 'B,C1'),
('00069-2021-283', '2021-04-01', 'جيلالي ساعو', 'عبد القادر', 'محمد', '1975-10-27', 'الشلف', 'متوسط', 'حي الإخوة عباد رقم 234  الشلف', 'ذكر', 'متعاقد', 'A01285861', '2021-01-21', NULL, 'بيومتري', 'B,C1,C,BE,C1E,CE'),
('00070-2021-283', '2021-04-01', 'بخوش', 'نجيب', 'محمد', '1984-10-25', 'عين ولمان', 'متوسط', 'حي بن سونة عمارة ن رقم 130 الشلف', 'ذكر', 'حر', 'R01674784', '2021-03-31', '2021-08-31', 'بيومتري', 'B,C1,BE,C1E'),
('00071-2021-283', '2021-04-02', 'بلحاج بن يحي', 'عبد الرزاق', 'عيسى', '1969-04-01', 'الصبحة', 'ابتدائي', 'أولاد فطي الصبحة الشلف', 'ذكر', 'حر', '02/771/2020', '2020-09-07', '2025-09-06', 'القديم', 'B,C1,C2,E'),
('00072-2021-283', '2021-04-04', 'فوقة', 'محمد', 'عبد الله', '1972-12-31', 'تاجنة', 'ابتدائي', 'تاجنة أبو الحسن الشلف', 'ذكر', 'حر', '02/128/2020', '2020-02-18', NULL, 'القديم', 'B,C1,C2'),
('00073-2021-283', '2021-04-04', 'علاوي', 'عبد القادر', 'خليفة', '1970-02-05', 'بوقادير', 'ابتدائي', 'الوساسرة الصبحة الشلف', 'ذكر', 'حر', '02/403/2017', '2017-03-23', '2022-03-21', 'القديم', 'B,C1,C2,E'),
('00074-2021-283', '2021-04-04', 'بلمختار', 'يوسف', 'محمد', '1983-01-25', 'الصبحة', 'متوسط', 'العمالسة الصبحة- الشلف', 'ذكر', 'حر', '02/855/2018', '2018-07-09', '2023-07-08', 'القديم', 'B,C1,C2'),
('00075-2019-283', '2019-02-11', 'هاشمي', 'حسين', 'عبد القادر', '1983-08-13', 'بوزغاية', 'ابتدائي', 'محطة بوزغاية حميس رقم 15 الشلف', 'ذكر', 'حر', '02/374/2020', '2020-08-06', NULL, 'القديم', 'B,C1,C2,E'),
('00075-2021-283', '2021-04-04', 'خروبي', 'عمر', 'عبد القادر', '1977-11-25', 'الصبحة', 'ابتدائي', 'الحنيشات الصبحة -الشلف', 'ذكر', 'حر', '02/953/2019', '2019-08-27', '2024-08-26', 'القديم', 'B,C1,C2,D,E'),
('00076-2021-283', '2021-04-05', 'عكاكزة', 'صالح', 'أحمد', '1977-06-25', 'سنجاس', 'ابتدائي', 'منطقة س 08 رقم 343 الشطية الشلف', 'ذكر', 'حر', '02/156/2019', '2019-01-23', '2024-01-22', 'القديم', 'B,C1,C2'),
('00077-2019-283', '2019-02-11', 'علي حيمود', 'عمر', 'علي', '1979-08-19', 'العطاف', 'متوسط', 'حرشون مركز - الشلف', 'ذكر', 'حر', '02/13/2016', '2016-01-06', '2020-01-21', 'القديم', 'B,C1'),
('00077-2021-283', '2021-04-05', 'عياش', 'جيلالي', 'خليفة', '1964-10-07', 'أولاد فارس', 'ابتدائي', 'كابير أولاد فارس', 'ذكر', 'حر', '02/1129/2018', '2018-09-19', '2028-09-17', 'القديم', 'B,C1,C2,D,E'),
('00078-2021-283', '2021-04-05', 'أملال', 'سليم', 'جلول', '1978-03-29', 'الشلف', 'ابتدائي', 'حي الفتح واد سلي الشلف', 'ذكر', 'حر', '02/1248/2019', '2019-09-22', '2024-09-21', 'القديم', 'B,C1,C2,D,E'),
('00079-2019-283', '2021-02-11', 'عامر', 'محمد', 'أمحمد', '1971-03-17', 'سنجاس', 'متوسط', 'بقعة أولاد محمد الشلف', 'ذكر', 'حر', '02/16124/15', '2015-09-20', '2020-09-19', 'القديم', 'B,C1,C2'),
('00079-2021-283', '2021-04-05', 'عيسى بختاش', 'بن عودة', 'قدور', '1991-01-06', 'سنجاس شلف', 'ابتدائي', 'بقعة سيدي عبد القادر الشطية الشلف', 'ذكر', 'حر', '02/1617/2017', '2017-07-12', '2022-01-01', 'القديم', 'B,C1,D'),
('00080-2019-283', '2019-02-11', 'قاصب', 'فاتح', 'دحمان', '1985-07-10', 'واد الفضة', 'متوسط', 'حي بونعامة حرشون - الشلف', 'ذكر', 'حر', '02/556/2018', '2018-09-19', '2023-07-08', 'القديم', 'B,C1,C2,D'),
('00080-2021-283', '2021-04-06', 'بن شاعة', 'محمد', 'الحسين', '1991-10-04', 'تنس', 'ابتدائي', 'حي عياشي محمد-أغبال-تلعصة', 'ذكر', 'حر', '02/163/2018', '2018-05-23', '2023-10-03', 'القديم', 'B,C1'),
('00081-2019-283', '2019-02-11', 'مسار', 'يوسف', 'محمد', '1981-10-17', 'المرسى', 'ابتدائي', 'الهضبة رقم 26 الزبوجة - الشلف', 'ذكر', 'حر', '02/354/2016', '2016-02-24', '2021-02-23', 'القديم', 'B,C1,C2,E'),
('00081-2021-283', '2021-04-06', 'بن سونة', 'عثمان', 'عبد القادر', '1964-01-30', 'أولاد فارس', 'ابتدائي', 'المدينة الأبيض مجاجة', 'ذكر', 'حر', '02/68/2021', '2021-02-04', '2026-02-03', 'القديم', 'B,C1,C2,D,E'),
('00082-2019-283', '2021-02-11', 'خليلي', 'فريد', 'محمد', '1980-02-11', 'الزبوجة', 'ابتدائي', 'حي الهضبة الزبوجة - الشلف', 'ذكر', 'حر', '02/2843/2015', '2015-02-17', '2020-02-16', 'القديم', 'B,C1,C2,D,E'),
('00082-2021-283', '2021-04-06', 'علاوي', 'علي', 'محمد', '1975-11-09', 'سنجاس', 'ابتدائي', 'بقعة العبايب الحجاج- الشلف', 'ذكر', 'حر', '02/230/2020', '2020-11-09', '2025-11-03', 'القديم', 'B,C1,C2'),
('00083-2019-283', '2019-09-06', 'أحمدي بوجلطية', 'نور الدين', 'جيلالي', '1977-09-17', 'الشلف', 'جامعي', 'م 09  رقم 49 الشطية الشلف', 'ذكر', 'حر', '02/1117/2015', '2015-09-17', NULL, 'القديم', 'B,C1,C2'),
('00083-2021-283', '2021-04-06', 'بغاش', 'أسامة', 'أحمد', '1993-12-13', 'الشطية', 'متوسط', 'منطقة النشاطات الشطية - الشلف', 'ذكر', 'حر', '02/2218/2020', '2020-11-18', '2025-11-17', 'القديم', 'B,C2'),
('00084-2021-283', '2019-02-13', 'بلعلة', 'عبد القادر', 'معمر', '1991-01-31', 'تاجنة', 'متوسط', 'تاجنة أبو الحسن', 'ذكر', 'حر', '02/1018/2016', '2016-07-19', NULL, 'القديم', 'B,C2'),
('00084-2021-283', '2021-04-07', 'بوجدية', 'محمد', 'لعربي', '1979-01-06', 'تاجنة', 'ابتدائي', 'تاجنة -أبو الحسن', 'ذكر', 'متعاقد', '02/120/2017', '2017-02-12', '2022-01-06', 'القديم', 'B,C1,C2,E'),
('00085-2019-283', '2019-02-13', 'عبان', 'محمد', 'عبد القادر', '1973-05-29', 'أولاد بن عبد القادر', 'متوسط', 'حي لالة عودة رقم 194 الشلف', 'ذكر', 'متعاقد', '02/10960/2015', '2015-07-15', NULL, 'القديم', 'B,C1,C2,D,E'),
('00085-2021-283', '2021-04-07', 'معراف', 'مراد', 'بن عبد الله', '1987-04-23', 'واد الفضة', 'متوسط', 'بقعة أولاد بواعلي أولاد عباس - الشلف', 'ذكر', 'حر', '02/347/2017', '2017-11-05', '2022-11-04', 'القديم', 'B,C1,C2'),
('00086-2021-283', '2021-04-07', 'طاجين', 'مجيد', 'الحبيب', '1985-02-07', 'بوقادير', 'ابتدائي', 'أولاد حمادي الصبحة الشلف', 'ذكر', 'حر', '02/3994/2016', '2016-10-18', '2021-05-11', 'القديم', 'B,C1,C2'),
('00087-2019-283', '2019-02-14', 'نورة', 'محمد', 'معمر', '1984-10-16', 'الزبوجة', 'ابتدائي', 'بقعة الفلاقية بنايرية الشلف', 'ذكر', 'حر', '02/180/2020', '2020-05-03', '2025-05-02', 'القديم', 'B,C1,C2,E'),
('00089-2021-283', '2021-04-08', 'تاهمي', 'محمد حسيان', 'محمد', '1974-09-27', 'الشلف', 'ابتدائي', 'م04 رقم 321 الشطية -الشلف', 'ذكر', 'حر', '02/25897/2015', '2015-11-17', '2022-11-18', 'بيومتري', 'B,C1,C'),
('00090-2021-283', '2021-04-08', 'مقوري', 'عبد القادر', 'أحمد', '1969-04-02', 'أولاد فارس الشلف ', 'ابتدائي', 'أولاد هني أولاد فارس الشلف', 'ذكر', 'حر', '02/1116/2019', '2019-12-04', '2024-11-20', 'القديم', 'B,C1,C2'),
('00091-2021-283', '2021-04-11', 'شوال', 'سماعين', 'قدور', '1957-01-31', 'بوزغاية', 'ابتدائي', 'القرية الفلاحية الشطية - الشلف', 'ذكر', 'حر', '02/228/2020', '2020-02-03', '2025-02-02', 'القديم', 'B,C1,C2,D,E'),
('00091-2021-283', '2021-04-11', 'بوشكارة', 'الوافي', 'محجوب', '1969-01-11', 'أولاد فارس الشلف', 'ابتدائي', 'م 05 رقم 188 الشطية الشلف ', 'ذكر', 'حر', '02/712/2016', '2021-08-29', '2021-12-28', 'القديم', 'B,C1,C2,D,E'),
('00093-2021-283', '2021-04-11', 'مقران', 'خليفة', 'لحبيب', '1985-02-15', 'الشطية الشلف', 'ابتدائي', 'بقعة الأرض البيضاء الشطية الشلف', 'ذكر', 'حر', '02/2240/2020', '2020-11-18', '2025-11-17', 'القديم', 'B,C1,C2'),
('00094-2019-283', '2019-08-17', 'معايزية', 'أبوبكر', 'جيلالي', '1992-02-27', 'أم الدروع', 'متوسط', 'بقعة المعايزية أم الدروع - الشلف', 'ذكر', 'حر', '02/616/2014', '2014-09-25', '2019-02-16', 'القديم', 'B,C1,C2'),
('00094-2021-283', '2021-04-11', 'بوغاري', 'أحمد', 'بن عمارة', '1977-07-08', 'الصبحة', 'ابتدائي', 'أولاد فطي الصبحة الشلف', 'ذكر', 'حر', '02/453/2017', '2017-04-02', '2022-04-01', 'القديم', 'B,C1,C2,D'),
('00095-2021-283', '2021-04-11', 'بن عتو', 'كمال', 'محمد', '1967-09-10', 'الشلف', 'ابتدائي', 'سيدي لعوسي وادي سلي الشلف', 'ذكر', 'حر', '02/403/2020', '2020-04-07', NULL, 'القديم', 'B,C1,C2,E'),
('00097-2019-283', '2019-02-18', 'مكر الدي', 'محمد', 'محمد', '1978-05-17', 'أولاد بن عبد القادر ', 'ابتدائي', 'بوقادير الشلف', 'ذكر', 'حر', '02/2999/2015', '2015-03-09', NULL, 'القديم', 'B,C1,C2'),
('00097-2021-283', '2021-04-12', 'كركوري', 'كمال', 'معمر', '1990-12-10', 'الشلف', 'متوسط', 'القرية الفلاحية الشطية- الشلف', 'ذكر', 'حر', '02/029/2017', '2017-01-04', '2023-01-20', 'القديم', 'B,C1,C2'),
('00098-2019-283', '2019-02-20', 'بن غالي', 'أحمد', 'عبد الماحي ', '1961-03-13', 'العبادية', 'بدون مستوى', 'بقعة أولاد بواعلي أولاد عباس الشلف', 'ذكر', 'حر', '02/787/2016', '2016-03-13', NULL, 'القديم', 'B,C1,C2,E'),
('00098-2021-283', '2021-04-12', 'طهاري', 'كمال', 'عبد القادر', '1988-09-03', 'الشطية', 'متوسط', 'بقعة الأرض البيضاء الشطية- الشلف', 'ذكر', 'حر', '02/1078/2019', '2019-06-10', '2024-06-09', 'القديم', 'B,C1,C2'),
('00099-2019-283', '2019-02-20', 'لعراجي', 'عبد القادر', 'ميسوم', '1987-11-16', 'وادي الفضة', 'متوسط', 'حي كوان وادي الفضة الشلف', 'ذكر', 'حر', '02/449/2018', '2018-03-12', NULL, 'القديم', 'B,C1,D'),
('00099-2021-283', '2021-04-12', 'رحال', 'عبد القادر', 'محمد', '1977-03-20', 'الزبوجة', 'ابتدائي', 'حي الوئام عمارة 60 رقم 14 الزبوجة - الشلف', 'ذكر', 'حر', '02/270/2020', '2020-05-13', '2025-05-10', 'القديم', 'B,C1'),
('00100-2019-283', '2019-02-20', 'علي بن يحي', 'أحمد', 'خوجة', '1956-09-19', 'العطاف', 'ابتدائي', 'بقعة الزمالة العطاف عين دفلى', 'ذكر', 'حر', '44/04/2289/2016', '2016-06-06', NULL, 'القديم', 'B,C1,C2,D,E'),
('00100-2021-283', '2021-04-12', 'بن مديوني', 'أحمد', 'طيب', '1977-10-20', 'أولاد بن عبد القادر ', 'ابتدائي', 'حي عبد القادر بن باديس أولاد بن عبد القادر الشلف', 'ذكر', 'حر', '02/252/2018', '2018-03-27', '2023-03-26', 'القديم', 'B,C1,C2,D'),
('00101-2021-283', '2021-04-12', 'لومي', 'أمحمد', 'طاهر', '1949-04-20', 'بوزغاية الشلف', 'ابتدائي', 'حي الشقة رقم 10 الشلف', 'ذكر', 'حر', '02/1701/2017', '2017-03-12', '2022-03-11', 'القديم', 'B,C1,C2,E'),
('00102-2021-283', '2021-04-14', 'سحنون', 'يونس عمر', 'محمد', '1992-02-10', 'سنجاس', 'متوسط', 'حي صالحي رقم 07 سنجاس -الشلف', 'ذكر', 'حر', '00003071', '2021-04-21', '2021-09-02', 'بيومتري', 'B,C1'),
('00103-2021-283', '2021-04-14', 'قريبي', 'رمضان', 'محمد', '1968-12-12', 'شلف', 'ابتدائي', 'بقعة الارض البيضاء الشطية الشلف', 'ذكر', 'حر', '02/2436/2020', '2020-12-17', '2025-12-16', 'القديم', 'B,C1,C2,E'),
('00104-2021-283', '2021-04-14', 'بوخاري', 'عبد الله', 'محمد', '1975-11-01', 'الشلف', 'ابتدائي', 'شارع المرشح دحنان رقم 36 الشلف', 'ذكر', 'حر', '02/7346/2017', '2017-09-20', '2022-09-19', 'القديم', 'B,C1,C2,D,E'),
('00105-2021-283', '2021-04-15', 'بن خليفة', 'معمر', 'محمد', '1987-03-05', 'الشطية', 'متوسط', 'حي النصر  الزبوجة  الشلف', 'ذكر', 'حر', '02/579/2019', '2019-09-09', NULL, 'القديم', 'B,C1,C2,E'),
('00106-2019-283', '2019-02-26', 'مخلوف', 'مصطفى', 'بوسدرة', '1974-02-04', 'الشلف', 'متوسط', 'حي الحرية رقم 43 الشلف', 'ذكر', 'حر', '02/311/2016', '2016-02-09', NULL, 'القديم', 'B,C1,C2'),
('00106-2021-283', '2021-04-15', 'ناجي', 'أحمد', 'قدور', '1969-01-05', 'الهرانفة الشلف', 'ابتدائي', 'أولاد الجيلالي الصبحة الشلف', 'ذكر', 'حر', '02/559/2019', '2019-05-05', '2023-05-04', 'القديم', 'B,C1,C2,E'),
('00107-2019-283', '2019-02-26', 'حاج هني', 'أحمد', 'عبد القادر', '1986-04-18', 'الشلف', 'متوسط', 'حي النصر م07 رقم 41 الشلف', 'ذكر', 'حر', '02/24991/2015', '2015-11-15', '2021-08-08', 'القديم', 'B,C1,E'),
('00107-2021-283', '2021-04-15', 'عبد القادر قطاوي', 'عيسى', 'محمد', '1975-03-11', 'عين مران', 'ابتدائي', 'حي الشهيد بوكري  محمد عين العزلة بلدية عين مران الشلف', 'ذكر', 'حر', '02/112/2020', '2020-01-26', '2025-01-26', 'القديم', 'B,C1,C2,D,E'),
('00108-2021-283', '2021-04-15', 'بردي', 'مولود', 'محمد', '1984-11-25', 'الشلف', 'ابتدائي', 'أولاد أحمد الأبيض مجاجة الشلف', 'ذكر', 'حر', '02/99/2016', '2016-12-06', '2021-12-05', 'القديم', 'B,C1,C2'),
('00109-2021-283', '2021-04-17', 'خروب  بومداح', 'خليفة', 'معمر', '1967-12-31', 'بوقادير', 'ابتدائي', 'أولاد الجيلالي  الصبحة الشلف', 'ذكر', 'حر', '02/1617/2017', '2017-12-05', '2022-11-25', 'القديم', 'B,C1,C2'),
('00110-2021-283', '2021-04-17', 'بشايري', 'محمد', 'علي', '1977-12-31', 'أولاد فارس', 'ابتدائي', 'أولاد براهيم أولاد فارس الشلف', 'ذكر', 'حر', '02/247/2020', '2020-02-27', NULL, 'القديم', 'B,C1,C2,D,E'),
('00111-2021-283', '2021-04-17', 'منصور', 'إبراهيم', 'بوعبد الله', '1978-08-02', 'الصبحة', 'ابتدائي', 'الزرايق الصبحة- الشلف', 'ذكر', 'حر', '02/033/2020', '2020-01-08', '2024-12-29', 'القديم', 'B,C1,C2,D,E'),
('00112-2021-283', '2021-04-18', 'شرفي', 'رشيد', 'عبد القادر', '1987-12-08', 'تلعصة', 'ابتدائي', '  حي بوعزة عبد الله أغبال تلعصة ', 'ذكر', 'حر', '02/284/2020', '2020-12-16', '2025-12-07', 'القديم', 'B,C1'),
('00113-2021-283', '2021-04-18', 'ماجي', 'أحمد', 'محمد', '1971-09-14', 'بوزغاية', 'متوسط', 'حي بن باديس تلعصة أبو الحسن الشلف', 'ذكر', 'حر', '02/108/2017', '2017-04-18', '2022-09-13', 'القديم', 'B,C1,C2,D,E'),
('00114-2021-283', '2021-04-18', 'جعفر', 'محمد', 'محمد', '1986-08-18', 'الشلف', 'متوسط', 'حي النشاطات رقم 02 الشطية الشلف', 'ذكر', 'حر', 'A00721166', '2020-06-10', NULL, 'بيومتري', 'B,C1,C1E'),
('00115-2021-283', '2021-04-18', 'حمادة', 'محمد', 'محمد', '1962-02-16', 'الشلف', 'ابتدائي', 'رقم 135 الشطية الشلف J حي 150 مسكن عمارة ', 'ذكر', 'حر', '02/2480/2019', '2019-12-30', NULL, 'القديم', 'B,C1,C2,E'),
('00116-2021-283', '2021-04-19', 'طاهري', 'نور الدين', 'محمد', '1981-09-09', 'الشلف', 'متوسط', 'حي شريفي طريق وهران رقم 02 الشلف', 'ذكر', 'حر', '02/10343/2017', '2017-12-17', NULL, 'القديم', 'B,C1,C2,D'),
('00118-2021-283', '2021-04-20', 'هني', 'الحسن', 'عبد القادر', '1983-03-01', 'أولاد فارس', 'ابتدائي', 'الحمايمية أولاد فارس الشلف', 'ذكر', 'متعاقد', '02/396/2020', '2020-05-06', '2025-05-02', 'القديم', 'B,C1'),
('00119-2021-283', '2021-04-20', 'سوفلي', 'سعيد', 'قدور', '1977-11-16', 'الشلف', 'ابتدائي', 'بقعة الشطية الشلف', 'ذكر', 'متعاقد', '02/2884/2017', '2017-11-08', '2022-11-07', 'القديم', 'B,C1,C2'),
('00120-2019-283', '2019-10-13', 'فردي', 'حميد', 'محمد', '1986-08-03', 'أولاد فارس', 'متوسط', 'أولاد هني أولاد فارس - الشلف', 'ذكر', 'حر', '02/6271/2015', '2015-02-23', '2020-02-22', 'القديم', 'B,C1,C2,E'),
('00120-2021-283', '2021-04-20', 'بختي', 'عمر', 'العربي', '1979-07-29', 'أولاد فارس', 'ابتدائي', 'القطايبية أولاد فارس الشلف', 'ذكر', 'متعاقد', '02/1094/2017', '2017-08-20', '2022-07-26', 'القديم', 'B,C1,C2,E'),
('00121-2021-283', '2021-04-20', 'بوجدية', 'عبد الهادي', 'عبد القادر', '1983-06-28', 'بوزغاية', 'ابتدائي', 'تاجنة أبو الحسن الشلف', 'ذكر', 'متعاقد', '02/280/2020', '2020-05-20', '2025-06-27', 'القديم', 'B,C1,C2,D'),
('00122-2021-283', '2021-04-20', 'نعيمة', 'نبيل', 'محمد', '1988-03-02', 'أولاد فارس', 'ابتدائي', 'بقعة الأرض البيضاء الشطية الشلف', 'ذكر', 'متعاقد', '02/325/2020', '2020-02-10', '2025-02-09', 'القديم', 'B,C1'),
('00123-2021-283', '2021-04-20', 'تقار', 'بوعلام', 'محمد', '1965-05-23', 'الشلف', 'ابتدائي', 'حي لالة عودة رقم 741 الشلف', 'ذكر', 'متعاقد', '02/3234/2018', '2018-05-09', '2023-05-08', 'القديم', 'B,C1,C2,D,E'),
('00124-2021-283', '2021-04-20', 'بودادة', 'عبد القادر', 'محمد', '1964-12-17', 'المرسى', 'ابتدائي', 'المدينة الجديدة عمارة ج 1 رقم 04 الشطية الشلف', 'ذكر', 'متعاقد', '02/761/2016', '2016-03-02', '2021-03-01', 'القديم', 'B,C1,C2,E'),
('00125-2019-283', '2019-12-30', 'جعرير', 'عبد القادر', 'علي', '1977-01-10', 'تلعصة', 'ابتدائي', 'حي الزيتون تلعصة - أبو الحسن - الشلف', 'ذكر', 'حر', '02/04/2017', '2017-01-03', '2022-01-09', 'القديم', 'B,C1,C2,D,E'),
('00125-2021-283', '2021-04-20', 'بشايري', 'محمد', 'خليفة', '1971-12-31', 'الهرانفة', 'ابتدائي', 'حي 170 مسكن عمارة ب رقم 35 الشطية الشلف', 'ذكر', 'متعاقد', '02/552/2020', '2020-02-07', '2025-02-26', 'القديم', 'B,C1,C2,D,E'),
('00127-2019-283', '2019-12-30', 'بغداوي', 'عبد الكريم', 'محمد', '1991-10-05', 'الشطية', 'متوسط', 'بقعة الرملية - الشلف', 'ذكر', 'حر', '02/348/2019', '2019-01-21', '2024-01-20', 'القديم', 'B,C2'),
('00127-2021-283', '2021-04-20', ' منصور بكرطاش', 'عبد الرحمان', 'محمد', '1955-03-27', 'سنجاس', 'ابتدائي', 'م د 03 رقم 212 الشطية الشلف', 'ذكر', 'متعاقد', '02/596/2017', '2017-03-07', '2023-03-06', 'القديم', 'B,C1,C2,D,E'),
('00128-2019-283', '2019-12-30', 'قاصب', 'عبد الجليل', 'دحمان', '1993-05-22', 'الشلف', 'متوسط', 'حي بونعامة حرشون - الشلف', 'ذكر', 'حر', '02/365/2016', '2016-07-30', '2024-04-10', 'القديم', 'B,C2'),
('00128-2021-283', '2021-04-20', 'شاهد', 'أمين', 'محمد', '1978-10-24', 'الشلف', 'ابتدائي', 'م 05 رقم 04 الشطية الشلف', 'ذكر', 'متعاقد', '02/129/2016', '2016-10-01', '2021-10-10', 'القديم', 'B,C1,C2,E'),
('00129-2021-283', '2021-04-20', 'غربي', 'معمر', 'بلحسن', '1960-11-07', 'أولاد فارس', 'ابتدائي', 'المركز أولاد فارس الشلف', 'ذكر', 'متعاقد', '02/947/2019', '2019-10-20', '2024-10-09', 'القديم', 'B,C1,C2,D,E'),
('00131-2021-283', '2021-04-21', 'طويل', 'عمر', 'مروان', '1981-11-10', 'الحراش', 'ابتدائي', 'حي تيفلاس تنس', 'ذكر', 'حر', '02/1230/2019', '2019-11-10', '2029-11-06', 'القديم', 'B,C1,C2,D,E'),
('00132-2021-283', '2021-04-22', 'عدة', 'محمد', 'أحمد', '1968-01-23', 'الشلف', 'ابتدائي', 'بقعة الحمام أم الدروع الشلف ', 'ذكر', 'حر', '02/17833/15', '2015-10-10', '2021-04-16', 'القديم', 'B,C1,C2,D,E'),
('00134-2021-283', '2021-04-22', 'عزايز', 'أمحمد', 'محمد', '1977-09-20', 'سنجاس الشلف', 'ابتدائي', 'بقعة أولاد سي احمد سنجاس الشلف', 'ذكر', 'حر', '02/399/2020', '2020-07-22', '2025-07-21', 'القديم', 'B,C1,C2'),
('00135-2021-283', '2021-04-22', 'طاهري', 'طاهر', 'شارف', '1967-02-14', 'أولاد فارس', 'متوسط', 'القطايبية أولاد فارس الشلف', 'ذكر', 'حر', '02/209/2017', '2017-02-03', NULL, 'القديم', 'B,C1,C2,D,E'),
('00137-2021-283', '2021-04-25', 'بوسكة', 'الهاشمي شريف', 'محمد', '1973-12-19', 'مليانة', 'متوسط', 'حي 668 مسكن د 3 رقم 100 حي بن سونة الشلف', 'ذكر', 'حر', 'R01941600', '2021-04-18', NULL, 'بيومتري', 'B,D,C1,C,BE,C1E,CE,DE'),
('00138-2021-283', '2021-04-25', 'قوادري بوجلطية', 'عبد القادر', 'بنحليمة', '1994-02-09', 'الشطية', 'متوسط', 'منطقة 09 رقم 43 الشطية الشلف', 'ذكر', 'حر', 'R01319194', '2021-02-07', NULL, 'بيومتري', 'B,C,BE,CE'),
('00139-2021-283', '2021-04-25', 'قوادري بوجلطية', 'عبد الحق', 'بنحليمة', '1986-07-10', 'أولاد فارس', 'متوسط', 'منطقة 09 رقم 43 الشطية الشلف', 'ذكر', 'حر', '02/2723/2018', '2018-11-14', NULL, 'القديم', 'B,C1,E'),
('00140-2021-283', '2021-04-26', 'دوبة', 'حميد', 'محمد', '1977-05-08', 'الزبوجة', 'متوسط', 'حي 20 مسكن الزبوجة الشلف', 'ذكر', 'حر', '02/398/2017', '2017-05-14', NULL, 'القديم', 'B,C1,C2,D,E'),
('00141-2021-283', '2021-04-26', 'قيطون', 'ابراهيم', 'محمد', '1987-11-24', 'واد سلي', 'متوسط', 'حي الحرية واد سلي الشلف', 'ذكر', 'حر', '02/674/2019', '2019-05-08', '2024-10-05', 'القديم', 'B,C1,E'),
('00142-2021-283', '2021-04-27', 'باهي عزوهم', 'أمحمد', 'طاهر', '1978-08-25', 'الزبوجة', 'ابتدائي', 'حي البستان بلدية الزبوجة الشلف', 'ذكر', 'حر', '02/242/2018', '2018-03-26', '2023-01-24', 'القديم', 'B,C1,C2'),
('00143-2021-283', '2021-04-29', 'قارة', 'محمد', 'أحمد', '1968-08-12', 'أولاد فارس', 'ابتدائي', 'حوش الغابة أولاد فارس', 'ذكر', 'حر', '02/169/2017', '2017-01-31', '2022-01-30', 'القديم', 'B,C1,C2,D'),
('00147-2021-283', '2021-04-29', 'عكاكزة', 'عبد القادر', 'محمد', '1983-09-18', 'سنجاس', 'ابتدائي', 'بقعة سوفرة بلدية الحجاج الشلف', 'ذكر', 'متعاقد', '02/095/2017', '2017-03-14', '2022-03-13', 'القديم', 'B,C1,C2'),
('00148-2021-283', '2021-04-29', 'عدروش', 'عبد القادر', 'مخطار', '1963-05-25', 'بني شعيب - تيسمسيلت', 'ابتدائي', 'م س 08 رقم 153 الشطية الشلف', 'ذكر', 'حر', '02/1787/2016', '2016-05-30', NULL, 'القديم', 'B,C1,C2,E'),
('00149-2021-283', '2021-05-02', 'بطوش', 'لخضر', 'عبد القادر ', '1976-08-01', 'تاجنة', 'ابتدائي', 'سيدي زيان تاجنة الشلف', 'ذكر', 'متعاقد', '02/623/2018', '2018-08-13', '2023-07-31', 'القديم', 'B,C1,C2,E'),
('00151-2021-283', '2021-05-02', 'كرفي قطيب', 'العيد', 'جيلالي', '1973-10-30', 'أولاد فارس', 'ابتدائي', 'القطايبية أولاد فارس الشلف', 'ذكر', 'حر', '02/1148/2020', '2020-11-19', NULL, 'القديم', 'B,C1,C2'),
('00153-2021-283', '2021-05-03', 'فرحات خوجة', 'سايح', 'محمد', '1977-12-31', 'أولاد فارس', 'ابتدائي', 'حوش الغابة أولاد فارس', 'ذكر', 'حر', '02/738/2020', '2020-08-11', NULL, 'القديم', 'B,C1,C2,D'),
('00155-2021-283', '2021-05-03', 'مسعودي', 'معمر', 'يحي', '1982-06-15', 'الزبوجة', 'ابتدائي', 'التوابرية الزبوجة الشلف', 'ذكر', 'حر', '02/846/2016', '2016-05-16', '2021-05-15', 'القديم', 'B,C1,C2');
INSERT INTO `candidat` (`NUM_INS`, `DATE_INS`, `NOM_CANDIDAT`, `PRENOM_CANDIDAT`, `PRENOM_PERE`, `DATE_NAIS_CANDIDAT`, `LIEU_NAIS_CANDIDAT`, `NIVEAU_SCOL_CANDIDAT`, `ADRESSE_CANDIDAT`, `SEX_CONDIDAT`, `TYPE_CANDIDAT`, `NUM_PERMIS`, `DATE_LIV_PERMIS`, `DATE_EXP_PERMIS`, `TYPE_PERMIS`, `CATEGORIE_PERMIS`) VALUES
('00156-2021-283', '2021-05-03', 'مسعودي', 'علي', 'محمد', '1983-02-22', 'الزبوجة', 'ابتدائي', 'التوايرية رقم 70 بلدية الزبوجة  الشلف', 'ذكر', 'حر', '02/248/2021', '2021-04-12', '2025-04-10', 'القديم', 'B,C1,C2'),
('00157-2021-283', '2021-05-04', 'دغرار', 'محمد', 'عبد القادر', '1977-02-20', 'بوزغاية', 'ابتدائي', 'بقعة اللوايلية رقم 117 بوزغاية الشلف', 'ذكر', 'حر', '02/402/2020', '2020-08-06', NULL, 'القديم', 'B,C1,C2,E'),
('00158-2021-283', '2021-05-04', 'بوميرة', 'سليم', 'محمد', '1988-06-21', 'بني حواء', 'متوسط', 'حي مريجي فوكة تيبازة', 'ذكر', 'حر', '02/', '2021-08-22', NULL, 'القديم', 'B,C1'),
('00159-2021-283', '2021-04-04', 'خروب بومداح', 'أحمد', 'معمر', '1983-02-20', 'الصبحة', 'ابتدائي', 'أولاد الجيلالي الصبحة الشلف', 'ذكر', 'حر', '02/955/2020', '2020-09-24', '2025-09-08', 'القديم', 'B,C1,C2,E'),
('00160-2021-283', '2021-05-04', 'رحموني', 'مجيد', 'محمد', '1983-04-13', 'أولاد فارس', 'متوسط', 'السعايدية أولاد فارس الشلف', 'ذكر', 'حر', '02/1056/2019', '2019-11-18', NULL, 'القديم', 'B,C1,C2'),
('00161-2021-283', '2021-05-05', 'صدوقي', 'سيد علي', 'محمد', '1982-11-15', 'الشلف', 'متوسط', 'حي مداحي الشلف', 'ذكر', 'حر', '02/2279/2016', '2016-04-10', NULL, 'القديم', 'B,C1,C2'),
('00162-2021-283', '2021-05-05', 'طالب', 'ميلود', 'محمد', '1978-12-31', 'تاجنة', 'ابتدائي', 'تاجنة-أبو الحسن', 'ذكر', 'حر', '02/569/2020', '2020-09-28', '2025-09-27', 'القديم', 'B,C1,C2,E'),
('00163-2021-283', '2021-05-05', 'مسعودي', 'عبد القادر', 'يحي', '1969-12-11', 'الزبوجة', 'ابتدائي', 'حي البستان رقم 143الزبوجة- الشلف', 'ذكر', 'حر', '02/363/2017', '2017-05-03', '2022-05-02', 'القديم', 'B,C1,C2,D,E'),
('00164-2021-283', '2021-05-10', 'رابح مزاري', 'محمد', 'محمد', '1993-11-07', 'الشلف', 'متوسط', 'الحجاج مركز ', 'ذكر', 'حر', 'A00092768', '2019-07-01', '2029-06-30', 'بيومتري', 'B,C1,BE,C1E'),
('00168-2021-283', '2021-05-06', 'عين سمن', 'بن يحي', 'طاهر', '1955-09-23', 'الصبحة', 'ابتدائي', 'أولاد حمادي الصبحة- الشلف', 'ذكر', 'متعاقد', '02/474/2017', '2017-04-05', '2022-04-03', 'القديم', 'B,C1,C2,E'),
('00169-2021-283', '2021-05-06', 'بن عمار', 'محمد', 'خليفة', '1979-04-15', 'بوقادير', 'متوسط', 'حي قلفوط بوقادير - الشلف', 'ذكر', 'متعاقد', '02/975/2017', '2017-05-16', '2022-05-16', 'القديم', 'B,C1,C2'),
('00170-2021-283', '2021-05-06', 'صاولة', 'الحسين', 'جلول', '1979-09-17', 'الصبحة', 'متوسط', 'أولاد الجيلالي الصبحة الشلف', 'ذكر', 'حر', '02/240/2020', '2020-03-10', NULL, 'القديم', 'B,C1,C2,E'),
('00171-2021-283', '2021-05-08', 'ساعد', 'عبد الوهاب', 'محمد', '1986-10-11', 'تنس', 'ابتدائي', 'حي النصر رقم 15 الزبوجة ولاية- الشلف', 'ذكر', 'حر', '02/567/2020', '2020-09-16', '2025-09-14', 'القديم', 'B,C1,C2,E'),
('00172-2021-283', '2021-05-09', 'برشوة', 'معمر', 'الحاج', '1976-12-04', 'الهرانفة', 'ابتدائي', 'الحي الجديد بلدية الهرانفة', 'ذكر', 'حر', '02/79/2017', '2017-02-09', '2022-02-09', 'القديم', 'B,C1,C2'),
('00173-2021-283', '2021-05-09', 'حليمة سالم', 'أحمد', 'محمد', '1992-08-22', 'الصبحة', 'متوسط', 'بوقادير الشلف', 'ذكر', 'متعاقد', 'A00546073', '2020-01-30', NULL, 'بيومتري', 'B,C1'),
('00174-2021-283', '2021-04-09', 'تلمساني', 'عزالدين', 'أحمد', '1988-11-16', 'تاجنة', 'متوسط', 'تاجنة أوالحسن الشلف', 'ذكر', 'حر', '02/149/2017', '2017-02-20', NULL, 'القديم', 'B,C1'),
('00175-2021-283', '2021-05-10', 'بن زرفة', 'إسماعيل', 'إبراهيم', '1995-12-31', 'بريرة', 'ابتدائي', 'بريرة دوار بومزال', 'ذكر', 'حر', '00013242', '2020-12-30', '2021-10-30', 'بيومتري', 'B,C1'),
('00178-2021-283', '2021-05-11', 'علاوي', 'أحمد', 'خليفة', '1980-12-31', 'بوقادير', 'متوسط', 'الوساسرة الصبحة الشلف', 'ذكر', 'حر', '02/828/2019', '2019-07-23', NULL, 'القديم', 'B,C1'),
('00179-2021-283', '2021-05-11', 'زناتي', 'زيان', 'محمد', '1981-01-02', 'المصدق', 'متوسط', 'بقعة الزنايتية بلدية مصدق الشلف', 'ذكر', 'حر', '02/49/2019', '2019-04-01', '2024-03-31', 'القديم', 'B,C1,C2'),
('00180-2021-283', '2021-05-12', 'تيعزلاتين', 'محمد', 'يوسف', '1971-08-25', 'المرسى', 'متوسط', 'حي الشهيد مسار عبد الهادي بلدية مصدق ', 'ذكر', 'حر', '02/65/2019', '2019-05-07', '2024-05-06', 'القديم', 'B,C1,C2,E'),
('00183-2021-283', '2021-05-16', 'بوزار عبابو', 'أحمد', 'محمد', '1960-02-06', 'سنجاس', 'ابتدائي', 'حي الإخوة عباد رقم 186 الشلف', 'ذكر', 'حر', '02/380/2016', '2016-02-10', NULL, 'القديم', 'B,C1,C2,E'),
('00184-2021-283', '2021-05-16', 'دريزي', 'محمد', 'محمد', '1971-11-03', 'عين مران', 'متوسط', 'بقعة الأرض البيضاء الشطية الشلف', 'ذكر', 'حر', '02/2740/2017', '2017-10-19', NULL, 'القديم', 'B,C1,C2,E'),
('00187-2021-283', '2021-05-16', 'بنابي', 'معمر', 'العربي', '1980-01-28', 'الشلف', 'متوسط', 'بقعة الشطية الشلف', 'ذكر', 'حر', '02/608/2020', '2020-02-26', NULL, 'القديم', 'B,C1,C2,E'),
('00188-2021-283', '2021-05-16', 'خديم', 'أحمد', 'محمد', '1987-05-11', 'تاجنة', 'متوسط', 'تاجنة أبو الحسن الشلف', 'ذكر', 'حر', '02/1141/2016', '2016-08-07', NULL, 'القديم', 'B,C1,C2'),
('00189-2021-283', '2021-05-16', 'طهاري', 'ناصر', 'عبدالقادر', '1975-12-14', 'الشلف', 'متوسط', 'بقعة الارض البيضاء الشطية الشلف', 'ذكر', 'متعاقد', '02/2710/2018', '2018-11-12', NULL, 'القديم', 'B,C1,C2,D,E'),
('00190-2021-283', '2021-05-16', 'وعزان', 'إسماعيل', 'عابد', '1990-09-24', 'الشطية', 'متوسط', 'بقعة الشطية الشلف', 'ذكر', 'حر', '02/2088/2020', '2020-10-28', NULL, 'القديم', 'B,C1'),
('00191-2021-283', '2021-05-16', 'وعزان', 'عابد', 'جيلالي', '1966-11-30', 'الشلف', 'ابتدائي', 'بقعة الشطية الشلف', 'ذكر', 'حر', '02/536/2020', '2020-02-27', NULL, 'القديم', 'B,C1,C2,D,E'),
('00192-2021-283', '2021-05-25', 'عطاطفة', 'معمر', 'عبد القادر', '1980-08-30', 'بوزغاية', 'متوسط', 'بقعة العطاطفة رقم 18 بوزغاية الشلف', 'ذكر', 'متعاقد', '02/736/2017', '2017-04-24', NULL, 'القديم', 'B,C1,C2,D,E'),
('00193-2021-283', '2021-05-17', 'خروبي', 'خوجة', 'محمد', '1984-02-18', 'عين مران', 'متوسط', 'الحنيشات الصبحة الشلف', 'ذكر', 'حر', '02/996/2019', '2019-09-08', NULL, 'القديم', 'B,C1,E'),
('00194-2021-283', '2021-05-18', 'مغربي', 'أمحمد', 'محمد', '1968-12-05', 'أولاد بن عبد القادر', 'ابتدائي', 'سنجاس- الشلف', 'ذكر', 'متعاقد', '02/31661/16', '2016-01-03', '2021-10-17', 'بيومتري', 'B,C1'),
('00195-2021-283', '2021-05-18', 'خليفي عثمان', 'عبد الإله', 'محمد', '1975-10-16', 'عين مران', 'متوسط', 'حي السلام حي سعدي رقم 15 الشلف', 'ذكر', 'حر', 'A01244784', '2021-01-08', '2031-01-07', 'بيومتري', 'B,C1,C,BE,C1E,CE'),
('00196-2021-283', '2021-05-18', 'بنور', 'إسماعيل', 'محمد', '1989-05-09', 'الشلف', 'متوسط', 'منطقة 10 رقم 488 الشطية الشلف', 'ذكر', 'حر', '02/648/2019', '2019-03-28', NULL, 'القديم', 'B,C1'),
('00197-2021-283', '2021-05-18', 'ثولال', 'مراد', 'محمد', '1991-06-16', 'الصبحة', 'ابتدائي', 'بقعة الوخاوخة الصبحة- الشلف', 'ذكر', 'متعاقد', 'A00404356', '2019-12-11', '2029-12-10', 'بيومتري', 'B,C'),
('00198-2021-283', '2021-05-18', 'بشير باي', 'توفيق', 'أحمد', '1981-04-26', 'الشلف', 'متوسط', 'منطقة س 08 رقم 46 الشطية الشلف', 'ذكر', 'حر', '02/0920/2018', '2018-04-03', NULL, 'القديم', 'B,C1'),
('00199-2021-283', '2021-05-18', 'هنية', 'حميد', 'عبد القادر', '1985-10-16', 'الشلف', 'متوسط', 'بقعة أولاد بخيرة سنجاس الشلف', 'ذكر', 'حر', '02/661/2020', '2020-11-02', NULL, 'القديم', 'B,C1,C2'),
('00200-2021-283', '2021-05-18', 'بوشكارة', 'أحمد', 'محجوب', '1960-02-14', 'أولاد فارس', 'ابتدائي', 'م04 بناية الشطية- الشلف', 'ذكر', 'حر', '02/592/2020', '2020-03-03', '2025-03-02', 'القديم', 'B,C1,C2,E'),
('00201-2021-283', '2021-05-19', 'دعماش', 'جيلالي', 'عبد القادر', '1960-12-31', 'بوزغاية', 'ابتدائي', 'بقعة الحباير الشطية الشلف', 'ذكر', 'حر', '02/1309/2016', '2016-04-19', NULL, 'القديم', 'B,C1,C2,E'),
('00202-2021-283', '2021-05-19', 'سعدي', 'محمد', 'هني', '1959-09-14', 'الشلف', 'ابتدائي', 'أولاد سيدي الشريف أولاد فارس - الشلف', 'ذكر', 'متعاقد', '02/838/2019', '2019-09-09', '2024-09-05', 'القديم', 'B,C1,C2,D,E'),
('00203-2021-283', '2021-05-19', 'جيلالي عياد', 'منير', 'بوعبدالله', '1988-09-17', 'زرالدة', 'ابتدائي', 'م د 03 رقم 794 الشطية الشلف ', 'ذكر', 'حر', '02/1687/2019', '2019-09-04', '2024-03-03', 'القديم', 'B,C1'),
('00204-2021-283', '2021-05-19', 'خلافي', 'بوعبد الله', 'بشير', '1967-02-08', 'أولاد فارس', 'ابتدائي', 'بقعة الشطية', 'ذكر', 'متعاقد', '02/439/2017', '2017-02-20', '2022-02-10', 'القديم', 'B,C1,C2,E'),
('00206-2021-283', '2021-05-22', 'جيلالي عياد', 'أحمد', 'عبد القادر', '1971-03-16', 'أولاد فارس ', 'ابتدائي', '  ولاد فارس O  حي 250 مسكن عمارة   ', 'ذكر', 'حر', '02/283/2021', '2021-03-15', NULL, 'القديم', 'B,C1,C2,E'),
('00207-2021-283', '2021-05-22', 'شابي', 'علي', 'جيلالي', '1965-02-07', 'الشلف', 'ابتدائي', 'م 02 رقم 236 الشطية - الشلف', 'ذكر', 'متعاقد', '02/331/2020', '2020-02-10', '2025-02-09', 'القديم', 'B,C1,C2,E'),
('00209-2021-283', '2021-05-23', 'كرفي قطيب', 'خالد', 'طاهر', '1980-07-04', 'أولاد فارس', 'متوسط', 'القطايبية أولاد فارس الشلف', 'ذكر', 'حر', '02/1087/2017', '2017-08-17', NULL, 'القديم', 'B,C1,C2,E'),
('00210-2021-283', '2021-05-23', 'بلعلة', 'الحاج', 'محمد', '1981-07-08', 'تنس', 'متوسط', 'الهرانفة عين مران الشلف', 'ذكر', 'حر', 'A00213504', '2019-09-19', NULL, 'بيومتري', 'B,D,C1,C'),
('00211-2021-283', '2021-05-23', 'ترقو', 'أمحمد', 'عبد القادر', '1979-01-19', 'أ. بن عبد القادر', 'متوسط', 'حي الدحاريج واد سلي الشلف', 'ذكر', 'متعاقد', '02/3878/2016', '2016-09-19', NULL, 'القديم', 'B,C1,C2,E'),
('00212-2021-283', '2021-05-23', 'ترقو', 'صالح', 'عبد القادر', '1989-03-23', 'أ. بن عبد القادر', 'متوسط', 'المدينة الأبيض مجاجة الشلف', 'ذكر', 'متعاقد', '02/96/2020', '2020-03-01', NULL, 'القديم', 'B,C1,E'),
('00213-2021-283', '2021-05-23', 'لوامي', 'خليفة', 'محمد', '1978-12-05', 'الهرانفة', 'متوسط', 'حي الحرية مزرعة  علي عيشوبة الشلف', 'ذكر', 'حر', '02/1049/2017', '2017-01-29', NULL, 'القديم', 'B,C1,C2,E'),
('00214-2021-283', '2021-05-25', 'حليمي', 'محفوظ', 'محمد', '1982-01-16', 'الشلف', 'متوسط', 'بقعة أولاد محمد رقم 05 الشلف', 'ذكر', 'حر', '02/999/2017', '2017-01-12', NULL, 'القديم', 'B,C1,C2'),
('00215-2021-283', '2021-05-26', 'فرفاش', 'محمد', 'إبراهيم', '1983-09-18', 'بوزغاية', 'متوسط', 'حي الصامت رقم 10 بوزغاية الشلف', 'ذكر', 'حر', '02/446/2019', '2019-09-16', NULL, 'القديم', 'B,C1,C2'),
('00216-2021-283', '2021-05-26', 'خطيب', 'جمال الدين محمود', 'محمد', '1982-12-08', 'الشلف', 'متوسط', 'حي النصر م 07 رقم 134 الشلف', 'ذكر', 'حر', '02/6354/2018', '2018-09-13', NULL, 'القديم', 'B,C1,C2,D'),
('00217-2021-283', '2021-05-26', 'مواكني', 'علي', 'أحمد', '1955-02-04', 'بوزغاية', 'ابتدائي', 'محطة حميس رقم 19 بوزغاية الشلف', 'ذكر', 'حر', '02/1113/2017', '2017-10-05', '2022-10-04', 'القديم', 'B,C1,C2,E'),
('00218-2021-283', '2021-05-26', 'بوثلجة', 'عمار', 'محمد', '1981-02-19', 'الشلف', 'متوسط', 'بقعة التقاقرة القديمة الشلف', 'ذكر', 'حر', '02/2211/2016', '2016-04-10', NULL, 'القديم', 'B,C1,C2'),
('00219-2021-283', '2021-05-26', 'بن ناصر', 'سيد أحمد', 'محمد', '1993-11-22', 'مازونة', 'متوسط', 'حي الشهيد بلومي بوشعيب عين مران الشلف', 'ذكر', 'حر', '02/866/2019', '2019-07-30', NULL, 'القديم', 'B,C1'),
('00220-2021-283', '2021-05-30', 'بن قليز', 'محمد', 'الحاج', '1959-12-31', 'بوقادير', 'ابتدائي', 'أولاد علي الصبحة-الشلف', 'ذكر', 'حر', '02/294/2020', '2020-04-21', '2025-04-19', 'القديم', 'B,C1,C2,D,E'),
('00221-2021-283', '2021-05-30', 'بلحسن', 'محمد', 'معمر', '1966-11-12', 'بوزغاية', 'ابتدائي', 'شارع مجاجي عبد القادر رقم 33 بوزغاية الشلف', 'ذكر', 'حر', '02/161/2021', '2021-03-15', NULL, 'القديم', 'B,C1,C2,E'),
('00222-2021-283', '2021-05-30', 'عراب', 'فتحي', 'ميلود', '1983-10-07', 'الشلف', 'متوسط', 'بقعة الأرض البيضاء الشطية الشلف', 'ذكر', 'حر', '02/2395/2020', '2020-12-15', NULL, 'القديم', 'B,C1,C2'),
('00223-2021-283', '2021-05-23', 'قوادري', 'عبد القادر', 'خليفة', '1963-10-11', 'بوقادير', 'ابتدائي', 'بقعة المطايرية بوقادير- الشلف', 'ذكر', 'متعاقد', '02/183/2019', '2019-02-11', '2024-02-10', 'القديم', 'B,C1,C2,E'),
('00224-2021-283', '2021-05-30', 'قوادري', 'أحمد', 'خليفة', '1984-11-03', 'بوقادير', 'ابتدائي', 'بقعة المطايرية بوقادير - الشلف', 'ذكر', 'متعاقد', '02/0186/2020', '2020-02-10', '2025-02-09', 'القديم', 'B,C1,C2'),
('00225-2021-283', '2021-05-30', 'قوادري', 'عبد الصمد', 'خليفة', '1980-01-26', 'بوقادير', 'ابتدائي', 'بقعة المطايرية بوقادير -الشلف', 'ذكر', 'متعاقد', '02/318/2021', '2021-03-07', '2026-03-06', 'القديم', 'B,C1,C2,E'),
('00226-2021-283', '2021-05-30', 'وعزان', 'عبد الله', 'جيلالي', '1984-11-30', 'الشطية', 'متوسط', 'بقعة الشطية الشلف', 'ذكر', 'حر', '02/0326/2021', '2021-03-24', NULL, 'القديم', 'B,C1,C2'),
('00227-2021-283', '2021-05-31', 'دردون', 'جيلالي', 'محمد', '1956-12-31', 'بوزغاية', 'ابتدائي', 'م ب 01 رقم 17 الشطية الشلف', 'ذكر', 'حر', '02/1279/2019', '2019-07-02', '2024-07-01', 'القديم', 'B,C1,C2,D,E'),
('00229-2021-283', '2021-05-31', 'مرسى', 'أحمد', 'معمر', '1966-09-30', 'تاوقريت /الشلف', 'ابتدائي', 'المعاريش 01 بلدية الهرانفة', 'ذكر', 'حر', '02/106/2019', '2019-03-21', NULL, 'القديم', 'B,C1,C2,E'),
('00230-2021-283', '2021-05-31', 'بلج نعايمة', 'عبد الحكيم', 'محمد', '1990-10-25', 'أولاد فارس', 'ابتدائي', 'حي الشرفة أولاد فارس - الشلف', 'ذكر', 'حر', 'R02183796', '2021-06-27', '2021-08-27', 'بيومتري', 'B,C1'),
('00231-2021-283', '2021-06-01', 'سلاطنة', 'محمد', 'عبد القادر', '1964-03-04', 'سنجاس/ الشلف', 'ابتدائي', 'حي سيدي جيلالي بلزرق واد سلي -الشلف', 'ذكر', 'حر', '02/1086/2019', '2019-08-15', NULL, 'القديم', 'B,C1,C2,E'),
('00235-2021-283', '2021-05-03', 'ثولال', 'هواري', 'أحمد', '1982-02-27', 'الصبحة', 'ابتدائي', 'الوخاوخة الصبحة- الشلف', 'ذكر', 'متعاقد', '02/158/2021', '2021-02-11', '2026-02-10', 'القديم', 'B,C1,C2'),
('00236-2021-283', '2021-06-03', 'ثولال', 'رشيد', 'يحي', '1988-03-15', 'الصبحة', 'ابتدائي', 'الوخاوخة الصبحة- الشلف', 'ذكر', 'متعاقد', '02/520/2017', '2017-04-13', '2022-01-25', 'القديم', 'B,C1,C2'),
('00237-2021-283', '2021-06-03', 'لزعر', 'محمد', 'ميلود', '1989-03-14', 'الصبحة', 'ابتدائي', 'الصبحة -الشلف', 'ذكر', 'حر', '00000727', '2021-01-18', '2021-10-30', 'بيومتري', 'B,C1,C,CE'),
('00238-2021-283', '2021-06-03', 'صالح', 'عبد القادر', 'مسعود', '1970-07-07', 'الشلف', 'ابتدائي', 'بقعة المعايزية أم الدروع الشلف', 'ذكر', 'متعاقد', '02/30361/15', '2015-12-08', '2020-12-07', 'القديم', 'B,C1,C2,E'),
('00239-2021-283', '2021-06-03', 'بودالي', 'علي', 'محمد', '1965-12-01', 'الزبوجة', 'ابتدائي', 'حي النصر بلدية الزبوجة الشلف', 'ذكر', 'متعاقد', '02/584/2018', '2018-08-27', '2023-08-25', 'القديم', 'B,C1,C2,E'),
('00240-2021-283', '2021-06-03', 'بوزيد', 'عبد القادر', 'محمد', '1966-05-03', 'سيدي عكاشة ', 'ابتدائي', 'م د 03 رقم 383 الشطية الشلف', 'ذكر', 'متعاقد', '02/1460/2016', '2016-05-05', '2021-05-04', 'القديم', 'B,C1,C2,D,E'),
('00241-2021-283', '2021-06-03', 'زنود', 'عبد القادر', 'أحمد', '1977-05-04', 'الكريمية', 'متوسط', 'حي علي بن هانية العطاف', 'ذكر', 'متعاقد', '4477/1225/2020', '2020-11-24', '2025-11-23', 'القديم', 'B,C1,C2'),
('00242-2021-283', '2021-06-03', 'قورين', 'محمد', 'عبد القادر', '1962-10-04', 'أم الدروع', 'ابتدائي', ' الشلفحي بوعليلي أم الدروع ', 'ذكر', 'متعاقد', '02/549/2019', '2019-10-13', '2024-09-28', 'القديم', 'B,C1,C2,D,E'),
('00243-2021-283', '2021-06-03', 'محارث', 'عبد القادر', 'محمد', '1969-10-25', 'الأزهرية', 'ابتدائي', 'قرية تمزلايت بلدية الأزهرية ولاية تيسمسيلت', 'ذكر', 'متعاقد', '070/2016', '2016-12-15', '2021-12-14', 'القديم', 'B,C1,C2,E'),
('00244-2021-283', '2021-06-03', 'نواري', 'توفيق', 'عبد الله', '1985-03-06', 'الشلف', 'ابتدائي', 'بقعة الحمايسية أم الدروع الشلف', 'ذكر', 'متعاقد', '02/250/2018', '2018-04-01', '2023-02-01', 'القديم', 'B,C1,C2,E'),
('00245-2021-283', '2021-06-03', 'هني حواص', 'صالح', 'محمد', '1980-03-29', 'سنجاس', 'ابتدائي', 'حي البدر م 03 رقم 119 الشلف', 'ذكر', 'متعاقد', '02/2553/2016', '2016-04-20', '2021-07-22', 'القديم', 'B,C1,C2'),
('00246-2021-283', '2021-06-03', 'يحيى محمد', 'بوعلام', 'جلول', '1978-10-17', 'خميس مليانة', 'ابتدائي', 'حي قرومي بلدية سيدي لخضر عين الدفلى', 'ذكر', 'متعاقد', '44/24/52/16', '2016-09-04', '2021-09-03', 'القديم', 'B,C1,C2,E'),
('00247-2021-283', '2021-06-03', 'قاسمي', 'علي', 'محمد', '1975-07-10', 'وادي الفضة', 'ابتدائي', 'بقعة الوقيات بني راشد  الشلف', 'ذكر', 'متعاقد', '02/186/2021', '2021-03-22', '2026-03-21', 'القديم', 'B,C1,C2,E'),
('00249-2021-283', '2021-06-03', 'هني حمري', 'أحمد', 'محمد', '1980-12-13', 'بسنجاس', 'متوسط', 'بقعة البساكرة أم الدروع - الشلف', 'ذكر', 'متعاقد', '02/242/2016', '2016-02-20', '2021-11-13', 'القديم', 'B,C1,C2,E'),
('00250-2021-283', '2021-06-06', 'بوشكارة', 'علي', 'عبد القادر', '1982-10-13', 'أولاد فارس / الشلف', 'متوسط', 'القطايبية أولاد فارس', 'ذكر', 'حر', '02/190/2020', '2020-02-18', NULL, 'القديم', 'B,C1,C2'),
('00251-2021-283', '2021-06-07', 'قوادري', 'فريد', 'قدور', '1988-10-10', 'الصبحة', 'متوسط', 'المطايرية بوقدير- الشلف', 'ذكر', 'متعاقد', '02/0162/2016', '2016-10-18', '2021-10-15', 'القديم', 'B,C1'),
('00253-2021-283', '2021-06-07', 'نورة', 'عبد الحليم', 'عبد القادر', '1982-08-01', 'الزبوجة / الشلف', 'ابتدائي', 'بقعة الفلاقية بنايرية - الشلف', 'ذكر', 'حر', '02/225/2020', '2020-06-11', NULL, 'القديم', 'B,C1,C2'),
('00254-2021-283', '2021-06-07', 'حمادي', 'سعيد', 'جيلالي', '1981-12-03', 'بوزغاية / الشلف', 'متوسط', 'تاجنة -أبو الحسن', 'ذكر', 'حر', '02/106/2018', '2018-02-06', NULL, 'القديم', 'B,C1,C2,D,E'),
('00255-2021-283', '2021-06-07', 'فلاق', 'عبد النور', 'محمد', '1976-05-24', 'الشلف', 'متوسط', 'م 05 رقم 509 الشطية - الشلف', 'ذكر', 'حر', '02/1744/2016', '2016-05-29', NULL, 'القديم', 'B,C1,C2,D,E'),
('00256-2021-283', '2021-06-08', 'يونسي', 'معمر', 'أحمد', '1964-12-31', 'بوزغاية ', 'ابتدائي', 'القرية الفلاحية رقم 09 بوزغاية  الشلف', 'ذكر', 'حر', '02/251/2016', '2016-12-14', NULL, 'القديم', 'B,C1,C2,E'),
('00257-2021-283', '2021-06-08', 'مقروس', 'محمد جمال الدين', 'محمد', '1990-10-28', 'الشطية', 'متوسط', 'م 02 رقم 16 الشطية -الشلف ', 'ذكر', 'حر', '00013225', '2020-12-30', NULL, 'بيومتري', 'B,D,C1'),
('00258-2021-283', '2021-06-08', 'ولاج', 'عبد القادر', 'معمر', '1977-12-31', 'بوزغاية', 'ابتدائي', 'محطة حميس رقم 48 بوزغاية الشلف', 'ذكر', 'حر', '02/552/2017', '2017-03-06', '2022-03-05', 'القديم', 'B,C1,C2,D'),
('00259-2021-283', '2021-06-09', 'لحمر', 'جمال', 'محمد', '1968-01-18', 'الصبحة', 'ابتدائي', 'حي الشهيد لوركيستي بن عتو السو عين مران', 'ذكر', 'حر', '02/732/2017', '2017-05-02', NULL, 'القديم', 'B,C1,C2,D,E'),
('00260-2021-283', '2021-06-09', 'شرانطي', 'محمد الأمين', 'محمد', '1988-08-16', 'الزبوجة', 'متوسط', 'الزبوجة مركز', 'ذكر', 'حر', 'A00798732', '2020-07-16', NULL, 'بيومتري', 'D,C1,C'),
('00261-2021-283', '2021-06-09', 'سعيدية', 'عبد القادر', 'الحاج', '1976-08-16', 'أولاد فارس / الشلف', 'ابتدائي', ' السعايدية  أولاد فارس - الشلف', 'ذكر', 'حر', '02/2576/2016', '2016-08-15', NULL, 'القديم', 'B,C1,C2'),
('00262-2021-283', '2021-06-09', 'منصور بختاش', 'أمحمد', 'صالح', '1970-05-06', 'سنجاس - الشلف', 'متوسط', ' حي النصر سنجاس -الشلف', 'ذكر', 'حر', '02/218/2020', '2020-04-21', NULL, 'القديم', 'B,C1,C2,E'),
('00263-2021-283', '2021-06-09', 'عبو', ' محمد', 'قدور', '1964-01-29', 'سنجاس / الشلف', 'ابتدائي', 'حي صالحي سنجاس - الشلف', 'ذكر', 'حر', '02/126/2016', '2016-10-24', NULL, 'القديم', 'B,C1,C2,D,E'),
('00264-2021-283', '2021-06-13', 'نقاز', 'قدور', 'جيلالي', '1961-11-12', 'تاجنة / الشلف', 'ابتدائي', 'تاجنة أبو الحسن - الشلف', 'ذكر', 'حر', '02/432/2018', '2018-05-31', NULL, 'القديم', 'B,C1,C2,E'),
('00265-2021-283', '2021-06-13', 'خواص', 'عبد القادر', 'بودربالة', '1983-01-16', 'الزبوجة / الشلف', 'متوسط', 'بقعة الفلاقية رقم 48 بنايرية - الشلف', 'ذكر', 'حر', '02/072/2020', '2020-02-10', NULL, 'القديم', 'B,C1,C2,E'),
('00266-2021-283', '2021-06-13', 'عيسى بختاش', 'الحاج', 'قدور', '1979-06-15', 'الشلف', 'متوسط', 'بقعة أولاد منصور سنجاس - الشلف', 'ذكر', 'حر', '02/744/2020', '2020-11-11', NULL, 'القديم', 'B,C1,C2,E'),
('00267-2021-283', '2021-06-14', 'طالبي', 'جيلالي', 'بن شريف', '1969-01-23', 'بوزغاية ', 'ابتدائي', 'تاجنة  أبو الحسن  الشلف', 'ذكر', 'حر', '02/137/2016', '2016-01-27', NULL, 'القديم', 'B,C1,C2,D,E'),
('00268-2021-283', '2021-06-14', 'طالبي', 'محمد', 'شريف', '1987-01-11', 'تاجنة ', 'متوسط', 'عين الصلطان  تاجنة  الشلف', 'ذكر', 'حر', '02/34/2020', '2020-01-14', NULL, 'القديم', 'B,C1,C2,D,E'),
('00269-2021-283', '2021-06-15', 'فردي', 'توفيق', 'قدور', '1980-12-31', 'أولاد فارس ', 'متوسط', 'أولاد هني أولاد فارس - الشلف', 'ذكر', 'حر', '02/282/2021', '2021-03-15', NULL, 'القديم', 'B,C1,C2'),
('00271-2021-283', '2021-06-17', 'فردي', 'عمر', 'محمد', '1994-06-20', 'الشطية', 'متوسط', 'الشطية - الشلف', 'ذكر', 'حر', 'A01161613', '2020-12-15', NULL, 'القديم', 'B,C1'),
('00272-2021-283', '2021-06-20', 'يوسف', 'محمد', 'الحاج', '1969-09-26', 'الشلف', 'ابتدائي', 'أولاد هني أولاد فارس', 'ذكر', 'حر', '02/303/2020', '2020-03-11', '2025-03-11', 'القديم', 'B,C1,C2,E'),
('00273-2021-283', '2021-06-20', 'خديم', 'معمر', 'ميلود', '1964-01-12', 'بوزغاية ', 'ابتدائي', 'حي عمار غلام رقم 29 بوزغاية  الشلف', 'ذكر', 'حر', '02/345/2020', '2020-07-19', NULL, 'القديم', 'B,C1,C2,D,E'),
('00274-2021-283', '2021-06-20', ' مداح', 'عبد القادر', 'محمد', '1968-02-14', 'أولاد فارس ', 'ابتدائي', 'أولاد فارس مركز  الشلف', 'ذكر', 'حر', '02/972/2019', '2019-10-23', NULL, 'القديم', 'B,C1,C2,D,E'),
('00275-2021-283', '2021-06-20', 'طويل', 'أحمد', 'محمد', '1987-10-28', 'أولاد فارس', 'ابتدائي', 'أولاد بوزيان -اولاد فارس', 'ذكر', 'حر', '02/593/2020', '2020-07-07', '2025-07-05', 'القديم', 'B,C1,E'),
('00276-2021-283', '2021-06-20', 'طاهر', 'مراد', 'محمد', '1985-05-06', 'الشطية', 'متوسط', 'م 11 رقم 281 الشطية - الشلف', 'ذكر', 'حر', '02/2436/2016', '2016-07-28', NULL, 'القديم', 'B,C1'),
('00277-2021-283', '2021-06-20', 'بوغرارة', 'محفوظ', 'عبد القادر', '1985-02-13', 'تنس ', 'متوسط', 'حي الشهداء رقم 29 بوزغاية الشلف', 'ذكر', 'حر', '02/575/2018', '2018-09-12', NULL, 'القديم', 'B,C1,E'),
('00278-2021-283', '2021-06-20', 'يونسي', 'علي', 'عبد القادر', '1982-07-11', 'الشلف', 'متوسط', 'م 04 رقم 174 الشطية - الشلف', 'ذكر', 'حر', '02/1334/2020', '2020-07-19', NULL, 'القديم', 'B,C1,C2'),
('00279-2021-283', '2021-06-21', 'يحياوي', 'عبد القادر', 'محمد', '1970-04-29', 'سنجاس', 'ابتدائي', 'بقعة الشرفة القديمة الشلف', 'ذكر', 'حر', '02/2993/2018', '2018-05-02', NULL, 'القديم', 'B,C1,C2'),
('00280-2021-283', '2021-06-21', 'جلول', 'محمد', 'أمحمد', '1980-03-02', 'أولاد فارس', 'متوسط', 'الشرفة أولاد فارس ', 'ذكر', 'حر', '02/913/2020', '2020-09-17', NULL, 'القديم', 'B,C1,C2'),
('00281-2021-283', '2021-06-22', 'حمزاوي', 'أحمد', 'عبد القادر', '1973-12-04', 'الشلف', 'متوسط', 'رقم 02  الشطية الشلف  A01 المدينة الجديدة عمارة  ', 'ذكر', 'حر', '02/978/2020', '2020-06-02', NULL, 'القديم', 'B,C1,C2'),
('00282-2021-283', '2021-06-24', 'ماجي', 'معمر', 'محمد', '1977-09-02', 'تلعصة', 'متوسط', 'حي بن باديس تلعصة الشلف', 'ذكر', 'حر', '02/249/2020', '2020-11-09', NULL, 'القديم', 'B,C1,C2,D,E'),
('00283-2021-283', '2021-06-24', 'هيدور', 'جيلالي', 'محمد', '1957-12-31', 'أولاد فارس', 'ابتدائي', 'الشرايط حي الشقة رقم 166 الشلف', 'ذكر', 'حر', 'A01475565', '2021-03-24', NULL, 'بيومتري', 'B,D,C1,C'),
('00284-2021-283', '2021-06-27', 'قادري', 'عبد القادر', 'أحمد', '1974-02-11', 'الشلف', 'ابتدائي', 'بقعة الحباير الشطية -الشلف', 'ذكر', 'متعاقد', '02/0235/2018', '2018-01-18', '2023-01-17', 'القديم', 'B,C1,C2,D,E'),
('00285-2021-283', '2021-06-27', 'عروسي', 'هني', 'الحاج', '1963-02-14', 'بوزغاية/ الشلف', 'ابتدائي', 'المدينة الجديدة الشطية الشلف', 'ذكر', 'متعاقد', '02/263/2019', '2019-02-06', '2021-08-12', 'القديم', 'B,C1,C2,E'),
('00287-2021-283', '2021-06-28', 'مخطاري الثعالبي', 'مخطار', 'محمد', '1988-11-19', ' أولاد فارس', 'متوسط', 'حي النشاطات أولاد فارس - الشلف', 'ذكر', 'متعاقد', '02/193/2020', '2020-02-18', '2025-02-17', 'القديم', 'B,C1,D'),
('00289-2021-283', '2021-06-30', 'يخلف', 'هشام', 'أحمد', '1993-01-10', 'تاجنة', 'متوسط', 'تاجنة مركز -الشلف', 'ذكر', 'حر', 'A01108365', '2020-11-24', '2030-11-23', 'بيومتري', 'B,C'),
('00290-2021-283', '2021-06-30', 'طاري', 'محمد', 'العربي', '1953-02-01', 'أولاد فارس/ الشلف', 'ابتدائي', 'القطايبية أولاد فارس -الشلف', 'ذكر', 'حر', '02/048/2018', '2018-01-08', '2023-01-08', 'القديم', 'B,C1,C2,E'),
('00292-2021-283', '2021-07-03', 'بلجوهري', 'محمد', 'بن عودة', '1976-01-15', 'الشلف', 'ابتدائي', 'بقعة الحباير الشطية - الشلف', 'ذكر', 'متعاقد', '02/1513/2018', '2018-06-10', '2023-06-09', 'القديم', 'B,C1,C2'),
('00294-2021-283', '2021-07-04', 'دغرار', 'معمر', 'بلقاسم', '1974-08-27', 'بوزغاية', 'ثانوي', 'بقعة اللوالية رقم 41 بوزغاية الشلف', 'ذكر', 'حر', '02/114/2020', '2020-02-16', NULL, 'القديم', 'B,C1,C2,E'),
('00295-2021-283', '2021-07-04', 'لزعر', 'سمير', 'محمد', '1995-09-28', 'بالشلف', 'متوسط', 'الصبحة الشلف', 'ذكر', 'حر', 'A01509587', '2021-04-05', '2031-04-04', 'بيومتري', 'B,C,BE,CE'),
('00296-2021-283', '2021-07-04', 'شنافة', 'محمد', 'عبد القادر', '1980-05-23', 'تاجنة / الشلف', 'متوسط', 'أولاد سيدي الشريف أولاد فارس', 'ذكر', 'حر', '02/1671/2017', '2017-12-21', NULL, 'القديم', 'B,C1,C2'),
('00297-2021-283', '2021-07-04', 'طالبي', 'محمد', 'عبد القادر', '1989-08-10', 'تاجنة/ الشلف', 'متوسط', 'تاجنة - أبو الحسن', 'ذكر', 'حر', '02/808/2016', '2016-06-02', NULL, 'القديم', 'B,C1,C2'),
('00298-2021-283', '2021-07-05', 'يخلف', 'زيان', 'عبد القادر', '1973-01-07', 'بوزغاية/ الشلف', 'متوسط', 'تاجنة - أبو الحسن', 'ذكر', 'حر', '02/961/2018', '2018-12-30', NULL, 'القديم', 'B,C1,C2,D,E'),
('00299-2021-283', '2021-07-06', 'بسباس', 'سحنون', 'عبد القادر', '1973-09-07', 'وادي الفضة', 'ابتدائي', 'حي الشقة الشرايط الشلف', 'ذكر', 'حر', '02/4260/2017', '2017-06-27', '2022-06-06', 'القديم', 'B,C1,C2,D,E'),
('00300-2021-283', '2021-07-06', 'دومة بوطيبة', 'محمد', 'أحمد', '1987-11-07', 'الشطية ', 'ابتدائي', 'حي مخطاري طريق  الرملية الشطية ', 'ذكر', 'حر', 'A010567276', '2020-11-04', '2030-11-03', 'بيومتري', 'B,C1,C'),
('00301-2021-283', '2021-07-06', 'لزعر', 'حسام', 'عبد القادر', '1988-12-19', 'الصبحة / الشلف', 'متوسط', 'حي بن زرقة شايب الدور الصبجة - الشلف', 'ذكر', 'حر', '02/763/2018', '2018-06-17', NULL, 'القديم', 'B,C1'),
('00302-2021-283', '2021-07-07', 'ثولال', 'رضوان', 'محمد', '1962-08-14', 'الصبحة/ الشلف', 'ابتدائي', 'الوخاوخة الصبحة - الشلف', 'ذكر', 'حر', '02/692/2020', '2020-08-16', NULL, 'القديم', 'B,C1,C2,E'),
('00303-2021-283', '2021-07-07', 'بوخاتم', 'سامر', 'محمد', '1990-07-09', 'عين مران / الشلف', 'متوسط', 'حي الشهيد بن أحمد مباركي عبد القادر عين مران / الشلف', 'ذكر', 'حر', '02/75/2017', '2017-01-11', NULL, 'القديم', 'A1,B,C1,C2,E'),
('00304-2021-283', '2021-07-07', 'مقبل', 'حاج', 'محمد', '1973-02-18', 'الهرانفة / الشلف', 'متوسط', 'حي سوق الفلاح الهرانفة - الشلف', 'ذكر', 'حر', '02/29/2016', '2016-10-17', NULL, 'القديم', 'B,C1,C2'),
('00306-2021-283', '2021-07-08', 'بصيري', 'هشام', 'محمد', '1988-03-15', 'بوزغاية', 'متوسط', 'بوزغاية - الشلف', 'ذكر', 'حر', 'A00301633', '2019-10-19', NULL, 'بيومتري', 'B,C,BE,CE'),
('00307-2021-283', '2021-07-11', 'حميدي بوجلطية', 'عبد الجليل', 'بودالي', '1992-09-29', 'الشطية', 'متوسط', 'منطقة أ 01رقم 100 الشطية - الشلف', 'ذكر', 'حر', '02/2236/2017', '2017-08-30', NULL, 'القديم', 'B'),
('00308-2021-283', '2021-07-11', 'نورة', 'ميلود', 'معمر', '1969-09-03', 'الزبوجة', 'ابتدائي', 'بقعة الفلاقية رقم 13 بنايرية- الشلف', 'ذكر', 'حر', '02/043/2020', '2020-01-26', '2025-01-25', 'القديم', 'B,C1,C2,E'),
('00309-2021-283', '2021-07-11', 'زنتر', 'عبد القادر', 'محمد', '1979-02-05', 'تنس / الشلف', 'متوسط', 'م02 رقم245 الشطية - الشلف', 'ذكر', 'حر', '02/0254/2021', '2021-03-15', NULL, 'القديم', 'B,C1,C2,D'),
('00310-2021-283', '2021-07-11', 'العربي  رزيق', 'حاج', 'محمد', '1981-01-27', 'عين مران / الشلف', 'متوسط', 'حي الشهيد زيان معمر محمد السهايلية عين مران - الشلف', 'ذكر', 'حر', '02/266/2019', '2019-02-26', NULL, 'القديم', 'B,C1,C2,E'),
('00311-2021-283', '2021-07-11', 'بلعلة', 'توفيق', 'محمد', '1988-05-20', 'تاجنة', 'متوسط', 'تاجنة - الشلف', 'ذكر', 'حر', 'A00696338', '2020-05-06', NULL, 'بيومتري', 'B,C1,C'),
('00312-2021-283', '2021-07-13', 'بنو شاعة', 'أحمد', 'محمد', '1985-01-25', 'تنش/ الشلف', 'متوسط', 'حي أولاد العربي - تنس', 'ذكر', 'حر', '02/106/2018', '2018-01-24', NULL, 'القديم', 'B,C1,C2'),
('00313-2021-283', '2021-07-13', 'حيدور', 'أحمد', 'محمد', '1973-07-17', 'الأبيض مجاجة / الشلف', 'متوسط', 'حي الشرايط الشقة - الشلف', 'ذكر', 'حر', '02/8003/2017', '2017-10-15', NULL, 'القديم', 'B,C1,C2,D'),
('00314-2021-283', '2021-08-15', 'البواعلي', 'كمال', 'بن حورة', '1977-06-11', 'الشلف', 'متوسط', 'المنطقة 12 رقم 451 الشطية -الشلف', 'ذكر', 'حر', '02/1913/2016', '2016-06-08', NULL, 'القديم', 'B,C1,C2'),
('00315-2021-283', '2021-07-15', 'نقار', 'العيد', 'عبد القادر', '1962-03-08', 'أم الدروع', 'ابتدائي', 'بقعة القلافطية أم الدروع الشلف', 'ذكر', 'متعاقد', '02/030/2021', '2021-01-31', '2026-01-30', 'القديم', 'B,C1,C2,D,E'),
('00316-2021-283', '2021-07-15', 'مجبر', 'أحمد', 'أمحمد', '1964-01-23', 'الشلف', 'ابتدائي', 'م د 03 طريق الحباير رقم 37 الشطية الشلف', 'ذكر', 'متعاقد', '02/0320/2018', '2018-01-23', '2023-01-22', 'القديم', 'B,C1,C2,E'),
('00317-2021-283', '2021-07-15', 'نعاس', 'أحمد', 'محمد', '1951-06-20', 'الشلف', 'ابتدائي', 'م س 08 رقم 368 الشطية الشلف', 'ذكر', 'متعاقد', '02/489/2017', '2017-02-27', '2022-02-26', 'القديم', 'B,C1,C2,D,E'),
('00318-2021-283', '2021-07-18', 'بقارة', 'الحاج', 'أحمد', '1978-02-07', 'سيدي عكاشة / الشلف', 'متوسط', 'دوار السوالمية سيدي عكاشة - الشلف', 'ذكر', 'حر', '02/87/2021', '2021-01-28', NULL, 'القديم', 'B,C1,C2,E'),
('00319-2021-283', '2021-07-18', 'معمري', 'خليفة', 'محمد', '1985-06-18', 'الشطية', 'متوسط', 'م 02 الشطية - الشلف', 'ذكر', 'حر', 'A00403990', '2019-12-11', NULL, 'القديم', 'B,C1'),
('00320-2021-283', '2021-07-18', 'بن ناصر', 'يوسف', 'محمد', '1964-03-23', 'عين مران / الشلف', 'ابتدائي', 'حي الشهيد بلومي بوشعيب عين مران - الشلف', 'ذكر', 'حر', '02/153/2020', '2020-02-03', NULL, 'القديم', 'B,C1,C2,E'),
('00321-2021-283', '2021-07-18', 'طهاري', 'عبد القادر', 'محمد', '1964-06-04', 'الشلف', 'ابتدائي', 'بقعة الأرض البيضاء الشطية - الشلف', 'ذكر', 'حر', '02/1033/2020', '2020-06-14', NULL, 'القديم', 'B,C1,C2,E'),
('00322-2021-283', '2021-07-19', 'عريوي', 'خالد', 'محمد', '1984-01-08', 'الشلف', 'متوسط', 'حي النصر م 08 رقم 99 ', 'ذكر', 'حر', 'A01561865', '2021-04-26', NULL, 'بيومتري', 'B,C1,C'),
('00323-2021-283', '2021-07-22', 'سعدي', 'عبد الرحمان', 'عبد القادر', '1963-04-12', 'الشلف', 'ابتدائي', 'حي الشقة رقم 72 الشلف', 'ذكر', 'حر', 'A01056254', '2020-11-04', '2030-11-03', 'بيومتري', 'B,C1,C,BE,C1E,CE'),
('00324-2021-283', '2021-07-22', 'مخطاري', 'اسماعيل', 'مخطار', '1982-02-07', 'أولاد فارس', 'ابتدائي', 'م 05 رقم 321 الشطية الشلف', 'ذكر', 'حر', '02/1883/2020', '2020-09-29', '2025-09-28', 'القديم', 'B,C1,C2'),
('00325-2021-283', '2021-07-24', 'قويدري', 'علي', 'بلقاسم', '1984-07-11', 'الشطية', 'متوسط', 'حي الأولمبي رقم 87 الشلف', 'ذكر', 'حر', '02/4563/2017', '2017-07-04', '2022-07-03', 'القديم', 'B,C1,C2'),
('00326-2021-283', '2021-07-24', 'عابد', 'أمحمد', 'عابد', '1977-08-27', 'سنجاس', 'ابتدائي', 'سنجاس الشلف', 'ذكر', 'حر', '517', '2021-07-18', NULL, 'بيومتري', 'B,D,C1,C,BE,C1E,CE,DE'),
('00328-2021-283', '2021-07-25', 'فلاق شبرة', 'مولود', 'حاج', '1985-11-25', 'الأبيض مجاجة /الشلف', 'متوسط', 'أولاد بن شبرة الأبيض مجاجة - الشلف', 'ذكر', 'حر', '02/470/2019', '2019-12-23', '2024-12-23', 'القديم', 'B,C1'),
('00329-2021-283', '2021-07-25', 'بناط', 'خليفة', 'العربي', '1980-04-08', 'أبو الحسن / الشلف', 'متوسط', 'حي المعلمين / أبو الحسن الشلف', 'ذكر', 'حر', '02/159/2018', '2018-03-07', '2023-04-07', 'القديم', 'B,C1,C2'),
('00330-2021-283', '2021-07-25', 'بن صالح', 'محمد', 'قابشي', '1976-04-06', 'الشلف', 'متوسط', 'بقعة الرملية الشطية - الشلف', 'ذكر', 'حر', '02/8910/2016', '2016-04-07', '2021-08-05', 'القديم', 'B,C1,C2,E'),
('00331-2021-283', '2021-07-25', 'يخلف', 'حسان', 'معمر', '1985-06-30', 'بوقادير', 'متوسط', 'أولاد جيلالي الصبحة - الشلف', 'ذكر', 'حر', '02/727/2019', '2019-06-24', '2024-06-22', 'القديم', 'B,C1,C2'),
('00332-2021-283', '2021-07-27', 'عميش', 'محمد', 'معمر', '1966-10-01', 'تاوقريت', 'ابتدائي', 'حي الشهيد سامر العربي بلدية تاوقريت الشلف', 'ذكر', 'حر', '02/0463/2020', '2020-08-25', '2025-08-24', 'القديم', 'B,C1,C2,D,E'),
('00333-2021-283', '2021-07-27', 'بويكني', 'جيلالي', 'عبد القادر', '1964-10-14', 'بوزغاية / الشلف', 'ابتدائي', 'حي عمار غلام رقم 81 بوزغاية - الشلف', 'ذكر', 'حر', '02/1204/2017', '2017-11-08', '2022-11-07', 'القديم', 'B,C1,C2,E'),
('00334-2021-283', '2021-07-27', 'مغربي', 'أبوبكر', 'محمد', '1984-03-28', 'الشلف', 'متوسط', 'حي مداحي رقم 03 الشلف', 'ذكر', 'حر', '02/5283/2016', '2016-09-05', '2021-09-04', 'القديم', 'B,C1,C2,E'),
('00335-2021-283', '2021-07-27', 'بوكرشاوي', 'محمد', 'أحمد', '1984-11-13', 'الشلف', 'متوسط', 'تاجنة أبو الحسن - الشلف', 'ذكر', 'حر', '02/219/2016', '2016-12-14', '2021-11-12', 'القديم', 'B,C1,C2,D'),
('00336-2021-283', '2021-07-28', 'فرحات خوجة', 'علي', 'محمد', '1980-05-06', 'أولاد فارس', 'ابتدائي', 'حوش الغابة - أولاد فارس -الشلف', 'ذكر', 'حر', '00005591', '2021-04-20', '2021-10-20', 'بيومتري', 'B,C1,DE'),
('00337-2021-283', '2021-07-28', 'زعنون', 'جمال', 'معمر', '1981-09-22', 'بوزغاية/ الشلف', 'متوسط', 'بوزغاية مركز رقم 54 الشلف', 'ذكر', 'حر', '02/035/2021', '2021-01-19', '2026-01-18', 'القديم', 'B,C1,C2'),
('00338-2021-283', '2021-07-28', 'بن سعيد', 'أمحمد', 'خليفة', '1962-09-21', 'الصبحة / الشلف', 'ابتدائي', 'أولاد الجيلالي الصبحة - الشلف', 'ذكر', 'حر', '02/1424/2017', '2017-10-24', '2022-10-23', 'القديم', 'B,C1,C2,D,E'),
('00339-2021-283', '2021-07-29', 'عابد قاسمي', 'واضح', 'عبد القادر', '1978-10-30', 'الهرانفة / الشلف', 'ابتدائي', 'أولاد سيدي الشريف أولاد فارس', 'ذكر', 'حر', '02/431/2020', '2020-05-26', '2025-05-16', 'القديم', 'B,C1'),
('00341-2021-283', '2021-07-29', 'روابح', 'الحاج', 'محمد', '1982-01-22', 'أولاد فارس', 'متوسط', 'القطايبية أولاد فارس', 'ذكر', 'متعاقد', 'R02150189', '2021-06-16', '2021-10-16', 'بيومتري', 'B,C,BE,C1E,CE'),
('00342-2021-283', '2021-07-29', 'كرفي قطيب', 'حمزة', 'محمد', '1985-05-09', 'أولاد فارس', 'ابتدائي', 'القطايبية - أولاد فارس', 'ذكر', 'متعاقد', '02/1559/2016', '2021-05-10', '2021-10-10', 'القديم', 'B,C1,C2'),
('00343-2021-283', '2021-07-29', 'لعشب', 'سليمان', 'محمد', '1980-07-11', 'الأرجم  تيسمسيلت', 'متوسط', 'بقعة الأرض البيضاء الشطية  الشلف', 'ذكر', 'متعاقد', '02/1073/2020', '2020-06-16', '2025-06-15', 'القديم', 'B,C1,E'),
('00344-2021-283', '2021-07-31', 'سنجاسني', 'علي', 'خليفة', '1980-09-18', 'أولاد فارس ', 'ابتدائي', 'القطايبية أولاد فارس الشلف', 'ذكر', 'حر', '02/686/2018', '2018-06-03', '2023-03-24', 'القديم', 'B,C1,C2'),
('00345-2021-283', '2021-07-31', 'دحمان بواعلي', 'لخضر', 'جيلالي', '1978-08-18', 'أولاد فارس', 'ابتدائي', 'حي الهادي معمر أولاد فارس الشلف', 'ذكر', 'حر', '02/617/2018', '2018-05-20', '2023-05-20', 'القديم', 'B,C1,C2,E'),
('00346-2021-283', '2021-08-01', 'بن هني', 'براهيم', 'محمد', '1981-06-22', 'الزبوجة', 'ابتدائي', 'الزبوجة واد حمليل - الشلف', 'ذكر', 'حر', 'A00857284', '2020-08-28', '2030-08-27', 'القديم', 'B,C1'),
('00347-2021-283', '2021-08-01', 'قويدر الواحد', 'ربيع', 'محمد', '1976-08-15', 'الشلف', 'متوسط', 'م 09 رقم 297 الشطية الشلف', 'ذكر', 'حر', '02/257/2016', '2016-08-15', NULL, 'القديم', 'B,C1,C2'),
('00348-2021-283', '2021-08-02', 'سوداني', 'علي', 'عبد القادر', '1980-02-11', 'تاجنة', 'ابتدائي', 'تاجنة أبو الحسن', 'ذكر', 'متعاقد', '02/48/2019', '2019-01-20', '2024-02-10', 'القديم', 'B,C1,C2,D,E'),
('00349-2021-283', '2021-08-02', 'سنجاسني', 'توفيق', 'عبد القادر', '1983-12-30', 'أولاد فارس', 'متوسط', 'القطايبية أولاد فارس - الشلف', 'ذكر', 'حر', '02/187/2017', '2017-02-06', '2022-01-04', 'القديم', 'B,C1,C2,E'),
('00350-2021-283', '2021-08-04', 'زروقي', 'علي', 'أحمد', '1986-05-14', 'الشلف', 'متوسط', 'حي 109 مخطاري طريق الرملية الشلف ', 'ذكر', 'حر', '02/5736/2017', '2017-07-27', '2022-07-26', 'القديم', 'B,C1,D,E'),
('00351-2021-283', '2021-08-04', 'بوزيدي', 'عبد النور', 'السايح', '1980-09-12', 'الشلف', 'ثانوي', 'مقابل منطقة  10 طريق تنس الشطية الشلف', 'ذكر', 'حر', 'A00716625', '2020-06-04', '2030-06-03', 'بيومتري', 'B,C1'),
('00352-2021-283', '2021-08-04', 'رزيم', 'أحمد', 'محمد', '1980-04-15', 'الشلف', 'متوسط', 'م د 03 رقم 198 الشطية الشلف', 'ذكر', 'حر', '02/2083/2020', '2020-10-27', '2025-10-26', 'القديم', 'B,C1,C2,D'),
('00353-2021-283', '2021-08-04', 'كتروسي', 'إبراهيم', 'محمد', '1993-06-18', 'الصبحة ', 'متوسط', 'البواشرية بوقادير الشلف', 'ذكر', 'متعاقد', '02/0551/2016', '2016-12-28', '2024-12-28', 'القديم', 'B,C1'),
('00354-2021-283', '2021-08-07', 'العايدي', 'العربي', 'محمد', '1977-05-29', 'الشلف', 'ابتدائي', 'بقعة الشطية الشلف', 'ذكر', 'حر', '02/2114/2020', '2020-11-02', '2025-11-01', 'القديم', 'B,C1,D'),
('00357-2021-283', '2021-08-08', 'صفصاف', 'رشيد', 'ميلود', '1975-06-22', 'الشلف', 'ابتدائي', 'بقعة الشطية - الشلف', 'ذكر', 'حر', '02/720/2017', '2017-03-15', '2022-01-02', 'القديم', 'B,C1'),
('00358-2021-283', '2021-08-08', 'جيلالي عياد', 'جيلالي', 'ميلود', '1995-10-22', 'أولاد فارس', 'متوسط', 'القطايبية أولاد فارس - الشلف', 'ذكر', 'حر', 'A01665097', '2021-06-06', '2031-06-05', 'بيومتري', 'B,C,BE,CE'),
('00359-2021-283', '2021-08-10', 'مرابط', 'عابد', 'محمد', '1967-06-04', 'سنجاس', 'متوسط', 'حي السلام بن حليمة رقم 23 - الشلف', 'ذكر', 'حر', 'A00826393', '2020-08-18', '2030-08-17', 'بيومتري', 'B,C1,C,BE,C1E,CE'),
('00360-2021-283', '2021-08-10', 'تلمساني', 'معمر', 'عبد القادر', '1990-09-21', 'تاجنة - الشلف', 'متوسط', 'زرقة تاجنة - الشلف', 'ذكر', 'حر', '02/881/2018', '2018-11-26', '2023-09-26', 'القديم', 'B,C1'),
('00362-2021-283', '2021-08-11', 'غوباي', 'معمر', 'محمد', '1971-12-31', 'تاجنة', 'متوسط', 'تاجنة أبو الحسن - الشلف', 'ذكر', 'حر', '02/134/2020', '2020-02-19', '2025-02-02', 'القديم', 'B,C1'),
('00363-2021-283', '2021-08-11', 'سايب عزوهم', 'محمد', 'عبد القادر', '1988-01-20', 'الزبوجة', 'متوسط', 'الزبوجة مركز - الشلف', 'ذكر', 'حر', '02/407/2016', '2016-02-29', '2026-02-28', 'القديم', 'B,C2'),
('00364-2021-283', '2021-08-12', 'لعافر', 'شريف', 'عيسى', '1976-04-29', 'تاوقريت', 'ابتدائي', 'حي الملعب تاوقريت الشلف', 'ذكر', 'حر', '02/0210/2018', '2018-03-13', '2023-03-12', 'القديم', 'B,C1,C2,D'),
('00365-2021-283', '2021-08-12', 'خلادي', 'يحي', 'بوعبد الله', '1985-02-09', 'الشطية', 'ابتدائي', 'بقعة سيدي عبد القادر الشطية الشلف', 'ذكر', 'حر', '02/289/2020', '2020-02-06', '2030-02-05', 'القديم', 'B,C1'),
('00366-2021-283', '2021-08-12', 'سهيل', 'محمد', 'بوبكر', '1993-06-30', 'مازونة', 'جامعي', 'السهايلية عين مران - الشلف', 'ذكر', 'حر', 'A00713077', '2020-06-01', '2030-05-31', 'بيومتري', 'B,C1,C1E'),
('00368-2021-283', '2021-08-15', 'دحامني', 'برياحي', 'صالح', '1970-04-23', 'الشلف', 'ابتدائي', ' الشلف بقعة العزايز', 'ذكر', 'حر', '02/3139/2016', '2016-05-05', NULL, 'القديم', 'B,C1,C2,E'),
('00369-2021-283', '2021-08-16', 'فراجي', 'محمد', 'عبد القادر', '1966-02-13', 'الشلف', 'ابتدائي', 'بقعة القطايبية  أولاد فارس - الشلف', 'ذكر', 'متعاقد', '02/434/2020', '2020-05-27', NULL, 'القديم', 'B,C1'),
('00370-2021-283', '2021-08-16', 'زياني', 'أحمد', 'محمد', '1980-02-23', 'الشلف', 'متوسط', 'بقعة الرملية الشطية الشلف', 'ذكر', 'حر', '555', '2021-03-15', NULL, 'القديم', 'B,C1'),
('00371-2021-283', '2021-08-16', 'حمادي', 'محمد', 'ميسوم', '1978-12-31', 'بوقادير/ الشلف', 'ابتدائي', 'أولاد علي الصبحة - الشلف', 'ذكر', 'حر', '02/089/2021', '2021-01-24', NULL, 'القديم', 'B,C1,C2,E'),
('00372-2021-283', '2021-08-16', 'بوطبل', 'محمد', 'عبد القادر', '1995-07-07', 'أ. بن عبد القادر', 'متوسط', ' حي العقيد عميروش أيت حمودة أ . بن عبد القادر', 'ذكر', 'حر', '00007804', '2021-07-29', NULL, 'القديم', 'B,C1'),
('00373-2021-283', '2021-08-17', 'مخلوف', 'معمر', 'علي', '1973-03-30', 'بوزغاية', 'ابتدائي', 'بقعة الطرايش رقم 36 بوزغاية الشلف', 'ذكر', 'حر', '02/401/2020', '2020-08-06', NULL, 'القديم', 'B,C1,C2,E'),
('00374-2021-283', '2021-08-17', 'تيزمور', 'ميلود', 'لعربي', '1963-01-26', 'المصدق', 'بدون مستوى', 'حي الشهيد بارودي حسين المصدق الشلف', 'ذكر', 'حر', '02/169/2018', '2018-11-25', NULL, 'القديم', 'B,C1,C2,D,E'),
('00375-2021-283', '2021-08-17', 'مسعد قوشيش', 'أحمد', 'جلول', '1965-12-31', 'أولاد فارس', 'ابتدائي', 'أولاد براهيم أولاد فارس الشلف', 'ذكر', 'حر', '02/393/2020', '2020-05-05', NULL, 'القديم', 'B,C1,C2,D'),
('00376-2021-283', '2021-08-17', 'فوقة', 'محمد', 'جيلالي', '1987-04-06', 'تاجنة', 'متوسط', 'تاجنة  زرقة / الشلف', 'ذكر', 'حر', 'A01223174', '2021-01-03', NULL, 'بيومتري', 'B,C1'),
('00377-2021-283', '2021-08-22', 'خدية', 'حاج', 'بن علي', '1974-07-02', 'أولاد فارس', 'ثانوي', 'أولاد حمدان أولاد فارس الشلف', 'ذكر', 'حر', '02/2325/2016', '2016-07-19', NULL, 'القديم', 'B,C1,C2'),
('00378-2021-283', '2021-08-22', 'سنجاسني', 'سامر', 'عبد القادر', '1985-09-06', 'الشطية', 'ابتدائي', 'القطايبية أولاد فارس الشلف', 'ذكر', 'حر', '02/798/2018', '2018-07-02', NULL, 'القديم', 'B,C1,C2,D'),
('00379-2021-283', '2021-08-22', 'رحمان بواعلي', 'معمر', 'محمد', '1972-12-12', 'الشلف', 'ثانوي', 'أولاد هني أولاد فارس الشلف', 'ذكر', 'حر', '02/882/2018', '2018-07-23', NULL, 'القديم', 'B,C1,C2,E'),
('00380-2021-283', '2021-08-22', 'يخلف', 'كمال', 'معمر', '1988-11-03', 'الصبحة', 'متوسط', 'أولاد الجيلالي الصبحة الشلف', 'ذكر', 'متعاقد', '02/050/2018', '2018-01-11', NULL, 'القديم', 'B,C1,C2'),
('00381-2021-283', '2021-08-24', 'بن عمر يوسف', 'ميلود', 'محمد', '1961-10-15', 'أولاد فارس', 'ابتدائي', 'أولاد الجيلالي الصبحة الشلف', 'ذكر', 'حر', '02/1137/2020', '2020-11-16', NULL, 'القديم', 'B,C1,C2,E'),
('00382-2021-283', '2021-08-24', 'غلام', 'حمزة', 'محمد', '1994-01-09', 'الشطية', 'متوسط', 'أولاد هني أولاد فارس', 'ذكر', 'حر', 'A00123217', '2019-07-25', NULL, 'بيومتري', 'B,C'),
('00383-2021-283', '2021-08-25', 'بوطيبة', 'محمد', 'عبد القادر', '1969-03-16', 'بوزغاية', 'ابتدائي', 'سيدي عيسى تاجنة الشلف', 'ذكر', 'حر', '02/186/2020', '2020-03-16', NULL, 'القديم', 'B,C1,C2,E'),
('00384-2021-283', '2021-08-25', 'صبيحي', 'عبد الله', 'أحمد', '1977-03-08', 'سنجاس', 'ثانوي', 'م س 08 رقم 12 الشطية الشلف', 'ذكر', 'حر', '02/714/2017', '2017-03-15', NULL, 'القديم', 'B,C1,C2,E'),
('00385-2021-283', '2021-08-25', 'بوسعيد', 'جيلالي', 'محمد', '1969-07-21', 'الشلف', 'ابتدائي', 'م 02 رقم 308 الشطية الشلف', 'ذكر', 'حر', '02/1459/2019', '2019-07-29', NULL, 'القديم', 'B,C1,C2,D,E'),
('00386-2021-283', '2021-08-26', 'بن عمارة', 'محمد', 'أحمد', '1966-02-01', 'أولاد فارس', 'ابتدائي', 'العيايدة أولاد فارس الشلف', 'ذكر', 'حر', '02/2027/2017', '2017-08-13', NULL, 'القديم', 'B,C1,C2,E'),
('00387-2021-283', '2021-08-28', 'زناقي', 'مصطفى', 'الحاج', '1987-07-28', 'الشطية ', 'ثانوي', 'م د 03 رقم 04 الشطية الشلف', 'ذكر', 'متعاقد', '02/2254/2020', '2020-11-19', NULL, 'القديم', 'B,C1,C2,E'),
('00388-2021-283', '2021-08-29', 'حمادي', 'عيسى', 'أحمد', '1975-07-01', 'تاجنة', 'ابتدائي', 'تاجنة أبو الحسن الشلف', 'ذكر', 'حر', '2021/04', '2021-07-01', NULL, 'بيومتري', 'B,C1,C'),
('00389-2021-283', '2021-08-29', 'حمادي', 'محمد', 'جيلالي', '1974-12-31', 'بوزغاية', 'ثانوي', 'تاجنة أبو الحسن الشلف', 'ذكر', 'حر', '02/663/2019', '2019-11-21', NULL, 'القديم', 'B,C1,C2,E'),
('00390-2021-283', '2021-08-29', 'خديم', 'محمد', 'جلول', '1982-12-14', 'الشلف', 'متوسط', 'حي النشاطات الشطية الشلف', 'ذكر', 'حر', '02/1176/2018', '2018-05-09', NULL, 'القديم', 'B,C1,C2'),
('00391-2021-283', '2021-08-29', 'قايسي', 'معمر', 'جيلالي', '1966-01-27', 'الشلف', 'بدون مستوى', 'حي الهضبة الزبوجة الشلف', 'ذكر', 'حر', '02/066/2021', '2021-01-26', NULL, 'القديم', 'B,C1,C2,E'),
('00392-2021-283', '2021-08-29', 'دريزة', 'عبد الرحمن', 'عيسى', '1993-01-01', 'تاجنة', 'متوسط', 'بقعة الشطية الشلف', 'ذكر', 'حر', '02/2947/2018', '2018-12-17', NULL, 'القديم', 'B,C1'),
('00393-2021-283', '2021-08-30', 'مناد', 'العيد', 'الميلود', '1969-02-08', 'أولاد فارس', 'ابتدائي', 'حي النشاطات الشطية الشلف', 'ذكر', 'حر', '02/372/2019', '2019-02-17', NULL, 'القديم', 'B,C1,C2'),
('00394-2021-283', '2021-08-30', 'خواص', 'محمد', 'بودربالة', '1977-11-11', 'الزبوجة', 'ابتدائي', 'بقعة الفلاقية رقم 50 بنايرية الشلف', 'ذكر', 'حر', '02/092/2020', '2020-02-19', NULL, 'القديم', 'B,C1,C2'),
('00395-2021-283', '2021-08-31', 'مسوس', 'جيلالي', 'أحمد', '1969-11-19', 'الشلف', 'متوسط', 'منطقة النشاطات الجزء الاول الشطية الشلف', 'ذكر', 'حر', '02/454/2016', '2016-02-09', NULL, 'القديم', 'B,C1,C2,E'),
('00396-2021-283', '2021-09-01', 'خدية', 'محمد', 'بنعلي', '1976-02-16', 'أولاد فارس', 'متوسط', 'أولاد حمدان أولاد فارس الشلف', 'ذكر', 'حر', '02/088/2020', '2020-01-26', NULL, 'القديم', 'B,C1,C2'),
('00397-2021-283', '2021-09-01', 'بجة', 'أعمر', 'أحمد', '2018-09-25', 'برج بونعامة', 'ابتدائي', 'م د 03 رقم 144 الشطية الشلف', 'ذكر', 'حر', '02/2319/2018', '2018-09-25', NULL, 'القديم', 'B,C1,C2'),
('00398-2021-283', '2021-09-02', 'بن نجمة', 'عمر', 'عيسي', '1984-12-01', 'المصدق', 'ابتدائي', 'شارع بوعزة قدور مصدق الشلف', 'ذكر', 'حر', '02/141/2019', '2019-10-06', NULL, 'القديم', 'B,C1,C2'),
('00399-2021-283', '2021-09-02', 'بن نافلة', 'رشيد', 'زيان', '1989-07-21', 'الصبحة', 'ابتدائي', 'الروافعية الهرانفة الشلف', 'ذكر', 'حر', '02/354/2017', '2017-06-28', NULL, 'القديم', 'B,C1,C2'),
('00400-2021-283', '2021-09-05', 'نافع', 'محمد', 'بو عبد الله', '1968-12-31', 'تاجنة', 'بدون مستوى', 'الحي الجديد بلدية الهرانفة الشلف', 'ذكر', 'حر', '02/148/2021', '2021-04-21', NULL, 'القديم', 'B,C1,C2,E'),
('00401-2021-283', '2021-09-05', 'بوطبل', 'محمد', 'عبد القادر', '1990-01-20', 'الشلف', 'متوسط', 'حي النشاطات الشطية الشلف', 'ذكر', 'حر', 'A00667903', '2020-03-16', NULL, 'بيومتري', 'B,C1'),
('00402-2021-283', '2021-09-05', 'بوطبل', 'العربي', 'عبد القادر', '1982-03-27', 'سنجاس', 'ثانوي', 'منطقة النشاطات الشطية الشلف', 'ذكر', 'حر', '02/9199/2015', '2015-04-05', NULL, 'القديم', 'B,C1,C2'),
('00403-2021-283', '2021-09-05', 'جلطي', 'أحمد', 'محمد', '1981-01-16', 'الصبحة', 'متوسط', 'الصبحة مركز الشلف', 'ذكر', 'حر', '02/1384/2017', '2017-10-15', NULL, 'القديم', 'B,C1,C2'),
('00404-2021-283', '2021-09-06', 'زيان بروجة', 'جيلالي', 'طيب', '1970-05-13', 'أولاد فارس', 'متوسط', 'أولاد أحمد الأبيض مجاجة الشلف', 'ذكر', 'حر', '02/293/2020', '2020-09-02', NULL, 'القديم', 'B,C1,C2,E');

-- --------------------------------------------------------

--
-- Structure de la table `centre`
--

DROP TABLE IF EXISTS `centre`;
CREATE TABLE IF NOT EXISTS `centre` (
  `NUMERO_AGREMENT` varchar(50) NOT NULL,
  `NOM_CENTRE` varchar(50) DEFAULT NULL,
  `SIEGE` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`NUMERO_AGREMENT`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `centre`
--

INSERT INTO `centre` (`NUMERO_AGREMENT`, `NOM_CENTRE`, `SIEGE`) VALUES
('283', 'عاصم', 'الشطية');

-- --------------------------------------------------------

--
-- Structure de la table `formation`
--

DROP TABLE IF EXISTS `formation`;
CREATE TABLE IF NOT EXISTS `formation` (
  `NUMERO_FORMATION` int(11) NOT NULL,
  `GROUPE` int(11) NOT NULL,
  `NUMERO_AGREMENT` varchar(50) NOT NULL,
  `TYPE_FORMATION` varchar(50) DEFAULT NULL,
  `DEBUT` date DEFAULT NULL,
  `FIN` date DEFAULT NULL,
  PRIMARY KEY (`NUMERO_FORMATION`,`GROUPE`,`NUMERO_AGREMENT`),
  KEY `FK_OFFRE` (`NUMERO_AGREMENT`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `formation`
--

INSERT INTO `formation` (`NUMERO_FORMATION`, `GROUPE`, `NUMERO_AGREMENT`, `TYPE_FORMATION`, `DEBUT`, `FIN`) VALUES
(3, 1, '283', 'نقل البضائع', '2019-07-11', '2019-08-01'),
(3, 2, '283', 'نقل البضائع', '2019-07-11', '2019-08-01'),
(5, 1, '283', 'نقل البضائع', '2020-02-22', '2020-03-07'),
(6, 1, '283', 'نقل البضائع', '2020-02-10', '2020-02-25'),
(7, 1, '283', 'نقل البضائع', '2020-02-27', '2020-03-13'),
(8, 1, '283', 'نقل البضائع', '2020-08-22', '2020-10-08'),
(8, 2, '283', 'نقل البضائع', '2020-08-22', '2020-10-08'),
(8, 3, '283', 'نقل البضائع', '2020-08-22', '2020-10-08'),
(9, 1, '283', 'نقل البضائع', '2021-02-08', '2021-02-22'),
(9, 2, '283', 'نقل البضائع', '2021-02-08', '2021-02-22'),
(10, 1, '283', 'نقل البضائع', '2021-04-05', '2021-04-19'),
(10, 2, '283', 'نقل البضائع', '2021-04-05', '2021-04-19'),
(10, 3, '283', 'نقل المسافرين', '2021-04-05', '2021-04-19'),
(11, 1, '283', 'نقل البضائع', '2021-05-01', '2021-05-30'),
(11, 2, '283', 'نقل البضائع', '2021-05-01', '2021-05-30'),
(11, 3, '283', 'نقل البضائع', '2021-05-01', '2021-05-30'),
(12, 1, '283', 'نقل البضائع', '2021-06-01', '2021-06-23'),
(12, 2, '283', 'نقل البضائع', '2021-06-01', '2021-06-23'),
(12, 3, '283', 'نقل البضائع', '2021-06-01', '2021-06-23'),
(13, 1, '283', 'نقل البضائع', '2021-06-25', '2021-07-12'),
(13, 2, '283', 'نقل البضائع', '2021-06-25', '2021-07-12'),
(13, 3, '283', 'نقل البضائع', '2021-06-25', '2021-07-12'),
(14, 1, '283', 'نقل البضائع', '2021-07-16', '2021-08-05'),
(14, 2, '283', 'نقل البضائع', '2021-07-16', '2021-08-05'),
(14, 3, '283', 'نقل البضائع', '2021-07-16', '2021-08-05'),
(15, 1, '283', 'نقل البضائع', '2021-08-06', '2021-08-25'),
(15, 2, '283', 'نقل البضائع', '2021-08-06', '2021-08-25'),
(15, 3, '283', 'نقل البضائع', '2021-08-06', '2021-08-25'),
(17, 1, '283', 'نقل البضائع', '2021-09-18', '2021-10-02');

-- --------------------------------------------------------

--
-- Structure de la table `ligne`
--

DROP TABLE IF EXISTS `ligne`;
CREATE TABLE IF NOT EXISTS `ligne` (
  `NUM_INS` varchar(20) NOT NULL,
  `DATE_INS` date NOT NULL,
  `NUM_PERMIS` varchar(45) NOT NULL,
  `MATRECULE` varchar(10) NOT NULL,
  `NUM_LIGNE` varchar(100) NOT NULL,
  `TYPE_LIGNE` varchar(50) DEFAULT NULL,
  `DATE_LIV_LIGNE` date DEFAULT NULL,
  `DATE_EXP_LIGNE` date DEFAULT NULL,
  PRIMARY KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`,`MATRECULE`,`NUM_LIGNE`),
  KEY `FK_LIGNE` (`MATRECULE`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Structure de la table `operateur`
--

DROP TABLE IF EXISTS `operateur`;
CREATE TABLE IF NOT EXISTS `operateur` (
  `NOM_OP` char(50) NOT NULL,
  `SIEGE_OP` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`NOM_OP`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Structure de la table `passe`
--

DROP TABLE IF EXISTS `passe`;
CREATE TABLE IF NOT EXISTS `passe` (
  `NUM_INS` varchar(20) NOT NULL,
  `DATE_INS` date NOT NULL,
  `NUM_PERMIS` varchar(45) NOT NULL,
  `NUMERO_FORMATION` int(11) NOT NULL,
  `GROUPE` int(11) NOT NULL,
  `NUMERO_AGREMENT` varchar(50) NOT NULL,
  `NOTE` float DEFAULT NULL,
  `REMARQUE` varchar(50) DEFAULT NULL,
  `BREVET` varchar(45) DEFAULT NULL,
  `LIV_BREVET` date DEFAULT NULL,
  `EXP_BREVET` date DEFAULT NULL,
  `PRINT` int(1) DEFAULT '0',
  `DATE_EMISSION` date DEFAULT NULL,
  `NUMERO` int(2) NOT NULL DEFAULT '0',
  PRIMARY KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`,`NUMERO_FORMATION`,`GROUPE`,`NUMERO_AGREMENT`),
  KEY `FK_PASSE` (`NUMERO_FORMATION`),
  KEY `FK_PASSE3` (`NUMERO_FORMATION`,`GROUPE`,`NUMERO_AGREMENT`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `passe`
--

INSERT INTO `passe` (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`, `NUMERO_FORMATION`, `GROUPE`, `NUMERO_AGREMENT`, `NOTE`, `REMARQUE`, `BREVET`, `LIV_BREVET`, `EXP_BREVET`, `PRINT`, `DATE_EMISSION`, `NUMERO`) VALUES
('00001-2020-283', '2020-01-12', '02/4399/2015', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 13),
('00002-2020-283', '2020-01-12', '02/465/2017', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 12),
('00002-2021-283', '2021-01-04', '02/316/2019', 12, 2, '283', 12.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 1),
('00003-2020-283', '2020-01-12', '02/1197/2016', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 11),
('00004-2021-283', '2021-01-05', 'A01065766', 10, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 7),
('00005-2020-283', '2020-01-13', '02/4878/2015', 6, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 5),
('00005-2021-283', '2021-01-05', '02/1202/2019', 9, 1, '283', 15.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00006-2019-283', '2019-01-13', '02/0276/2018', 6, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 1),
('00006-2021-283', '2021-01-05', '02/899/2018', 11, 1, '283', 13.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 8),
('00007-2020-283', '2020-01-13', '02/10119/2015', 6, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 2),
('00007-2021-283', '2021-01-17', '02/716/2018', 9, 1, '283', 15.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 5),
('00008-2020-283', '2020-01-13', '02/1261/2017', 6, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 3),
('00009-2020-283', '2020-01-13', '02/528/2016', 6, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 4),
('00009-2021-283', '2021-01-18', '02/788/2016', 11, 3, '283', 14.37, 'ناجح', NULL, NULL, NULL, 0, NULL, 11),
('00010-2020-283', '2020-01-13', '02/623/2017', 7, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 1),
('00010-2021-283', '2021-01-19', '02/408/2018', 9, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00011-2020-283', '2020-01-11', '02/1321/2019', 7, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 2),
('00011-2021-283', '2021-01-25', '02/6715/2016', 9, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00012-2020-283', '2020-01-13', '02/1103/2019', 7, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 3),
('00012-2021-283', '2021-01-31', '02/157/2017', 10, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 5),
('00013-2021-283', '2021-01-13', '02/612/2019', 9, 1, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 4),
('00013-2021-283', '2021-01-13', '02/612/2019', 10, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 10),
('00014-2020-283', '2020-01-13', '02/5647/2017', 8, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00015-2019-283', '2019-01-12', '02/442/2016', 3, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 14),
('00016-2019-283', '2019-01-12', '02/023/2018', 3, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 15),
('00016-2020-283', '2020-01-13', '02/1235/2017', 8, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00017-2020-283', '2020-01-13', '02/1362/2017', 8, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00018-2020-283', '2020-01-13', '02/80/2020', 8, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00019-2020-283', '2020-01-13', '02/12589/2015', 8, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00019-2021-283', '2021-02-07', '02/288/2019', 11, 3, '283', 13.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 10),
('00020-2020-283', '2020-01-13', '02/656/2016', 8, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00020-2021-283', '2021-02-10', '02/700/2018', 10, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 10),
('00021-2020-283', '2020-01-13', '02/438/2019', 8, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00021-2021-283', '2021-02-28', '02/451/2018', 10, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 3),
('00023-2021-283', '2021-03-02', '02/086/2021', 10, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 5),
('00024-2021-283', '2021-03-02', '02/27/2021', 10, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 6),
('00025-2020-283', '2020-02-05', '02/0393/2018', 8, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00026-2020-283', '2020-11-02', 'A013118670', 13, 1, '283', 15.12, 'ناجح', NULL, NULL, NULL, 0, NULL, 11),
('00026-2021-283', '2021-03-08', '02/632/2019', 11, 2, '283', 12.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00027-2020-283', '2020-11-11', '02/11863/2015', 12, 3, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 3),
('00027-2020-283', '2020-11-11', '02/11863/2015', 13, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 13),
('00027-2021-283', '2021-03-08', '02/826/2020', 12, 3, '283', 14, 'ناجح', NULL, NULL, NULL, 0, NULL, 4),
('00028-2020-283', '2020-11-15', '02/1123/2018', 9, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00028-2020-283', '2020-11-15', '02/1123/2018', 10, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 9),
('00028-2020-283', '2020-11-15', '02/1123/2018', 11, 3, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 13),
('00028-2020-283', '2020-11-15', '02/1123/2018', 12, 3, '283', 12.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 14),
('00028-2021-283', '2021-03-08', 'A00114019', 10, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 1),
('00029-2021-283', '2021-03-10', '02/2111/2019', 10, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 8),
('00030-2020-283', '2020-11-15', '02/2954/2018', 9, 1, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 9),
('00030-2021-283', '2021-03-10', '02/1377/2019', 10, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 2),
('00030-2021-283', '2021-03-10', '02/1377/2019', 11, 3, '283', 13.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 12),
('00031-2021-283', '2021-03-10', '02/64/2020', 10, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 3),
('00031-2021-283', '2021-03-10', '02/64/2020', 12, 3, '283', 13.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 10),
('00032-2020-283', '2020-11-29', '02/892/2018', 9, 1, '283', 16.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 1),
('00033-2020-283', '2020-12-06', '02/3965/2018', 9, 1, '283', 15.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00033-2021-283', '2021-03-14', '02/1068/2017', 10, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 1),
('00034-2020-283', '2020-12-06', '02/198/2017', 9, 1, '283', 15.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 3),
('00034-2021-283', '2021-03-16', '02/300/2020', 11, 3, '283', 13.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 3),
('00035-2020-283', '2020-12-09', '02/470/2018', 9, 1, '283', 15.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 8),
('00036-2021-283', '2021-03-22', '02/328/2017', 12, 2, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 9),
('00037-2020-283', '2020-12-09', '02/238/2021', 10, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 2),
('00037-2021-283', '2021-03-22', '00009441', 10, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 2),
('00038-2020-283', '2020-12-09', '02/1587/2017', 10, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 4),
('00038-2021-283', '2021-03-22', '02/391/2020', 11, 3, '283', 13.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 4),
('00039-2020-283', '2020-12-09', '02/1212/2016', 10, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 1),
('00040-2020-283', '2020-12-09', '02/323/2018', 10, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 3),
('00041-2020-283', '2020-12-09', '02/530/2019', 12, 1, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 9),
('00041-2020-283', '2020-12-09', '02/530/2019', 15, 3, '283', 13.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 10),
('00042-2020-283', '2020-12-09', '02/628/2020', 12, 1, '283', 13.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 8),
('00043-2020-283', '2020-12-09', 'R0181365', 9, 1, '283', 16, 'ناجح', NULL, NULL, NULL, 0, NULL, 10),
('00043-2021-2', '2021-08-02', '02/725/2019', 12, 3, '283', 12, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00044-2021-283', '2021-03-24', '02/361/2020', 12, 1, '283', 10.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 10),
('00045-2021-283', '2021-03-24', '02/0185/2021', 12, 3, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 5),
('00045-2021-283', '2021-03-24', '02/0185/2021', 13, 2, '283', 14.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 10),
('00046-2020-283', '2020-12-21', '02/441/2020', 10, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 8),
('00047-2020-283', '2020-12-21', '02/1496/2017', 11, 2, '283', 12, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00047-2021-283', '2021-03-25', '02/98/2021', 11, 1, '283', 12.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00048-2021-283', '2018-12-28', '02/3702/2015', 15, 3, '283', 12.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 13),
('00048-2021-283', '2021-03-24', '02/263/2019', 11, 2, '283', 13.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 3),
('00049-2020-283', '2020-12-27', '02/418/2019', 10, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 6),
('00050-2019-283', '2019-01-02', '02/1448/2018', 3, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 6),
('00050-2020-283', '2020-12-31', '02/1453/2017', 12, 2, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 4),
('00050-2020-283', '2020-12-31', '02/1453/2017', 13, 1, '283', 14, 'ناجح', NULL, NULL, NULL, 0, NULL, 10),
('00050-2021-283', '2021-03-27', '00001740', 10, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 9),
('00052-2021-283', '2019-01-02', '02/0163/2018', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 15),
('00052-2021-283', '2021-03-29', '02/9449/2015', 10, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 8),
('00053-2019-283', '2019-01-03', '02/7362/2018', 11, 2, '283', 14.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 10),
('00053-2020-283', '2020-01-31', '02/612/2017', 10, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 4),
('00053-2021-283', '2021-03-29', 'A01213764', 12, 2, '283', 12.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00054-2020-283', '2020-12-31', '02/637/2019', 9, 1, '283', 15.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00054-2021-283', '2021-08-07', '02/789/2020', 15, 2, '283', 12.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 1),
('00056-2021-283', '2021-08-01', '209900051002890003', 14, 1, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 4),
('00056-2021-283', '2021-08-01', '209900051002890003', 15, 2, '283', 13, 'ناجح', NULL, NULL, NULL, 0, NULL, 11),
('00057-2021-283', '2021-03-30', '02/430/2018', 10, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 7),
('00058-2021-283', '2021-03-31', '02/754/2019', 10, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 6),
('00059-2021-283', '2021-03-31', '02/571/2020', 13, 1, '283', 15.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00060-2021-283', '2021-03-31', '02/0317/2019', 12, 1, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 5),
('00060-2021-283', '2021-03-31', '02/0317/2019', 14, 1, '283', 13.62, 'ناجح', '0000000', '2021-08-17', '2030-08-18', 1, '2021-08-12', 12),
('00061-2021-283', '2021-03-31', '02/379/2018', 12, 2, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 10),
('00061-2021-283', '2021-03-31', '02/379/2018', 14, 2, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 11),
('00061-2021-283', '2021-03-31', '02/379/2018', 15, 2, '283', 14.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 10),
('00064-2021-283', '2021-03-31', '0004462', 11, 3, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 1),
('00064-2021-283', '2021-03-31', '0004462', 13, 3, '283', 14.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 12),
('00065-2021-283', '2021-03-31', '02/2113/2020', 15, 2, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 3),
('00067-2021-283', '2021-04-01', '02/1109/2017', 11, 1, '283', 12.12, 'ناجح', NULL, NULL, NULL, 0, NULL, 3),
('00068-2021-283', '2021-04-01', '02/2885/2018', 11, 3, '283', 13.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00070-2021-283', '2021-04-01', 'R01674784', 11, 2, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 1),
('00070-2021-283', '2021-04-01', 'R01674784', 12, 3, '283', 13.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 13),
('00073-2021-283', '2021-04-04', '02/403/2017', 15, 3, '283', 13.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00074-2021-283', '2021-04-04', '02/855/2018', 11, 1, '283', 12.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00075-2021-283', '2021-04-04', '02/953/2019', 12, 2, '283', 11.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00076-2021-283', '2021-04-05', '02/156/2019', 11, 3, '283', 14.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 8),
('00077-2019-283', '2019-02-11', '02/13/2016', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 1),
('00077-2021-283', '2021-04-05', '02/1129/2018', 14, 1, '283', 11.87, 'ناجح', '577232', NULL, NULL, 1, NULL, 1),
('00078-2021-283', '2021-04-05', '02/1248/2019', 13, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 3),
('00079-2019-283', '2021-02-11', '02/16124/15', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 2),
('00079-2021-283', '2021-04-05', '02/1617/2017', 11, 3, '283', 12.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 5),
('00080-2019-283', '2019-02-11', '02/556/2018', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 3),
('00080-2021-283', '2021-04-06', '02/163/2018', 14, 1, '283', 11.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 8),
('00081-2019-283', '2019-02-11', '02/354/2016', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 5),
('00081-2021-283', '2021-04-06', '02/68/2021', 12, 3, '283', 12.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00082-2019-283', '2021-02-11', '02/2843/2015', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 4),
('00082-2021-283', '2021-04-06', '02/230/2020', 11, 1, '283', 14.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 9),
('00083-2021-283', '2021-04-06', '02/2218/2020', 11, 1, '283', 12.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 5),
('00084-2021-283', '2021-04-07', '02/120/2017', 14, 1, '283', 12.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 11),
('00085-2021-283', '2021-04-07', '02/347/2017', 12, 1, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 4),
('00085-2021-283', '2021-04-07', '02/347/2017', 14, 3, '283', 13.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 11),
('00086-2021-283', '2021-04-07', '02/3994/2016', 11, 3, '283', 14.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00087-2019-283', '2019-02-14', '02/180/2020', 13, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 8),
('00089-2021-283', '2021-04-08', '02/25897/2015', 11, 2, '283', 14.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 4),
('00090-2021-283', '2021-04-08', '02/1116/2019', 12, 1, '283', 11.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 1),
('00091-2021-283', '2021-04-11', '02/228/2020', 11, 2, '283', 13.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 9),
('00091-2021-283', '2021-04-11', '02/712/2016', 11, 3, '283', 13.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 9),
('00093-2021-283', '2021-04-11', '02/2240/2020', 11, 3, '283', 13.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00094-2019-283', '2019-08-17', '02/616/2014', 3, 2, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 5),
('00094-2021-283', '2021-04-11', '02/453/2017', 12, 1, '283', 12.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00095-2021-283', '2021-04-11', '02/403/2020', 15, 2, '283', 14, 'ناجح', NULL, NULL, NULL, 0, NULL, 9),
('00097-2021-283', '2021-04-12', '02/029/2017', 11, 1, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 6),
('00097-2021-283', '2021-04-12', '02/029/2017', 12, 3, '283', 13.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 11),
('00098-2021-283', '2021-04-12', '02/1078/2019', 11, 1, '283', 11.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 4),
('00099-2021-283', '2021-04-12', '02/270/2020', 11, 1, '283', 13, 'ناجح', NULL, NULL, NULL, 0, NULL, 1),
('00100-2021-283', '2021-04-12', '02/252/2018', 13, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 9),
('00101-2021-283', '2021-04-12', '02/1701/2017', 11, 2, '283', 12.37, 'ناجح', NULL, NULL, NULL, 0, NULL, 8),
('00102-2021-283', '2021-04-14', '00003071', 11, 2, '283', 14.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 5),
('00103-2021-283', '2021-04-14', '02/2436/2020', 13, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 1),
('00104-2021-283', '2021-04-14', '02/7346/2017', 13, 2, '283', 14.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00106-2021-283', '2021-04-15', '02/559/2019', 13, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 2),
('00107-2021-283', '2021-04-15', '02/112/2020', 15, 1, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 1),
('00108-2021-283', '2021-04-15', '02/99/2016', 13, 2, '283', 14, 'ناجح', NULL, NULL, NULL, 0, NULL, 9),
('00109-2021-283', '2021-04-17', '02/1617/2017', 12, 1, '283', 12.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00111-2021-283', '2021-04-17', '02/033/2020', 14, 2, '283', 14, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00112-2021-283', '2021-04-18', '02/284/2020', 14, 2, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 1),
('00112-2021-283', '2021-04-18', '02/284/2020', 15, 3, '283', 13.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 11),
('00113-2021-283', '2021-04-18', '02/108/2017', 14, 1, '283', 11.25, 'ناجح', '21321', NULL, NULL, 1, NULL, 2),
('00118-2021-283', '2021-04-20', '02/396/2020', 13, 1, '283', 13.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 1),
('00119-2021-283', '2021-04-20', '02/2884/2017', 13, 1, '283', 14.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00120-2019-283', '2019-10-13', '02/6271/2015', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 9),
('00120-2021-283', '2021-04-20', '02/1094/2017', 13, 1, '283', 13, 'ناجح', NULL, NULL, NULL, 0, NULL, 3),
('00121-2021-283', '2021-04-20', '02/280/2020', 13, 1, '283', 15.37, 'ناجح', NULL, NULL, NULL, 0, NULL, 4),
('00122-2021-283', '2021-04-20', '02/325/2020', 13, 2, '283', 13.37, 'ناجح', NULL, NULL, NULL, 0, NULL, 1),
('00123-2021-283', '2021-04-20', '02/3234/2018', 13, 2, '283', 14.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00124-2021-283', '2021-04-20', '02/761/2016', 13, 2, '283', 14.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 3),
('00125-2019-283', '2019-12-30', '02/04/2017', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 8),
('00125-2021-283', '2021-04-20', '02/552/2020', 13, 2, '283', 14.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 4),
('00127-2019-283', '2019-12-30', '02/348/2019', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 7),
('00127-2019-283', '2019-12-30', '02/348/2019', 6, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 6),
('00127-2021-283', '2021-04-20', '02/596/2017', 13, 1, '283', 15.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00128-2019-283', '2019-12-30', '02/365/2016', 5, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 6),
('00128-2021-283', '2021-04-20', '02/129/2016', 13, 1, '283', 15, 'ناجح', NULL, NULL, NULL, 0, NULL, 5),
('00129-2021-283', '2021-04-20', '02/947/2019', 13, 2, '283', 13.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 5),
('00131-2021-283', '2021-04-21', '02/1230/2019', 14, 1, '283', 13.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 3),
('00132-2021-283', '2021-04-22', '02/17833/15', 15, 3, '283', 12.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 1),
('00134-2021-283', '2021-04-22', '02/399/2020', 11, 2, '283', 14.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00141-2021-283', '2021-04-26', '02/674/2019', 13, 2, '283', 14.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00142-2021-283', '2021-04-27', '02/242/2018', 15, 2, '283', 12.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00143-2021-283', '2021-04-29', '02/169/2017', 12, 1, '283', 13, 'ناجح', NULL, NULL, NULL, 0, NULL, 3),
('00147-2021-283', '2021-04-29', '02/095/2017', 13, 3, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 4),
('00149-2021-283', '2021-05-02', '02/623/2018', 15, 1, '283', 12.37, 'ناجح', '577234', NULL, NULL, 1, NULL, 2),
('00155-2021-283', '2021-05-03', '02/846/2016', 15, 2, '283', 12.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 4),
('00156-2021-283', '2021-05-03', '02/248/2021', 15, 2, '283', 13.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 5),
('00159-2021-283', '2021-04-04', '02/955/2020', 12, 1, '283', 13.62, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00162-2021-283', '2021-05-05', '02/569/2020', 14, 1, '283', 11.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 9),
('00163-2021-283', '2021-05-05', '02/363/2017', 14, 2, '283', 13.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 4),
('00168-2021-283', '2021-05-06', '02/474/2017', 13, 1, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 8),
('00168-2021-283', '2021-05-06', '02/474/2017', 14, 3, '283', 12, 'ناجح', NULL, NULL, NULL, 0, NULL, 12),
('00169-2021-283', '2021-05-06', '02/975/2017', 12, 3, '283', 13.37, 'ناجح', NULL, NULL, NULL, 0, NULL, 9),
('00171-2021-283', '2021-05-08', '02/567/2020', 14, 2, '283', 12.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 3),
('00172-2021-283', '2021-05-09', '02/79/2017', 14, 1, '283', 12.12, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00175-2021-283', '2021-05-10', '00013242', 14, 1, '283', 12.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 10),
('00179-2021-283', '2021-05-11', '02/49/2019', 14, 1, '283', 12.12, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00180-2021-283', '2021-05-12', '02/65/2019', 14, 1, '283', 11.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 5),
('00194-2021-283', '2021-05-18', '02/31661/16', 12, 2, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 8),
('00194-2021-283', '2021-05-18', '02/31661/16', 14, 2, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 10),
('00195-2021-283', '2021-05-18', 'A01244784', 15, 3, '283', 14.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00197-2021-283', '2021-05-18', 'A00404356', 14, 3, '283', 14, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00200-2021-283', '2021-05-18', '02/592/2020', 14, 2, '283', 13.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 5),
('00202-2021-283', '2021-05-19', '02/838/2019', 14, 2, '283', 12.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00203-2021-283', '2021-05-19', '02/1687/2019', 15, 3, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 8),
('00204-2021-283', '2021-05-19', '02/439/2017', 14, 2, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 9),
('00204-2021-283', '2021-05-19', '02/439/2017', 15, 3, '283', 12.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 9),
('00207-2021-283', '2021-05-22', '02/331/2020', 14, 2, '283', 12.12, 'ناجح', NULL, NULL, NULL, 0, NULL, 8),
('00217-2021-283', '2021-05-26', '02/1113/2017', 15, 2, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 7),
('00220-2021-283', '2021-05-30', '02/294/2020', 14, 3, '283', 14, 'ناجح', NULL, NULL, NULL, 0, NULL, 9),
('00223-2021-283', '2021-05-23', '02/183/2019', 14, 3, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 6),
('00223-2021-283', '2021-05-23', '02/183/2019', 15, 3, '283', 13.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 12),
('00224-2021-283', '2021-05-30', '02/0186/2020', 14, 3, '283', 14.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00225-2021-283', '2021-05-30', '02/318/2021', 14, 3, '283', 12.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 8),
('00227-2021-283', '2021-05-31', '02/1279/2019', 15, 3, '283', 12.37, 'ناجح', NULL, NULL, NULL, 0, NULL, 3),
('00230-2021-283', '2021-05-31', 'R02183796', 12, 3, '283', 12.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 1),
('00235-2021-283', '2021-05-03', '02/158/2021', 14, 3, '283', 14.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 5),
('00236-2021-283', '2021-06-03', '02/520/2017', 14, 3, '283', 13.12, 'ناجح', NULL, NULL, NULL, 0, NULL, 4),
('00237-2021-283', '2021-06-03', '00000727', 14, 3, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 3),
('00237-2021-283', '2021-06-03', '00000727', 15, 1, '283', 12.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 12),
('00239-2021-283', '2021-06-03', '02/584/2018', 15, 1, '283', 13.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 4),
('00240-2021-283', '2021-06-03', '02/1460/2016', 15, 1, '283', 12.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 3),
('00242-2021-283', '2021-06-03', '02/549/2019', 15, 1, '283', 12.87, 'ناجح', NULL, NULL, NULL, 0, NULL, 5),
('00247-2021-283', '2021-06-03', '02/186/2021', 15, 1, '283', 12.75, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 6),
('00251-2021-283', '2021-06-07', '02/0162/2016', 14, 3, '283', 13.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 10),
('00258-2021-283', '2021-06-08', '02/552/2017', 15, 2, '283', 11.5, 'ناجح', NULL, NULL, NULL, 0, NULL, 8),
('00272-2021-283', '2021-06-20', '02/303/2020', 15, 2, '283', 13.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 2),
('00275-2021-283', '2021-06-20', '02/593/2020', 14, 3, '283', 14.12, 'ناجح', NULL, NULL, NULL, 0, NULL, 1),
('00299-2021-283', '2021-07-06', '02/4260/2017', 15, 1, '283', 13.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00300-2021-283', '2021-07-06', 'A010567276', 15, 3, '283', 14.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 4),
('00308-2021-283', '2021-07-11', '02/043/2020', 14, 2, '283', 11.75, 'ناجح', NULL, NULL, NULL, 0, NULL, 6),
('00321-2021-283', '2021-07-18', '02/1033/2020', 17, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0),
('00324-2021-283', '2021-07-22', '02/1883/2020', 15, 3, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 5),
('00326-2021-283', '2021-07-24', '517', 15, 3, '283', 15.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 7),
('00332-2021-283', '2021-07-27', '02/0463/2020', 15, 1, '283', 12, 'ناجح', NULL, NULL, NULL, 0, NULL, 8),
('00344-2021-283', '2021-07-31', '02/686/2018', 15, 1, '283', 14.25, 'ناجح', NULL, NULL, NULL, 0, NULL, 9),
('00345-2021-283', '2021-07-31', '02/617/2018', 15, 1, '283', 0, 'مؤجل للإمتحان', NULL, NULL, NULL, 0, NULL, 10),
('00353-2021-283', '2021-08-04', '02/0551/2016', 15, 1, '283', 0, 'مؤجل للإستدراك', NULL, NULL, NULL, 0, NULL, 11),
('00385-2021-283', '2021-08-25', '02/1459/2019', 17, 1, '283', NULL, NULL, NULL, NULL, NULL, 0, NULL, 1);

-- --------------------------------------------------------

--
-- Structure de la table `per_circule`
--

DROP TABLE IF EXISTS `per_circule`;
CREATE TABLE IF NOT EXISTS `per_circule` (
  `NUM_INS` varchar(20) NOT NULL,
  `DATE_INS` date NOT NULL,
  `NUM_PERMIS` varchar(45) NOT NULL,
  `MATRECULE` varchar(10) NOT NULL,
  `NUM_PER` varchar(40) NOT NULL,
  `DATE_LIV_PER` date DEFAULT NULL,
  `DATE_EXP_PER` date DEFAULT NULL,
  PRIMARY KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`,`MATRECULE`,`NUM_PER`),
  KEY `FK_PER_CIRCULE` (`MATRECULE`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Structure de la table `travail`
--

DROP TABLE IF EXISTS `travail`;
CREATE TABLE IF NOT EXISTS `travail` (
  `NUM_INS` varchar(20) NOT NULL,
  `DATE_INS` date NOT NULL,
  `NUM_PERMIS` varchar(45) NOT NULL,
  `NOM_OP` char(50) NOT NULL,
  `DATE_RECRUT` date NOT NULL,
  `DATE_FIN` date DEFAULT NULL,
  `ETAT` varchar(10) DEFAULT NULL,
  PRIMARY KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`,`NOM_OP`),
  KEY `FK_TRAVAIL` (`NOM_OP`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Structure de la table `user`
--

DROP TABLE IF EXISTS `user`;
CREATE TABLE IF NOT EXISTS `user` (
  `USERNAME` varchar(50) NOT NULL,
  `PASSWORD` varchar(50) NOT NULL,
  `ADMIN` varchar(10) NOT NULL,
  `NUMERO_AGREMENT` varchar(50) NOT NULL,
  PRIMARY KEY (`USERNAME`,`PASSWORD`,`ADMIN`),
  KEY `FK_CONTIENT` (`NUMERO_AGREMENT`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `user`
--

INSERT INTO `user` (`USERNAME`, `PASSWORD`, `ADMIN`, `NUMERO_AGREMENT`) VALUES
('assim', '0000', 'admin', '283');

-- --------------------------------------------------------

--
-- Structure de la table `vehicule`
--

DROP TABLE IF EXISTS `vehicule`;
CREATE TABLE IF NOT EXISTS `vehicule` (
  `MATRECULE` varchar(10) NOT NULL,
  `NOM_OP` char(50) NOT NULL,
  `GENRE` varchar(20) DEFAULT NULL,
  `MARQUE` varchar(20) DEFAULT NULL,
  `PTC` decimal(10,3) DEFAULT NULL,
  `PTAC` decimal(10,3) DEFAULT NULL,
  `CU` decimal(10,3) DEFAULT NULL,
  `NOMBRE_PLACE` int(11) DEFAULT NULL,
  PRIMARY KEY (`MATRECULE`),
  KEY `FK_APPARTIENT` (`NOM_OP`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Contraintes pour les tables déchargées
--

--
-- Contraintes pour la table `formation`
--
ALTER TABLE `formation`
  ADD CONSTRAINT `FK_OFFRE` FOREIGN KEY (`NUMERO_AGREMENT`) REFERENCES `centre` (`NUMERO_AGREMENT`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Contraintes pour la table `ligne`
--
ALTER TABLE `ligne`
  ADD CONSTRAINT `FK_LIGNE` FOREIGN KEY (`MATRECULE`) REFERENCES `vehicule` (`MATRECULE`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `FK_LIGNE2` FOREIGN KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`) REFERENCES `candidat` (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Contraintes pour la table `passe`
--
ALTER TABLE `passe`
  ADD CONSTRAINT `FK_PASSE2` FOREIGN KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`) REFERENCES `candidat` (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `FK_PASSE3` FOREIGN KEY (`NUMERO_FORMATION`,`GROUPE`,`NUMERO_AGREMENT`) REFERENCES `formation` (`NUMERO_FORMATION`, `GROUPE`, `NUMERO_AGREMENT`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Contraintes pour la table `per_circule`
--
ALTER TABLE `per_circule`
  ADD CONSTRAINT `FK_PER_CIRCULE` FOREIGN KEY (`MATRECULE`) REFERENCES `vehicule` (`MATRECULE`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `FK_PER_CIRCULE2` FOREIGN KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`) REFERENCES `candidat` (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Contraintes pour la table `travail`
--
ALTER TABLE `travail`
  ADD CONSTRAINT `FK_TRAVAIL` FOREIGN KEY (`NOM_OP`) REFERENCES `operateur` (`NOM_OP`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `FK_TRAVAIL2` FOREIGN KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`) REFERENCES `candidat` (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Contraintes pour la table `user`
--
ALTER TABLE `user`
  ADD CONSTRAINT `FK_CONTIENT` FOREIGN KEY (`NUMERO_AGREMENT`) REFERENCES `centre` (`NUMERO_AGREMENT`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Contraintes pour la table `vehicule`
--
ALTER TABLE `vehicule`
  ADD CONSTRAINT `FK_APPARTIENT` FOREIGN KEY (`NOM_OP`) REFERENCES `operateur` (`NOM_OP`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
