-- MySQL dump 10.13  Distrib 5.6.17, for Win32 (x86)
--
-- Host: localhost    Database: bdd
-- ------------------------------------------------------
-- Server version	5.5.40-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `candidat`
--

DROP TABLE IF EXISTS `candidat`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `candidat` (
  `NUM_INS` varchar(20) NOT NULL,
  `DATE_INS` date NOT NULL,
  `NOM_CANDIDAT` char(50) NOT NULL,
  `PRENOM_CANDIDAT` char(50) NOT NULL,
  `PRENOM_PERE` varchar(50) NOT NULL,
  `DATE_NAIS_CANDIDAT` date NOT NULL,
  `LIEU_NAIS_CANDIDAT` varchar(20) NOT NULL,
  `NIVEAU_SCOL_CANDIDAT` varchar(50) DEFAULT NULL,
  `ADRESSE_CANDIDAT` varchar(100) DEFAULT NULL,
  `SEX_CONDIDAT` char(10) DEFAULT NULL,
  `TYPE_CANDIDAT` varchar(20) DEFAULT NULL,
  `NUM_PERMIS` varchar(45) NOT NULL,
  `DATE_LIV_PERMIS` date DEFAULT NULL,
  `DATE_EXP_PERMIS` date DEFAULT NULL,
  `TYPE_PERMIS` varchar(50) DEFAULT NULL,
  `CATEGORIE_PERMIS` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `candidat`
--

LOCK TABLES `candidat` WRITE;
/*!40000 ALTER TABLE `candidat` DISABLE KEYS */;
INSERT INTO `candidat` VALUES ('00001-2020-283','2021-01-12','بلميلود','عبد الرزاق','محمد','1979-02-02','الشلف','متوسط','م 04 رقم  332 الشطية - الشلف','ذكر','متعاقد','02/4399/2015','2015-02-15','2020-02-14','بيومتري','A1,A,B,D,C1,C,BE,C1E,CE,DE,F'),('00002-2020-2','2020-01-12','بلحاج','أحمد','رشيد','1984-11-11','أولاد فارس','متوسط','المركز أولاد فارس - الشلف','ذكر','متعاقد','02/465/2017','2017-04-03','2022-04-02','القديم','B,C1,C2'),('00003-2020-2','2020-01-12','عاقب','أحمد','محمد','1966-06-08','تنس','ابتدائي',' حي الشعارير رقم 35 تنس -الشلف ','ذكر','متعاقد','02/1197/2016','2016-06-06','2021-06-07','القديم','B,C1,C2'),('00004-2021-2','2021-08-08','عباد','كريم','محمد','1983-07-08','الزبوجة','متوسط','الطواجين الزبوجة - الشلف','ذكر','حر','A01065766','2020-11-09','2030-11-08','بيومتري','B,D,C1,C'),('00005-2021-2','2021-08-05','بوحريرة','مناد','محمد','1979-04-02','الصبحة','ابتدائي','الصوالة الصبحة- الشلف','ذكر','متعاقد','02/1202/2019','2019-10-29','2024-04-29','القديم','B,C1,C2'),('00005-2021-2','2021-08-08','بن براهيم','براهيم','علي','1976-12-26','الزبوجة','متوسط','سنفيتة الزبوجة - الشلف','ذكر','حر','02/4878/2015','2015-12-30','2020-12-29','القديم','B,C1,C2'),('00006-2019-2','2019-01-13','دحلب','أحمد','هني','1978-01-13','الشطية','ابتدائي','بقعة الحضر الشطية - الشلف','ذكر','متعاقد','02/0276/2018','2018-01-21','2023-01-20','القديم','B,C1,C2'),('00006-2021-2','2021-08-03','بن دريس','عبد الحميد','عبد القادر','1989-04-09','بوقادير','ابتدائي','بقعة أولاد الطاهر  بوقادير- الشلف','ذكر','متعاقد','02/899/2018','2018-05-28','2025-05-28','القديم','B,C1'),('00007-2020-2','2019-01-13','قويدري','أحمد','محمد','1966-06-12','الشلف','ابتدائي',' رقم 29 الشطية K2 المدينة الجديدة عمارة ','ذكر','متعاقد','02/10119/2015','2015-06-21','2021-08-10','القديم','B,C1,C2'),('00007-2021-2','2021-08-05','بن علو','يوسف','خليفة','1979-12-30','الصبحة','ابتدائي','حي محمد خروبي الصبحة- الشلف','ذكر','حر','02/716/2018','2018-05-06','2023-06-04','القديم','B,C1,C2'),('00008-2019-02-2021-2','2019-01-13','مايسة','صفيان','معمر','1981-07-16','الشلف','متوسط','بقعة الشرفة - الشلف','ذكر','متعاقد','02/1261/2017','2017-02-15','2022-02-14','القديم','B,C1,C2,D,E'),('00008-2021-2','2021-08-08','حلو','جلول','أحمد','1966-07-07','أولاد بن عبد القادر','ابتدائي','بقعة العوايس بلدية الحجاج -الشلف','ذكر','حر','02/040/2017','2017-01-30','2022-01-29','القديم','B,C1,C2,E'),('00009-2018-2','2021-08-09','حليمة ريهوم','حميد','أمحمد','1976-02-06','أولاد فارس','متوسط','القطايبية أولاد فارس - الشلف','ذكر','حر','02/146/2016','2016-11-06','2021-10-26','القديم','B,C1,C2'),('00009-2020-2','2019-01-13','بوعريشة','ميلود','المهدي','1974-03-22','أولاد بن عبد القادر','ابتدائي','حي العقيد جيلالي بونعامة أولاد بن عبد القادر ','ذكر','متعاقد','02/528/2016','2016-06-06','2021-06-05','القديم','B,C1,C2'),('00010-2019-2','2021-08-09','بوفريوة','علي','معمر','1984-03-17','الشلف','متوسط','المدينة الجديدة د 03 رقم 44 الشطية - الشلف','ذكر','حر','02/1360/2018','2018-05-28','2023-04-02','القديم','B,C1,C2,E'),('00010-2020-2','2020-01-13','حمايد','جمال','أحمد','1977-04-16','أولاد فارس','متوسط','بقعة الزمالة أولاد فارس - الشلف','ذكر','حر','02/623/2017','2017-05-16','2022-04-16','القديم','B,C1,C2,D,E'),('00010-2021-2','2021-08-05','يخلف','فاروق','أحمد','1980-09-19','تاجنة','ابتدائي','تاجنة- أبو الحسن- الشلف','ذكر','حر','02/408/2018','2018-05-29','2023-09-18','القديم','B,C1,C2,E'),('00011-2020-2','2021-08-10','دبحان','نصر الدين','محمد','1986-04-19','الجزائر','متوسط','ط.الكريمية واد الفضة - الشلف','ذكر','حر','02/1321/2019','2019-09-11','2024-09-10','القديم','B,C1,C2'),('00011-2021-2','2021-08-05','طهاري','عبد القادر','عابد','1969-08-27','الشلف','ابتدائي','حي عزون أم الدروع- الشلف','ذكر','حر','02/6715/2016','2016-10-05','2021-10-04','القديم','B,C1,C2'),('00012-2019-2','2021-08-09','يعقوبي','زيان','محمد','1985-02-09','الشطية','متوسط','منطقة النشاطات الشطية - الشلف','ذكر','حر','02/285/2016','2016-01-25','2021-01-24','القديم','B,C1,C2'),('00012-2020-2-2021-2','2021-08-10','بن حليمة','سماعيل','صالح','1984-10-16','أولاد فارس','متوسط','أولاد هني أولاد فارس - الشلف','ذكر','حر','02/1103/2019','2019-12-02','2024-12-01','القديم','B,C1,C2,E'),('00012-2021-2','2021-08-08','عدو','محمد','محمد','1955-12-31','المصدق','ابتدائي','بقعة البرازنة المصدق - الشلف','ذكر','حر','02/157/2017','2017-10-19','2022-01-18','القديم','B,C1,C2,D,E'),('00013-2019-2','2021-08-09','وجيد','محمد','سحنون','1981-08-23','بوقادير','متوسط','بقعة الشرفة - الشلف','ذكر','متعاقد','02/28540/15','2015-11-26','2020-11-25','القديم','D,E'),('00013-2020-2','2021-08-10','علام','حسين','محمد','1982-09-15','الشلف','متوسط','م 09 بناية الشطية - الشلف','ذكر','حر','02/11192/2015','2015-10-04','2020-10-03','القديم','B,C1,C2,D,E'),('00013-2021-2','2021-08-02','غريون','فتحي','محمد','1987-03-27','الشلف','متوسط','بقعة الخلايلية سنجاس - الشلف','ذكر','حر','02/612/2019','2019-08-19','2024-08-18','القديم','B,C1'),('00014-2021-2','2021-08-05','بروج','محمد','الحاج','1982-11-06','بوزغاية','متوسط','حي الصامت رقم 49 بوزغاية - الشلف','ذكر','حر','02/441/2018','2018-07-01','2030-06-30','القديم','B,C1,C2,E'),('00014-2021-2','2021-08-05','بدراني','محمد','الحاج','1976-11-27','أولاد بن عبد القادر','ابتدائي','حي الشرفة رقم 149 الشلف','ذكر','حر','02/5647/2017','2017-07-26','2022-07-25','القديم','B,C1,C2,E'),('00015-2021-2','2021-08-09','بويكني','علي','عبد القادر','1966-05-18','سنجاس / الشلف','ابتدائي','بقعة العبايب الحجاج - الشلف','ذكر','متعاقد','02/442/2016','2016-05-11','2021-05-10','القديم','B,C1,C2,E'),('00016-2019-2','2021-08-09','بويكني','أحمد','عبد القادر','1981-02-08','الشلف','متوسط','بقعة العبايب الحجاج - الشلف','ذكر','حر','02/023/2018','2018-01-22','2023-01-21','القديم','B,C1,C2,E'),('00016-2020-2','2021-08-05','طهاري','إسماعيل','أحمد','1986-04-19','الشلف','متوسط','بقة الأرض البيضاء الشطية- الشلف','ذكر','حر','02/1235/2017','2017-05-22','2022-05-21','القديم','B,C1,C2'),('00016-2021-2','2021-08-09','عبادة','محمد','عبد القادر','1966-08-28','بوزغاية','ابتدائي','القرية الفلاحية رقم 31  بوزغاية','ذكر','متعاقد','02/031/2020','2020-01-13','2025-01-12','القديم','B,C1,C2,E'),('00017-2021-2','2021-08-05','بوناقة','حسين','محمد','1988-12-31','الصبحة','ابتدائي','أولاد حمادي - الصبحة- الشلف','ذكر','حر','02/1362/2017','2017-10-09','2022-10-08','القديم','B,C1'),('00017-2021-2','2021-08-05','مرسلي','عبد الله','حسين','1979-04-08','سيدي عكاشة','ابتدائي','محطة نقل المسافرين سيدي عكاشة - الشلف','ذكر','حر','02/447/2018','2018-06-03','2023-04-07','القديم','B,C1,C2,D,E'),('00018-2019-2','2021-08-09','بويكني',' نور الدين','الجيلالي','1990-06-17','الحجاج/ الشلف','متوسط','بقعة العبايب الحجاج - الشلف','ذكر','متعاقد','02/162/2016','2016-02-17','2021-02-16','القديم','B,C1,E'),('00018-2021-2','2021-08-02','نورين معمر','هواري','عبد القادر','1982-10-13','الهرانفة','ابتدائي','الروافعية بلدية الهرانفة -الشلف','ذكر','حر','02/80/2020','2020-02-11','2025-02-09','القديم','B,C1,C2'),('00018-2021-2','2021-08-09','بن سعدية','عبد القادر','محمد','1985-04-23','أولاد بن عبد القادر','متوسط','حي القرية الفلاحية واد سلي - الشلف','ذكر','حر','02/1040/2015','2015-02-05','2018-06-22','القديم','B,C1,C2'),('00019-2021-2','2021-08-04','لزاز','العيد','محمد','1981-02-02','بوقادير الشلف','ابتدائي','كابير أولاد فارس الشلف','ذكر','حر','02/288/2019','2019-03-17','2024-03-14','القديم','B,C1,C2'),('00019-2021-2','2021-08-05','فاضل','فتحي','محمد','1974-04-18','معسكر','متوسط','حي النصر م 11 رقم 92 - الشلف','ذكر','حر','02/12589/2015','2015-09-06','2020-09-05','القديم','B,C1,C2,E'),('00020-2021-2','2021-08-02','فوقة','محمد','معمر','1981-12-31','أبو الحسن','ابتدائي','حي المعلمين-أبو الحسن- الشلف','ذكر','حر','02/700/2018','2018-11-06','2024-06-24','القديم','B,C1,C2,D,E'),('00020-2021-2','2021-08-05','بناط','عبد القادر','محمد','1985-01-13','أبو الحسن','متوسط','حي الإخوة عزون أبو الحسن - الشلف','ذكر','حر','02/656/2016','2016-05-09','2021-01-12','القديم','B,C1,C2,D'),('00021-2021-2','2021-08-02','مروش','عبد القادر','جلول','1983-10-17','أولاد بن عبد القادر','ابتدائي','بقعة شبكة الأبطال أ.بن عبد القادر','ذكر','حر','02/438/2019','2019-09-11','2024-09-10','القديم','B,C1,C2,D,E'),('00021-2021-2','2021-08-08','بوزكري','طيب','محمد','1978-11-06','الزبوجة','ابتدائي','حي النهضة رقم 85 الزبوجة -الشلف','ذكر','حر','02/451/2018','2018-06-18','2023-03-19','القديم','B,C1,C2'),('00023-2021-2','2021-08-02','ماموني','بوجمعة','أحمد','1988-03-20','بني حواء','ابتدائي','بني حواء حي الشهيد عبدلي محمد','ذكر','حر','02/086/2021','2021-02-21','2026-02-20','القديم','B,C1'),('00025-2021-2','2021-08-05','لكحل','جيلالي','أمحمد','1972-10-05','الشلف','ثانوي','م 12 رقم 151 الشطية- الشلف','ذكر','حر','02/0393/2018','2018-01-30','2023-01-29','القديم','B,C1,C2'),('00026-2021-2','2021-08-03','زياني','محمد','محمد','1972-01-16','الشلف','ابتدائي','منطقة د3 رقم 919 الشطية الشلف','ذكر','حر','02/632/2019','2019-03-25','2024-03-24','القديم','B,C1,C2,E'),('00026-2021-2','2021-08-09','دحماني','خليفة','محمد','1976-11-06','الشلف','متوسط','أولاد سالم الصبحة - الشلف','ذكر','حر','02/847/2018','2018-07-08','2023-07-07','القديم','B,C1,C2,D,E'),('00026-2021-2','2021-08-09','حمايدي','حميد','موسى','1971-01-29','خميس مليانة','متوسط','حي النصر م 10 رقم 145 ','ذكر','حر','44/05/2091/16','2016-05-24','2021-08-23','القديم','B,C1,C2,E'),('00027-2021-2','2021-08-02','مخلوف','فيصل','محمد','1984-03-07','عين مران','متوسط','حي الشهيد زيان معمر محمد السهايلية عين مران','ذكر','حر','02/826/2020','2020-08-05','2025-08-03','القديم','B,C1,C2'),('00027-2021-2','2021-08-04','شبلي','جيلالي','محمد','1966-04-16','الشلف','ابتدائي','م أ 01 رقم 107 الشطية الشلف','ذكر','حر','02/11863/2015','2015-12-06','2020-12-05','القديم','B,C1,C2'),('00027-2021-2','2021-08-08','بوهنة','زيان','غلام الله','1985-03-11','الصبحة','متوسط','حي محمد عبوش الصبحة - الشلف','ذكر','حر','02/1767/2016','2016-04-25','2021-03-08','القديم','B,C1,C2,E'),('00028-2021-2','2021-08-02','قلال','بن عودة','محمد','1993-01-29','بني راشد','متوسط','بني راشد','ذكر','حر','A00114019','2019-07-19','2029-07-18','بيومتري','B,C'),('00028-2021-2','2021-08-08','بن واضح','العربي','أمحمد','1986-10-31','الصبحة','متوسط','بقعة الخلايف بوقادير - الشلف','ذكر','حر','02/1123/2018','2018-07-03','2023-07-04','القديم','B,C1'),('00028-2021-2','2021-08-09','بروجي','حسين','عبد القادر','1988-05-31','الشلف','متوسط','بقعة الحمام أم الدروع - الشلف','ذكر','حر','02/799/2018','2018-11-25','2023-10-24','القديم','B,C1'),('00029-2021-2','2021-08-01','وشان','سليمان','العربي','1979-09-20','الشطية','ابتدائي','بقعة الأرض البيضاء الشطية- الشلف','ذكر','حر','02/2111/2019','2019-10-29','2024-10-28','القديم','B,C1,C2'),('00030-2021-2','2021-08-01','عمران','رضوان','أحمد','1993-04-19','الشطية','متوسط','منطقة 11 رقم 150 الشطية- الشلف','ذكر','حر','02/2954/2018','2018-12-17','2023-09-04','القديم','B,C1'),('00030-2021-2','2021-08-03','زناقي','عبد القادر','محمد','1983-09-06','الشلف','ابتدائي','حي 130 مسكن رقم 23 الشلف','ذكر','حر','02/1377/2019','2019-03-07','2024-03-06','القديم','B,C1,C2,E'),('00030-2021-2','2021-08-08','عداتي','يوسف','محمد','1981-08-31','الهرانفة','متوسط','بقعة الأرض البيضاء الشطية - الشلف','ذكر','حر','02/1091/2015','2015-02-02','2020-02-01','القديم','B,C1,C2'),('00031-2021-2','2021-08-02','بسبع','عبد القادر','محمد','1986-11-08','الهرانفة','ابتدائي','حي الشهيد بورياش عبد القادر عين مران','ذكر','حر','02/64/2020','2020-01-20','2025-01-16','القديم','B,C1,C2,E'),('00032-2021-2','2021-08-05','عبدي','نبيل','جيلالي','1990-06-17','أولاد فارس','متوسط','حي 250 مسكن 155 أولاد فارس','ذكر','متعاقد','02/892/2018','2018-07-24','2023-07-23','القديم','B,C1'),('00032-2021-2','2021-08-08','دحماني','خليفة','محمد','1985-01-22','الصبحة','متوسط','أولاد سالم الصبحة - الشلف','ذكر','حر','02/023/2018','2018-01-07','2023-01-03','القديم','B,C1,C2,D'),('00033-2021-2','2021-08-05','بوشريط','معمر','محمد','1964-06-28','الشلف','ابتدائي','  رقم رقم 30 -الشلفXرحي السلام شارع ','ذكر','حر','02/3965/2018','2018-06-04','2023-06-04','القديم','B,C1,C2,E'),('00033-2021-2','2021-08-08','عامر','عبد القادر','محمد','1985-02-02','الشطية','متوسط','م أ 01 رقم 85 الشطية - الشلف','ذكر','متعاقد','02/1068/2017','2017-04-27','2022-02-04','القديم','B,C1,C2,E'),('00033-2021-2','2021-08-09','دحماني','جيلالي','محمد','1981-01-14','الصبحة / الشلف','متوسط','أولاد سالم الصبحة - الشلف','ذكر','حر','02/879/2016','2016-02-28','2021-02-27','القديم','B,C1,C2,D'),('00033-2021-2','2021-08-09','رحموني','محمد','محمد','1980-07-26','الشلف','متوسط','بقعة الأرض البيضاء الشطية - الشلف','ذكر','حر','02/9179/2015','2015-04-05','2020-04-04','القديم','B,C1,C2'),('00034-2021-2','2021-08-04','عومر','عابد','تواتي','1982-02-15','الصبحة الشلف','ابتدائي','البخايتية الصبحة الشلف','ذكر','متعاقد','02/300/2020','2020-04-22','2025-04-20','القديم','B,C1,C2,E'),('00034-2021-2','2021-08-05','العثامنية','عبد الغني','عبد القادر','1985-06-08','سنجاس','متوسط','حي بني ودرن سنجاس - الشلف','ذكر','حر','02/198/2017','2017-02-15','2021-11-21','القديم','B,C1,D'),('00034-2021-2','2021-08-08','جيلالي عياد','محمد','محمد','1984-10-02','أولاد فارس','متوسط','القطايبية أولاد فارس - الشلف','ذكر','حر','02/11431/2015','2015-11-04','2020-11-03','القديم','B,C1,C2'),('00035-2021-2','2021-08-05','بشير','حسان','محمد','1979-07-25','أبو الحسن','ابتدائي','حي سيدي محمد أبو الحسن - الشلف','ذكر','حر','02/470/2018','2018-07-22','2021-08-05','القديم','B,C1,C2'),('00037-2021-2','2021-08-02','غلام','عبد القادر','محمد','1989-11-05','أولاد فارس','متوسط','أولاد فارس','ذكر','حر','00009441','2021-03-14','2021-10-14','بيومتري','B,C,CE'),('00037-2021-2','2021-08-08','بوطيبة','نور الدين','ميلود','1979-05-09','بوقادير','متوسط','حي الحرية واد سلي - الشلف','ذكر','حر','02/238/2021','2021-02-23','2026-02-21','القديم','B,C1,C2,D,E'),('00037-2021-2','2021-08-08','عالم','إبراهيم','محمد','1982-08-02','الهرانفة','متوسط','أولاد الجيلالي الصبحة - الشلف','ذكر','حر','02/575/2018','2018-05-15','2023-03-20','القديم','B,C1,C2,E'),('00037-2021-2','2021-08-09','عامر','خليفة','عبد القادر','1972-12-31','الهرانفة / الشلف','ابتدائي','أولاد الجيلالي الصبحة - الشلف','ذكر','حر','02/1168/2017','2017-08-27','2022-08-26','القديم','B,C1,C2,D,E'),('00038-2021-2','2021-08-03','وشان','رشيد','عبد القادر','1977-01-14','الشلف','ابتدائي','حي الشرفة أولاد فارس- الشلف','ذكر','حر','02/391/2020','2020-05-04','2025-05-03','القديم','B,C1,C2'),('00038-2021-2','2021-08-08','سناد','عبد القادر','محمد','1979-03-23','الظهرة','متوسط','بلدية الظهرة - الشلف','ذكر','حر','02/1254/2014','2014-11-16','2019-09-14','القديم','B,C1,C2'),('00038-2021-2','2021-08-08','قلمام','محمد','طاهر','1977-08-27','أولاد بن عبد القادر','متوسط','حي الحرية واد سلي - الشلف','ذكر','حر','02/1587/2017','2017-04-18','2022-04-14','القديم','B,C1,C2,D'),('00039-2021-2','2021-08-08','بوطيبة','رشيد','ميلود','1980-12-15','بوقادير','متوسط','حي الحرية واد سلي - الشلف','ذكر','حر','02/1212/2016','2016-03-22','2024-03-22','القديم','B,D'),('00040-2021-2','2021-08-02','جعفر موسى','عبد الله','أحمد','1973-07-12','سنجاس','ابتدائي','أولاد بن عبد القادر الشلف','ذكر','حر','02/323/2018','2018-04-30','2028-04-29','القديم','B,D'),('00041-2021-2','2021-08-07','شريف','محمد','عبد القادر','1976-02-16','تاجنة','ابتدائي','تاجنة أبو الحسن الشلف','ذكر','حر','02/530/2019','2019-09-15','2024-02-15','القديم','B,C1,C2,E'),('00041-2021-2','2021-08-09','عامر','شارف','عبد القادر','1966-12-04','الهرانفة/ الشلف','ابتدائي','أولاد الجيلالي الصبحة - الشلف','ذكر','حر','02/2431/2016','2016-06-07','2021-06-06','القديم','B,C1,C2,D,E'),('00042-2021-2','2021-08-02','شريف','عبد الحق','عبد القادر','1991-03-04','تاجنة','ابتدائي','تاجنة أبو الحسن الشلف','ذكر','حر','02/628/2020','2020-10-05','2025-03-03','القديم','B,C2'),('00042-2021-2','2021-08-09','بن علي رقيق','زهير','محمد','1982-02-09','بوقادير','ابتدائي','حي الدوايدية بوقادير - الشلف','ذكر','حر','02/381/2017','2017-02-21','2022-02-13','القديم','B,C1,C2'),('00043-2021-2','2021-08-02','حمايد','محمد','دلة','1984-08-12','الشلف','ابتدائي','الزمالة أولاد فارس الشلف','ذكر','حر','02/361/2020','2020-04-21','2025-04-18','القديم','B,C1,C2'),('00043-2021-2','2021-08-02','مجاجي','محمد','أمحمد','1972-09-11','بوقادير','متوسط','حي بوكعبن بوقادير- الشلف','ذكر','متعاقد','02/725/2019','2019-05-29','2024-05-27','القديم','B,C1,C2'),('00043-2021-2','2021-08-05','مزار','أحمد','محمد','1985-01-07','الكريمية','متوسط','سيدي مدور الكريمية - الشلف','ذكر','حر','R0181365','2021-03-22','2021-08-22','بيومتري','B,C1'),('00044-2021-2','2021-08-02','عبوش','خليفة','أحمد','1977-04-11','الصبحة','ابتدائي','أولاد الجيلالي الصبحة- الشلف','ذكر','حر','02/316/2019','2019-03-07','2024-03-06','القديم','B,C1,E'),('00045-2021-2','2021-08-04','مباركي','كريم','عبد القادر','1979-10-20','الشلف','ابتدائي','المنطقة 12 رقم 303 الشطية الشلف','ذكر','حر','02/0185/2021','2021-03-09','2026-03-08','القديم','B,C1,C2,D,E'),('00046-2021-2','2021-08-08','كرفي قطيب','حكيم','بوعبد الله','1981-04-12','أولاد فارس','متوسط','القطايبية أولاد فارس - الشلف','ذكر','حر','02/441/2020','2020-05-28','2025-05-05','القديم','B,D'),('00047-2020-2','2021-08-03','مسعد قوشيش','العربي','محمد','1966-09-02','أولاد فارس الشلف ','ابتدائي','أولاد ابراهيم أولاد فارس الشلف ','ذكر','حر','02/1496/2017','2021-11-27','2022-10-19','القديم','B,C1,C2'),('00047-2021-2','2021-08-08','بنونة','عبد القادر','أحمد','1983-08-10','المرسى','متوسط','حي المجاهد بلعباس أحمد بلدية المرسى -الشلف','ذكر','حر','02/98/2021','2021-03-16','2026-03-15','القديم','B,C1,C2'),('00048-2021-2','2021-08-03','قلوش','سماعيل','معمر','1973-03-05','أولاد فارس الشلف','ابتدائي','السعايدية أولاد فارس الشلف','ذكر','حر','02/263/2019','2019-03-07','2024-03-03','القديم','B,C1,C2'),('00048-2021-2','2021-08-09','بويكني','العيد','محمد','1973-01-13','الشلف','متوسط','بقعة العبايب الحجاج - الشلف','ذكر','حر','02/951/12363767','2011-09-12','2015-09-12','القديم','B,C1,E'),('00048-2021-283','2021-08-14','حمودي','معمر','محمد','1979-03-15','الشطية','ابتدائي','بقعة الشطية','ذكر','حر','02/3702/2015','2015-02-10',NULL,'القديم','B,C1,C2'),('00049-2021-2','2021-08-08','مقروس','سعيد','عبد القادر','1975-07-29','أولاد فارس','متوسط','القطايبية أولاد فارس - الشلف','ذكر','حر','02/418/2019','2019-04-22','2024-01-19','القديم','B,C1,D,E'),('00050-2021-2','2021-08-01','دريزي','محمد','محمد','1987-03-24','الهرانفة','ابتدائي','أولاد فارس','ذكر','حر','00001740','2021-02-08','2021-10-08','القديم','B,C1'),('00050-2021-2','2021-08-04','جبور','علي','عبد القادر','1979-01-29','أولاد فارس','ابتدائي','كابير أولاد فارس الشلف','ذكر','حر','02/1453/2017','2017-11-19','2022-01-16','القديم','B,C1,C2'),('00050-2021-2','2021-08-09','عامر','عبد الحق','الشارف','1993-04-22','أولاد فارس','متوسط','حي 280 مسكن أولاد فارس - الشلف','ذكر','حر','02/1448/2018','2018-12-13','2023-09-22','القديم','B,C2'),('00051-2021-2','2021-08-04','جضري','سليمان','معمر','1977-04-09','أولاد فارس','ابتدائي','المركز أولاد فارس الشلف','ذكر','حر','02/118/2016','2016-10-26','2021-10-26','القديم','B,C1,C2'),('00051-2021-2','2021-08-08','ناجي','الشارف','لخضر','1975-06-12','الهرانفة','ابتدائي',' أولاد الجيلالي الصبحة -الشلف','ذكر','حر','02/168/2018','2018-02-05','2023-02-04','القديم','B,C1,C2'),('00052-2021-2','2021-08-01','حميدي بوجلطية','أحمد','محمد','1982-10-30','الشلف','متوسط','م 02 رقم 90 الشطية - الشلف','ذكر','حر','02/9449/2015','2015-04-19','2022-04-21','بيومتري','B,C1'),('00052-2021-2','2021-08-08','شوير','عبد القادر','ميلود','1973-08-26','الشلف','ابتدائي','م 12 رقم 01 الشطية - الشلف','ذكر','متعاقد','02/0163/2018','2018-01-24','2023-01-23','القديم','B,C1,C2,E'),('00053-2021-2','2021-08-03','بوهادي','علي','محمد','1983-12-28','الشلف','ابتدائي','بقعة الرملية الشلف','ذكر','حر','02/7362/2018','2018-10-30','2023-10-29','القديم','B,C1'),('00053-2021-2','2021-08-08','طهراوي','مراد','عبد القادر','1982-08-29','أولاد فارس','متوسط','السعايدية أولاد فارس - الشلف','ذكر','حر','02/612/2017','2017-05-14','2023-03-23','القديم','B,C1,C2'),('00053-2021-2','2021-08-08','بن هني','حليم','محمد','1978-12-24','الشلف','متوسط','حي الشقة رقم02 الشلف','ذكر','حر','A01213764','2021-01-01','2030-12-31','بيومتري','B,C1,C'),('00054-2021-2','2021-08-07','بن زناقي','نور الدين','أحمد ','1979-11-15','الشلف','متوسط','سنجاس مركز الشلف','ذكر','حر','02/789/2020','2020-11-19','2025-11-18','القديم','B,C1,C2'),('00056-2021-2','2021-08-01','مواكني','أحمد','محمد','1983-12-31','بوزغاية','ابتدائي','حي عمار غلام رقم 199','ذكر','حر','209900051002890003','2021-05-09','2026-08-01','بيومتري','B,C,BE,CE'),('00056-2021-2','2021-08-09','بن عودة','موراد','عبد القادر','1981-04-17','الشلف','متوسط','حي عمارة غلام رقم 54 بوزغاية - الشلف','ذكر','حر','02/5662/2017','2017-03-07','2021-03-09','القديم','B,C1,C2,E'),('00057-2021-2','2021-08-02','دحمون','محمد','معمر','1953-06-03','تاجنة','ابتدائي','تاجنة','ذكر','حر','02/430/2018','2018-05-31','2023-06-02','القديم','B,C1,C2,E'),('00058-2021-2','2021-08-02','داج','بن عودة','حاج','1958-12-16','أولاد فارس','ابتدائي','حي كابير أولاد فارس- الشلف','ذكر','حر','02/754/2019','2021-08-04','2024-08-04','القديم','B,C1,C2,E'),('00059-2021-2','2021-08-04','فرحاوي','سليمان','جيلالي','1985-01-21','تاجنة','ابتدائي','عجاب تاجنة الشلف','ذكر','حر','02/571/2020','2020-09-28','2025-01-20','القديم','B,C1,C2'),('00060-2021-2','2021-08-01','ضربان','رشيد','محمد','1988-04-24','الظهرة','ابتدائي','الهناشرية بلدية الظهرة-الشلف','ذكر','حر','02/0317/2019','2019-07-29','2024-01-28','القديم','B,C1'),('00061-2021-2','2021-08-04','معايزية','محمد','محمد','1976-09-03','الشلف','ابتدائي','بقعة المعايزية أم الدروع - الشلف','ذكر','حر','02/379/2018','2018-05-27','2023-05-20','القديم','B,C1,C2,E'),('00065-2021-2','2021-08-07','حو حامدي','معمر','معمر','1981-08-16','الشلف','ابتدائي','القرية الفلاحية الشطية ','ذكر','حر','02/2113/2020','2020-11-02','2025-11-01','القديم','B,C1,C2'),('00067-2021-2','2021-08-03','قوجيل','محمد','عبد القادر','1963-03-09','الزبوجة','ابتدائي','بقعة الأرض البيضاء الشطية- الشلف','ذكر','حر','02/1109/2017','2021-05-07','2022-05-06','القديم','B,C1,C2'),('00068-2021-2','2021-08-04','شرار','نبيل','معمر','1997-01-12','الشطية الشلف','ابتدائي','بقعة الشطية الشلف','ذكر','حر','02/2885/2018','2018-12-09','2023-12-08','القديم','B,C1'),('00070-2021-2','2021-08-08','بخوش','نجيب','محمد','1984-10-25','عين ولمان','متوسط','حي بن سونة عمارة ن رقم 130 الشلف','ذكر','حر','R01674784','2021-03-31','2021-08-31','بيومتري','B,C1,BE,C1E'),('00071-2021-2','2021-08-07','بلحاج بن يحي','عبد الرزاق','عيسى','1969-04-01','الصبحة','ابتدائي','أولاد فطي الصبحة الشلف','ذكر','حر','02/771/2020','2020-09-07','2025-09-06','القديم','B,C1,C2,E'),('00073-2021-2','2021-08-07','علاوي','عبد القادر','خليفة','1970-02-05','بوقادير','ابتدائي','الوساسرة الصبحة الشلف','ذكر','حر','02/403/2017','2017-03-23','2022-03-21','القديم','B,C1,C2,E'),('00074-2021-2','2021-08-08','بلمختار','يوسف','محمد','1983-01-25','الصبحة','متوسط','العمالسة الصبحة- الشلف','ذكر','حر','02/855/2018','2018-07-09','2023-07-08','القديم','B,C1,C2'),('00075-2021-2','2021-08-02','خروبي','عمر','عبد القادر','1977-11-25','الصبحة','ابتدائي','الحنيشات الصبحة -الشلف','ذكر','حر','02/953/2019','2019-08-27','2024-08-26','القديم','B,C1,C2,D,E'),('00076-2021-2','2021-08-04','عكاكزة','صالح','أحمد','1977-06-25','سنجاس','ابتدائي','منطقة س 08 رقم 343 الشطية الشلف','ذكر','حر','02/156/2019','2019-01-23','2024-01-22','القديم','B,C1,C2'),('00077-2019-2','2021-08-09','علي حيمود','عمر','علي','1979-08-19','العطاف','متوسط','حرشون مركز - الشلف','ذكر','حر','02/13/2016','2016-01-06','2020-01-21','القديم','B,C1'),('00077-2021-2','2021-08-01','عياش','جيلالي','خليفة','1964-10-07','أولاد فارس','ابتدائي','كابير أولاد فارس','ذكر','حر','02/1129/2018','2018-09-19','2028-09-17','القديم','B,C1,C2,D,E'),('00078-2021-2','2021-08-04','أملال','سليم','جلول','1978-03-29','الشلف','ابتدائي','حي الفتح واد سلي الشلف','ذكر','حر','02/1248/2019','2019-09-22','2024-09-21','القديم','B,C1,C2,D,E'),('00079-2019-2','2021-08-09','عامر','محمد','أمحمد','1971-03-17','سنجاس','متوسط','بقعة أولاد محمد الشلف','ذكر','حر','02/16124/15','2015-09-20','2020-09-19','القديم','B,C1,C2'),('00079-2021-2','2021-08-04','عيسى بختاش','بن عودة','قدور','1991-01-06','سنجاس شلف','ابتدائي','بقعة سيدي عبد القادر الشطية الشلف','ذكر','حر','02/1617/2017','2017-07-12','2022-01-01','القديم','B,C1,D'),('00080-2019-2-2021-2','2019-02-11','قاصب','فاتح','دحمان','1985-07-10','واد الفضة','متوسط','حي بونعامة حرشون - الشلف','ذكر','حر','02/556/2018','2018-09-19','2023-07-08','القديم','B,C1,C2,D'),('00080-2021-2','2021-08-01','بن شاعة','محمد','الحسين','1991-10-04','تنس','ابتدائي','حي عياشي محمد-أغبال-تلعصة','ذكر','حر','02/163/2018','2018-05-23','2023-10-03','القديم','B,C1'),('00081-2019-2-2021-2','2019-02-11','مسار','يوسف','محمد','1981-10-17','المرسى','ابتدائي','الهضبة رقم 26 الزبوجة - الشلف','ذكر','حر','02/354/2016','2016-02-24','2021-02-23','القديم','B,C1,C2,E'),('00081-2021-2','2021-08-02','بن سونة','عثمان','عبد القادر','1964-01-30','أولاد فارس','ابتدائي','المدينة الأبيض مجاجة','ذكر','حر','02/68/2021','2021-02-04','2026-02-03','القديم','B,C1,C2,D,E'),('00082-2021-2','2021-08-08','علاوي','علي','محمد','1975-11-09','سنجاس','ابتدائي','بقعة العبايب الحجاج- الشلف','ذكر','حر','02/230/2020','2020-11-09','2025-11-03','القديم','B,C1,C2'),('00082-2021-2','2021-08-09','خليلي','فريد','محمد','1980-02-11','الزبوجة','ابتدائي','حي الهضبة الزبوجة - الشلف','ذكر','حر','02/2843/2015','2015-02-17','2020-02-16','القديم','B,C1,C2,D,E'),('00083-2021-2','2021-08-08','بغاش','أسامة','أحمد','1993-12-13','الشطية','متوسط','منطقة النشاطات الشطية - الشلف','ذكر','حر','02/2218/2020','2020-11-18','2025-11-17','القديم','B,C2'),('00084-2021-2','2021-08-01','بوجدية','محمد','لعربي','1979-01-06','تاجنة','ابتدائي','تاجنة -أبو الحسن','ذكر','متعاقد','02/120/2017','2017-02-12','2022-01-06','القديم','B,C1,C2,E'),('00085-2021-2','2021-08-01','معراف','مراد','بن عبد الله','1987-04-23','واد الفضة','متوسط','بقعة أولاد بواعلي أولاد عباس - الشلف','ذكر','حر','02/347/2017','2017-11-05','2022-11-04','القديم','B,C1,C2'),('00086-2021-2','2021-08-03','طاجين','مجيد','الحبيب','1985-02-07','بوقادير','ابتدائي','أولاد حمادي الصبحة الشلف','ذكر','حر','02/3994/2016','2016-10-18','2021-05-11','القديم','B,C1,C2'),('00087-2021-2','2021-08-04','نورة','محمد','معمر','1984-10-16','الزبوجة','ابتدائي','بقعة الفلاقية بنايرية الشلف','ذكر','حر','02/180/2020','2020-05-03','2025-05-02','القديم','B,C1,C2,E'),('00089-2021-2','2021-08-05','تاهمي','محمد حسيان','محمد','1974-09-27','الشلف','ابتدائي','م04 رقم 321 الشطية -الشلف','ذكر','حر','02/25897/2015','2015-11-17','2022-11-18','بيومتري','B,C1,C'),('00090-2021-2','2021-08-02','مقوري','عبد القادر','أحمد','1969-04-02','أولاد فارس الشلف ','ابتدائي','أولاد هني أولاد فارس الشلف','ذكر','حر','02/1116/2019','2019-12-04','2024-11-20','القديم','B,C1,C2'),('00091-2021-2','2021-08-03','شوال','سماعين','قدور','1957-01-31','بوزغاية','ابتدائي','القرية الفلاحية الشطية - الشلف','ذكر','حر','02/228/2020','2020-02-03','2025-02-02','القديم','B,C1,C2,D,E'),('00091-2021-2','2021-08-04','بوشكارة','الوافي','محجوب','1969-01-11','أولاد فارس الشلف','ابتدائي','م 05 رقم 188 الشطية الشلف ','ذكر','حر','02/712/2016','2021-08-29','2021-12-28','القديم','B,C1,C2,D,E'),('00093-2021-2','2021-08-04','مقران','خليفة','لحبيب','1985-02-15','الشطية الشلف','ابتدائي','بقعة الأرض البيضاء الشطية الشلف','ذكر','حر','02/2240/2020','2020-11-18','2025-11-17','القديم','B,C1,C2'),('00094-2021-2','2021-08-02','بوغاري','أحمد','بن عمارة','1977-07-08','الصبحة','ابتدائي','أولاد فطي الصبحة الشلف','ذكر','حر','02/453/2017','2017-04-02','2022-04-01','القديم','B,C1,C2,D'),('00094-2021-2','2021-08-09','معايزية','أبوبكر','جيلالي','1992-02-27','أم الدروع','متوسط','بقعة المعايزية أم الدروع - الشلف','ذكر','حر','02/616/2014','2014-09-25','2019-02-16','القديم','B,C1,C2'),('00097-2021-2','2021-08-08','كركوري','كمال','معمر','1990-12-10','الشلف','متوسط','القرية الفلاحية الشطية- الشلف','ذكر','حر','02/029/2017','2017-01-04','2023-01-20','القديم','B,C1,C2'),('00098-2021-2','2021-08-08','طهاري','كمال','عبد القادر','1988-09-03','الشطية','متوسط','بقعة الأرض البيضاء الشطية- الشلف','ذكر','حر','02/1078/2019','2019-06-10','2024-06-09','القديم','B,C1,C2'),('00099-2021-2','2021-08-03','رحال','عبد القادر','محمد','1977-03-20','الزبوجة','ابتدائي','حي الوئام عمارة 60 رقم 14 الزبوجة - الشلف','ذكر','حر','02/270/2020','2020-05-13','2025-05-10','القديم','B,C1'),('00100-2021-2','2021-08-04','بن مديوني','أحمد','طيب','1977-10-20','أولاد بن عبد القادر ','ابتدائي','حي عبد القادر بن باديس أولاد بن عبد القادر الشلف','ذكر','حر','02/252/2018','2018-03-27','2023-03-26','القديم','B,C1,C2,D'),('00101-2021-2','2021-08-03','لومي','أمحمد','طاهر','1949-04-20','بوزغاية الشلف','ابتدائي','حي الشقة رقم 10 الشلف','ذكر','حر','02/1701/2017','2017-03-12','2022-03-11','القديم','B,C1,C2,E'),('00102-2021-2','2021-08-05','سحنون','يونس عمر','محمد','1992-02-10','سنجاس','متوسط','حي صالحي رقم 07 سنجاس -الشلف','ذكر','حر','00003071','2021-04-21','2021-09-02','بيومتري','B,C1'),('00103-2021-2','2021-08-04','قريبي','رمضان','محمد','1968-12-12','شلف','ابتدائي','بقعة الارض البيضاء الشطية الشلف','ذكر','حر','02/2436/2020','2020-12-17','2025-12-16','القديم','B,C1,C2,E'),('00104-2021-2','2021-08-04','بوخاري','عبد الله','محمد','1975-11-01','الشلف','ابتدائي','شارع المرشح دحنان رقم 36 الشلف','ذكر','حر','02/7346/2017','2017-09-20','2022-09-19','القديم','B,C1,C2,D,E'),('00106-2021-2','2021-08-04','ناجي','أحمد','قدور','1969-01-05','الهرانفة الشلف','ابتدائي','أولاد الجيلالي الصبحة الشلف','ذكر','حر','02/559/2019','2019-05-05','2023-05-04','القديم','B,C1,C2,E'),('00107-2021-2','2021-08-07','عبد القادرقطاوي','عيسى','محمد','1975-03-11','عين مران','ابتدائي','حي الشهيد بوكري  محمد عين العزلة بلدية عين مران الشلف','ذكر','حر','02/112/2020','2020-01-26','2025-01-26','القديم','B,C1,C2,D,E'),('00107-2021-2','2021-08-08','حاج هني','أحمد','عبد القادر','1986-04-18','الشلف','متوسط','حي النصر م07 رقم 41 الشلف','ذكر','حر','02/24991/2015','2015-11-15','2021-08-08','القديم','B,C1,E'),('00108-2021-2','2021-08-04','بردي','مولود','محمد','1984-11-25','الشلف','ابتدائي','أولاد أحمد الأبيض مجاجة الشلف','ذكر','حر','02/99/2016','2016-12-06','2021-12-05','القديم','B,C1,C2'),('00109-2021-2','2021-08-02','خروب  بومداح','خليفة','معمر','1967-12-31','بوقادير','ابتدائي','أولاد الجيلالي  الصبحة الشلف','ذكر','حر','02/1617/2017','2017-12-05','2022-11-25','القديم','B,C1,C2'),('00111-2021-2','2021-08-01','منصور','إبراهيم','بوعبد الله','1978-08-02','الصبحة','ابتدائي','الزرايق الصبحة- الشلف','ذكر','حر','02/033/2020','2020-01-08','2024-12-29','القديم','B,C1,C2,D,E'),('00112-2021-2','2021-08-01','شرفي','رشيد','عبد القادر','1987-12-08','تلعصة','ابتدائي','حي بوعزة عبد الله-أغبال- تلعصة','ذكر','حر','02/284/2020','2020-12-16','2025-12-07','القديم','B,C1'),('00113-2021-2','2021-08-01','ماجي','أحمد','محمد','1971-09-14','بوزغاية','متوسط','حي بن باديس تلعصة أبو الحسن الشلف','ذكر','حر','02/108/2017','2017-04-18','2022-09-13','القديم','B,C1,C2,D,E'),('00118-2021-2','2021-08-04','هني','الحسن','عبد القادر','1983-03-01','أولاد فارس','ابتدائي','الحمايمية أولاد فارس الشلف','ذكر','متعاقد','02/396/2020','2020-05-06','2025-05-02','القديم','B,C1'),('00119-2021-2','2021-08-04','سوفلي','سعيد','قدور','1977-11-16','الشلف','ابتدائي','بقعة الشطية الشلف','ذكر','متعاقد','02/2884/2017','2017-11-08','2022-11-07','القديم','B,C1,C2'),('00120-2021-2','2021-08-04','بختي','عمر','العربي','1979-07-29','أولاد فارس','ابتدائي','القطايبية أولاد فارس الشلف','ذكر','متعاقد','02/1094/2017','2017-08-20','2022-07-26','القديم','B,C1,C2,E'),('00120-2021-2','2021-08-09','فردي','حميد','محمد','1986-08-03','أولاد فارس','متوسط','أولاد هني أولاد فارس - الشلف','ذكر','حر','02/6271/2015','2015-02-23','2020-02-22','القديم','B,C1,C2,E'),('00121-2021-2','2021-08-04','بوجدية','عبد الهادي','عبد القادر','1983-06-28','بوزغاية','ابتدائي','تاجنة أبو الحسن الشلف','ذكر','متعاقد','02/280/2020','2020-05-20','2025-06-27','القديم','B,C1,C2,D'),('00122-2021-2','2021-08-04','نعيمة','نبيل','محمد','1988-03-02','أولاد فارس','ابتدائي','بقعة الأرض البيضاء الشطية الشلف','ذكر','متعاقد','02/325/2020','2020-02-10','2025-02-09','القديم','B,C1'),('00123-2021-2','2021-08-04','تقار','بوعلام','محمد','1965-05-23','الشلف','ابتدائي','حي لالة عودة رقم 741 الشلف','ذكر','متعاقد','02/3234/2018','2018-05-09','2023-05-08','القديم','B,C1,C2,D,E'),('00124-2021-2','2021-08-04','بودادة','عبد القادر','محمد','1964-12-17','المرسى','ابتدائي','المدينة الجديدة عمارة ج 1 رقم 04 الشطية الشلف','ذكر','متعاقد','02/761/2016','2016-03-02','2021-03-01','القديم','B,C1,C2,E'),('00125-2021-2','2021-08-04','بشايري','محمد','خليفة','1971-12-31','الهرانفة','ابتدائي','حي 170 مسكن عمارة ب رقم 35 الشطية الشلف','ذكر','متعاقد','02/552/2020','2020-02-07','2025-02-26','القديم','B,C1,C2,D,E'),('00125-2021-2','2021-08-09','جعرير','عبد القادر','علي','1977-01-10','تلعصة','ابتدائي','حي الزيتون تلعصة - أبو الحسن - الشلف','ذكر','حر','02/04/2017','2017-01-03','2022-01-09','القديم','B,C1,C2,D,E'),('00127-2021-2','2021-08-04','بكرطاش','عبد الرحمان','محمد','1955-03-27','سنجاس','ابتدائي','م د 03 رقم 212 الشطية الشلف','ذكر','متعاقد','02/596/2017','2017-03-07','2023-03-06','القديم','B,C1,C2,D,E'),('00127-2021-2','2021-08-09','بغداوي','عبد الكريم','محمد','1991-10-05','الشطية','متوسط','بقعة الرملية - الشلف','ذكر','حر','02/348/2019','2019-01-21','2024-01-20','القديم','B,C2'),('00128-2019-2','2019-12-30','قاصب','عبد الجليل','دحمان','1993-05-22','الشلف','متوسط','حي بونعامة حرشون - الشلف','ذكر','حر','02/365/2016','2016-07-30','2024-04-10','القديم','B,C2'),('00128-2021-2','2021-08-04','شاهد','أمين','محمد','1978-10-24','الشلف','ابتدائي','م 05 رقم 04 الشطية الشلف','ذكر','متعاقد','02/129/2016','2016-10-01','2021-10-10','القديم','B,C1,C2,E'),('00129-2021-2','2021-08-04','غربي','معمر','بلحسن','1960-11-07','أولاد فارس','ابتدائي','المركز أولاد فارس الشلف','ذكر','متعاقد','02/947/2019','2019-10-20','2024-10-09','القديم','B,C1,C2,D,E'),('00131-2021-2','2021-08-01','طويل','عمر','مروان','1981-11-10','الحراش','ابتدائي','حي تيفلاس تنس','ذكر','حر','02/1230/2019','2019-11-10','2029-11-06','القديم','B,C1,C2,D,E'),('00132-2021-2','2021-08-07','عدة','محمد','أحمد','1968-01-23','الشلف','ابتدائي','بقعة الحمام أم الدروع الشلف ','ذكر','حر','02/17833/15','2015-10-10','2021-04-16','القديم','B,C1,C2,D,E'),('00134-2021-2','2021-08-03','عزايز','أمحمد','محمد','1977-09-20','سنجاس الشلف','ابتدائي','بقعة أولاد سي احمد سنجاس الشلف','ذكر','حر','02/399/2020','2020-07-22','2025-07-21','القديم','B,C1,C2'),('00141-2021-2','2021-08-04','قيطون','ابراهيم','محمد','1987-11-24','واد سلي','متوسط','حي الحرية واد سلي الشلف','ذكر','حر','02/674/2019','2019-05-08','2024-10-05','القديم','B,C1,E'),('00142-2021-2','2021-08-07','باهي عزوهم','أمحمد','طاهر','1978-08-25','الزبوجة','ابتدائي','حي البستان بلدية الزبوجة الشلف','ذكر','حر','02/242/2018','2018-03-26','2023-01-24','القديم','B,C1,C2'),('00143-2021-2','2021-08-02','قارة','محمد','أحمد','1968-08-12','أولاد فارس','ابتدائي','حوش الغابة أولاد فارس','ذكر','حر','02/169/2017','2017-01-31','2022-01-30','القديم','B,C1,C2,D'),('00147-2021-2','2021-08-04','عكاكزة','عبد القادر','محمد','1983-09-18','سنجاس','ابتدائي','بقعة سوفرة بلدية الحجاج الشلف','ذكر','متعاقد','02/095/2017','2017-03-14','2022-03-13','القديم','B,C1,C2'),('00149-2021-2','2021-08-07','بطوش','لخضر','عبد القادر ','1976-08-01','تاجنة','ابتدائي','سيدي زيان تاجنة الشلف','ذكر','متعاقد','02/623/2018','2018-08-13','2023-07-31','القديم','B,C1,C2,E'),('00155-2021-2','2021-08-07','مسعودي','معمر','يحي','1982-06-15','الزبوجة','ابتدائي','التوابرية الزبوجة الشلف','ذكر','حر','02/846/2016','2016-05-16','2021-05-15','القديم','B,C1,C2'),('00156-2021-2','2021-08-07','مسعودي','علي','محمد','1983-02-22','الزبوجة','ابتدائي','التوايرية رقم 70 بلدية الزبوجة  الشلف','ذكر','حر','02/248/2021','2021-04-12','2025-04-10','القديم','B,C1,C2'),('00159-2021-2','2021-08-02','خروب بومداح','أحمد','معمر','1983-02-20','الصبحة','ابتدائي','أولاد الجيلالي الصبحة الشلف','ذكر','حر','02/955/2020','2020-09-24','2025-09-08','القديم','B,C1,C2,E'),('00162-2021-2','2021-08-01','طالب','ميلود','محمد','1978-12-31','تاجنة','ابتدائي','تاجنة-أبو الحسن','ذكر','حر','02/569/2020','2020-09-28','2025-09-27','القديم','B,C1,C2,E'),('00163-2021-2','2021-08-01','مسعودي','عبد القادر','يحي','1969-12-11','الزبوجة','ابتدائي','حي البستان رقم 143الزبوجة- الشلف','ذكر','حر','02/363/2017','2017-05-03','2022-05-02','القديم','B,C1,C2,D,E'),('00164-2021-2','2021-08-07','رابح مزاري','محمد','محمد','1993-11-07','الشلف','متوسط','الحجاج مركز ','ذكر','حر','A00092768','2019-07-01','2029-06-30','بيومتري','B,C1,BE,C1E'),('00168-2021-2','2021-08-01','عين سمن','بن يحي','طاهر','1955-09-23','الصبحة','ابتدائي','أولاد حمادي الصبحة- الشلف','ذكر','متعاقد','02/474/2017','2017-04-05','2022-04-03','القديم','B,C1,C2,E'),('00169-2021-2','2021-08-02','بن عمار','محمد','خليفة','1979-04-15','بوقادير','متوسط','حي قلفوط بوقادير - الشلف','ذكر','متعاقد','02/975/2017','2017-05-16','2022-05-16','القديم','B,C1,C2'),('00171-2021-2','2021-08-01','ساعد','عبد الوهاب','محمد','1986-10-11','تنس','ابتدائي','حي النصر رقم 15 الزبوجة ولاية- الشلف','ذكر','حر','02/567/2020','2020-09-16','2025-09-14','القديم','B,C1,C2,E'),('00172-2021-2','2021-08-01','برشوة','معمر','الحاج','1976-12-04','الهرانفة','ابتدائي','الحي الجديد بلدية الهرانفة','ذكر','حر','02/79/2017','2017-02-09','2022-02-09','القديم','B,C1,C2'),('00175-2021-2','2021-08-01','بن زرفة','إسماعيل','إبراهيم','1995-12-31','بريرة','ابتدائي','بريرة دوار بومزال','ذكر','حر','00013242','2020-12-30','2021-10-30','بيومتري','B,C1'),('00179-2021-2','2021-08-01','زناتي','زيان','محمد','1981-01-02','المصدق','متوسط','بقعة الزنايتية بلدية مصدق الشلف','ذكر','حر','02/49/2019','2019-04-01','2024-03-31','القديم','B,C1,C2'),('00180-2021-2','2021-08-01','تيعزلاتين','محمد','يوسف','1971-08-25','المرسى','متوسط','حي الشهيد مسار عبد الهادي بلدية مصدق ','ذكر','حر','02/65/2019','2019-05-07','2024-05-06','القديم','B,C1,C2,E'),('00194-2021-2','2021-08-01','مغربي','أمحمد','محمد','1968-12-05','أولاد بن عبد القادر','ابتدائي','سنجاس- الشلف','ذكر','متعاقد','02/31661/16','2016-01-03','2021-10-17','بيومتري','B,C1'),('00195-2021-2','2021-08-07','خليفي عثمان','عبد الإله','محمد','1975-10-16','عين مران','متوسط','حي السلام حي سعدي رقم 15 الشلف','ذكر','حر','A01244784','2021-01-08','2031-01-07','بيومتري','B,C1,C,BE,C1E,CE'),('00197-2021-2','2021-08-01','ثولال','مراد','محمد','1991-06-16','الصبحة','ابتدائي','بقعة الوخاوخة الصبحة- الشلف','ذكر','متعاقد','A00404356','2019-12-11','2029-12-10','بيومتري','B,C'),('00200-2021-2','2021-08-01','بوشكارة','أحمد','محجوب','1960-02-14','أولاد فارس','ابتدائي','م04 بناية الشطية- الشلف','ذكر','حر','02/592/2020','2020-03-03','2025-03-02','القديم','B,C1,C2,E'),('00202-2021-2','2021-08-01','سعدي','محمد','هني','1959-09-14','الشلف','ابتدائي','أولاد سيدي الشريف أولاد فارس - الشلف','ذكر','متعاقد','02/838/2019','2019-09-09','2024-09-05','القديم','B,C1,C2,D,E'),('00203-2021-2','2021-08-07','جيلالي عياد','منير','بوعبدالله','1988-09-17','زرالدة','ابتدائي','م د 03 رقم 794 الشطية الشلف ','ذكر','حر','02/1687/2019','2019-09-04','2024-03-03','القديم','C1'),('00204-2021-2','2021-08-01','خلافي','بوعبد الله','بشير','1967-02-08','أولاد فارس','ابتدائي','بقعة الشطية','ذكر','متعاقد','02/439/2017','2017-02-20','2022-02-10','القديم','B,C1,C2,E'),('00207-2021-2','2021-08-01','شابي','علي','جيلالي','1965-02-07','الشلف','ابتدائي','م 02 رقم 236 الشطية - الشلف','ذكر','متعاقد','02/331/2020','2020-02-10','2025-02-09','القديم','B,C1,C2,E'),('00217-2021-2','2021-08-07','مواكني','علي','أحمد','1955-02-04','بوزغاية','ابتدائي','محطة حميس رقم 19 بوزغاية الشلف','ذكر','حر','02/1113/2017','2017-10-05','2022-10-04','القديم','B,C1,C2,E'),('00220-2021-2','2021-08-01','بن قليز','محمد','الحاج','1959-12-31','بوقادير','ابتدائي','أولاد علي الصبحة-الشلف','ذكر','حر','02/294/2020','2020-04-21','2025-04-19','القديم','B,C1,C2,D,E'),('00223-2021-2','2021-08-01','قوادري','عبد القادر','خليفة','1963-10-11','بوقادير','ابتدائي','بقعة المطايرية بوقادير- الشلف','ذكر','متعاقد','02/183/2019','2019-02-11','2024-02-10','القديم','B,C1,C2,E'),('00224-2021-2','2021-08-01','قوادري','أحمد','خليفة','1984-11-03','بوقادير','ابتدائي','بقعة المطايرية بوقادير - الشلف','ذكر','متعاقد','02/0186/2020','2020-02-10','2025-02-09','القديم','B,C1,C2'),('00225-2021-2','2021-08-01','قوادري','عبد الصمد','خليفة','1980-01-26','بوقادير','ابتدائي','بقعة المطايرية بوقادير -الشلف','ذكر','متعاقد','02/318/2021','2021-03-07','2026-03-06','القديم','B,C1,C2,E'),('00227-2021-2','2021-08-07','دردون','جيلالي','محمد','1956-12-31','بوزغاية','ابتدائي','م ب 01 رقم 17 الشطية الشلف','ذكر','حر','02/1279/2019','2019-07-02','2024-07-01','القديم','B,C1,C2,D,E'),('00229-2021-283','2021-08-15','مرسى','أحمد','معمر','1966-09-30','تاوقريت /الشلف','ابتدائي','المعاريش 01 بلدية الهرانفة','ذكر','حر','02/106/2019','2019-03-21',NULL,'القديم','B,C1,C2,E'),('00230-2021-2','2021-08-02','بلج نعايمة','عبد الحكيم','محمد','1990-10-25','أولاد فارس','ابتدائي','حي الشرفة أولاد فارس - الشلف','ذكر','حر','R02183796','2021-06-27','2021-08-27','بيومتري','B,C1'),('00231-2021-283','2021-08-15','سلاطنة','محمد','عبد القادر','1964-03-04','سنجاس/ الشلف','ابتدائي','حي سيدي جيلالي بلزرق واد سلي -الشلف','ذكر','حر','02/1086/2019','2019-08-15',NULL,'القديم','B,C1,C2,E'),('00235-2021-2','2021-08-01','ثولال','هواري','أحمد','1982-02-27','الصبحة','ابتدائي','الوخاوخة الصبحة- الشلف','ذكر','متعاقد','02/158/2021','2021-02-11','2026-02-10','القديم','B,C1,C2'),('00236-2021-2','2021-08-01','ثولال','رشيد','يحي','1988-03-15','الصبحة','ابتدائي','الوخاوخة الصبحة- الشلف','ذكر','متعاقد','02/520/2017','2017-04-13','2022-01-25','القديم','B,C1,C2'),('00237-2021-2','2021-08-01','لزعر','محمد','ميلود','1989-03-14','الصبحة','ابتدائي','الصبحة -الشلف','ذكر','حر','00000727','2021-01-18','2021-10-30','بيومتري','B,C1,C,CE'),('00238-2021-2','2021-08-07','صالح','عبد القادر','مسعود','1970-07-07','الشلف','ابتدائي','بقعة المعايزية أم الدروع الشلف','ذكر','متعاقد','02/30361/15','2015-12-08','2020-12-07','القديم','B,C1,C2,E'),('00239-2021-2','2021-08-07','بودالي','علي','محمد','1965-12-01','الزبوجة','ابتدائي','حي النصر بلدية الزبوجة الشلف','ذكر','متعاقد','02/584/2018','2018-08-27','2023-08-25','القديم','B,C1,C2,E'),('00240-2021-2','2021-08-07','بوزيد','عبد القادر','محمد','1966-05-03','سيدي عكاشة ','ابتدائي','م د 03 رقم 383 الشطية الشلف','ذكر','متعاقد','02/1460/2016','2016-05-05','2021-05-04','القديم','B,C1,C2,D,E'),('00241-2021-2','2021-08-07','زنود','عبد القادر','أحمد','1977-05-04','الكريمية','متوسط','حي علي بن هانية العطاف','ذكر','متعاقد','4477/1225/2020','2020-11-24','2025-11-23','القديم','B,C1,C2'),('00242-2021-2','2021-08-07','قورين','محمد','عبد القادر','1962-10-04','أم الدروع','ابتدائي',' الشلفحي بوعليلي أم الدروع ','ذكر','متعاقد','02/549/2019','2019-10-13','2024-09-28','القديم','B,C1,C2,D,E'),('00243-2021-2','2021-08-07','محارث','عبد القادر','محمد','1969-10-25','الأزهرية','ابتدائي','قرية تمزلايت بلدية الأزهرية ولاية تيسمسيلت','ذكر','متعاقد','070/2016','2016-12-15','2021-12-14','القديم','B,C1,C2,E'),('00244-2021-2','2021-08-07','نواري','توفيق','عبد الله','1985-03-06','الشلف','ابتدائي','بقعة الحمايسية أم الدروع الشلف','ذكر','متعاقد','02/250/2018','2018-04-01','2023-02-01','القديم','B,C1,C2,E'),('00245-2021-2','2021-08-07','هني حواص','صالح','محمد','1980-03-29','سنجاس','ابتدائي','حي البدر م 03 رقم 119 الشلف','ذكر','متعاقد','02/2553/2016','2016-04-20','2021-07-22','القديم','B,C1,C2'),('00246-2021-2','2021-08-07','يحيى محمد','بوعلام','جلول','1978-10-17','خميس مليانة','ابتدائي','حي قرومي بلدية سيدي لخضر عين الدفلى','ذكر','متعاقد','44/24/52/16','2016-09-04','2021-09-03','القديم','B,C1,C2,E'),('00247-2021-2','2021-08-07','قاسمي','علي','محمد','1975-07-10','وادي الفضة','ابتدائي','بقعة الوقيات بني راشد  الشلف','ذكر','متعاقد','02/186/2021','2021-03-22','2026-03-21','القديم','B,C1,C2,E'),('00249-2021-2','2021-06-03','هني حمري','أحمد','محمد','1980-12-13','بسنجاس','متوسط','بقعة البساكرة أم الدروع - الشلف','ذكر','متعاقد','02/242/2016','2016-02-20','2021-11-13','القديم','B,C1,C2,E'),('00250-2021-283','2021-08-15','بوشكارة','علي','عبد القادر','1982-10-13','أولاد فارس / الشلف','متوسط','القطايبية أولاد فارس','ذكر','حر','02/190/2020','2020-02-18',NULL,'القديم','B,C1,C2'),('00251-2021-2','2021-08-01','قوادري','فريد','قدور','1988-10-10','الصبحة','متوسط','المطايرية بوقدير- الشلف','ذكر','متعاقد','02/0162/2016','2016-10-18','2021-10-15','القديم','B,C1'),('00253-2021-283','2021-08-15','نورة','عبد الحليم','عبد القادر','1982-08-01','الزبوجة / الشلف','ابتدائي','بقعة الفلاقية بنايرية - الشلف','ذكر','حر','02/225/2020','2020-06-11',NULL,'القديم','B,C1,C2'),('00254-2021-283','2021-08-15','حمادي','سعيد','جيلالي','1981-12-03','بوزغاية / الشلف','متوسط','تاجنة -أبو الحسن','ذكر','حر','02/106/2018','2018-02-06',NULL,'القديم','B,C1,C2,D,E'),('00255-2021-283','2021-08-15','فلاق','عبد النور','محمد','1976-05-24','الشلف','متوسط','م 05 رقم 509 الشطية - الشلف','ذكر','حر','02/1744/2016','2016-05-29',NULL,'القديم','B,C1,C2,D,E'),('00256-2021-283','2021-08-17','يونسي','معمر','أحمد','1964-12-31','بوزغاية/ الشلف','ابتدائي','القرية الفلاحية رقم 09 بوزغاية - الشلف','ذكر','حر','02/251/2016','2016-12-14',NULL,'القديم','B,C1,C2,E'),('00257-2021-283','2021-08-17','مقروس','محمد جمال الدين','محمد','1990-10-28','الشطية','متوسط','م 02 رقم 16 الشطية -الشلف ','ذكر','حر','00013225','2020-12-30',NULL,'بيومتري','B,D,C1'),('00258-2021-2','2021-08-07','ولاج','عبد القادر','معمر','1977-12-31','بوزغاية','ابتدائي','محطة حميس رقم 48 بوزغاية الشلف','ذكر','حر','02/552/2017','2017-03-06','2022-03-05','القديم','B,C1,C2,D'),('00259-2021-283','2021-08-17','لحمر','جمال','محمد','1968-01-18','الصبحة','ابتدائي','حي الشهيد لوركيستي بن عتو السو عين مران','ذكر','حر','02/732/2017','2017-05-02',NULL,'القديم','B,C1,C2,D,E'),('00260-2021-283','2021-08-17','شرانطي','محمد الأمين','محمد','1988-08-16','الزبوجة','متوسط','الزبوجة مركز','ذكر','حر','A00798732','2020-07-16',NULL,'بيومتري','D,C1,C'),('00261-2021-283','2021-08-17','سعيدية','عبد القادر','الحاج','1976-08-16','أولاد فارس / الشلف','ابتدائي',' السعايدية  أولاد فارس - الشلف','ذكر','حر','02/2576/2016','2016-08-15',NULL,'القديم','B,C1,C2'),('00262-2021-283','2021-08-17','منصور بختاش','أمحمد','صالح','1970-05-06','سنجاس - الشلف','متوسط',' حي النصر سنجاس -الشلف','ذكر','حر','02/218/2020','2020-04-21',NULL,'القديم','B,C1,C2,E'),('00263-2021-283','2021-08-17','عبو',' محمد','قدور','1964-01-29','سنجاس / الشلف','ابتدائي','حي صالحي سنجاس - الشلف','ذكر','حر','02/126/2016','2016-10-24',NULL,'القديم','B,C1,C2,D,E'),('00264-2021-283','2021-08-17','نقاز','قدور','جيلالي','1961-11-12','تاجنة / الشلف','ابتدائي','تاجنة أبو الحسن - الشلف','ذكر','حر','02/432/2018','2018-05-31',NULL,'القديم','B,C1,C2,E'),('00265-2021-283','2021-08-17','خواص','عبد القادر','بودربالة','1983-01-16','الزبوجة / الشلف','متوسط','بقعة الفلاقية رقم 48 بنايرية - الشلف','ذكر','حر','02/072/2020','2020-02-10',NULL,'القديم','B,C1,C2,E'),('00266-2021-283','2021-08-17','عيسى بختاش','الحاج','قدور','1979-06-15','الشلف','متوسط','بقعة أولاد منصور سنجاس - الشلف','ذكر','حر','02/744/2020','2020-11-11',NULL,'القديم','B,C1,C2,E'),('00267-2021-283','2021-08-17','طالبي','جيلالي','بن شريف','1969-01-23','بوزغاية / الشلف','ابتدائي','تاجنة - أبو الحسن - الشلف','ذكر','حر','02/137/2016','2016-01-27',NULL,'القديم','B,C1,C2,D,E'),('2-01','2021-07-30','قوادري بجلطية','هشام','احمد','1992-10-26','الشلف','جامعي','26 شارع ي حي السلام','ذكر','حر','02/3598/36','2021-07-30','2031-07-30','القديم','B'),('2-02','2021-07-30','حميدي بوجلطية','نور الدين','الجيلالي','1970-03-07','الشلف','جامعي','الشطية','ذكر','متعاقد','3/0565/03','2020-07-30','2030-07-30','القديم','B,C1'),('2-10','2021-08-11','t','t','t','1990-08-11','t','متوسط','t','ذكر','حر','0252298f','2021-08-11',NULL,'القديم','B'),('2-15','2021-08-22','k','k','k','2021-08-11','k','d','d','d','d','255','2021-08-11',NULL,'d','d');
/*!40000 ALTER TABLE `candidat` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `centre`
--

DROP TABLE IF EXISTS `centre`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `centre` (
  `NUMERO_AGREMENT` varchar(50) NOT NULL,
  `NOM_CENTRE` varchar(50) DEFAULT NULL,
  `SIEGE` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`NUMERO_AGREMENT`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `centre`
--

LOCK TABLES `centre` WRITE;
/*!40000 ALTER TABLE `centre` DISABLE KEYS */;
INSERT INTO `centre` VALUES ('283','عاصم','الشطية');
/*!40000 ALTER TABLE `centre` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `formation`
--

DROP TABLE IF EXISTS `formation`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `formation` (
  `NUMERO_FORMATION` int(11) NOT NULL,
  `GROUPE` int(11) NOT NULL,
  `NUMERO_AGREMENT` varchar(50) NOT NULL,
  `TYPE_FORMATION` varchar(50) DEFAULT NULL,
  `DEBUT` date DEFAULT NULL,
  `FIN` date DEFAULT NULL,
  PRIMARY KEY (`NUMERO_FORMATION`,`GROUPE`,`NUMERO_AGREMENT`),
  KEY `FK_OFFRE` (`NUMERO_AGREMENT`),
  CONSTRAINT `FK_OFFRE` FOREIGN KEY (`NUMERO_AGREMENT`) REFERENCES `centre` (`NUMERO_AGREMENT`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `formation`
--

LOCK TABLES `formation` WRITE;
/*!40000 ALTER TABLE `formation` DISABLE KEYS */;
INSERT INTO `formation` VALUES (1,1,'283','نقل البضائع','2021-07-15','2021-09-15'),(1,2,'283','نقل المسافرين','2021-07-15','2021-08-15'),(1,3,'283','نفل المواد الخطيرة','2021-07-16','2021-09-16'),(2,1,'283','نقل البضائع','2021-07-16','2021-09-16'),(2,2,'283','نقل المسافرين','2021-07-16','2021-10-16'),(3,1,'283','نقل المسافرين','2021-10-26','2021-12-26'),(3,2,'283','نقل البضائع','2021-10-26','2021-12-26'),(13,1,'283','نقل البضائع','2021-06-25','2021-07-12'),(14,1,'283','نقل البضائع','2021-07-16','2021-08-05'),(14,2,'283','نقل البضائع','2021-07-16','2021-08-05'),(14,3,'283','نقل البضائع','2021-07-16','2021-08-05');
/*!40000 ALTER TABLE `formation` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ligne`
--

DROP TABLE IF EXISTS `ligne`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ligne` (
  `NUM_INS` varchar(20) NOT NULL,
  `DATE_INS` date NOT NULL,
  `NUM_PERMIS` varchar(45) NOT NULL,
  `MATRECULE` varchar(10) NOT NULL,
  `NUM_LIGNE` varchar(100) NOT NULL,
  `TYPE_LIGNE` varchar(50) DEFAULT NULL,
  `DATE_LIV_LIGNE` date DEFAULT NULL,
  `DATE_EXP_LIGNE` date DEFAULT NULL,
  PRIMARY KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`,`MATRECULE`,`NUM_LIGNE`),
  KEY `FK_LIGNE` (`MATRECULE`),
  CONSTRAINT `FK_LIGNE` FOREIGN KEY (`MATRECULE`) REFERENCES `vehicule` (`MATRECULE`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `FK_LIGNE2` FOREIGN KEY (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) REFERENCES `candidat` (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ligne`
--

LOCK TABLES `ligne` WRITE;
/*!40000 ALTER TABLE `ligne` DISABLE KEYS */;
/*!40000 ALTER TABLE `ligne` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `operateur`
--

DROP TABLE IF EXISTS `operateur`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `operateur` (
  `NOM_OP` char(50) NOT NULL,
  `SIEGE_OP` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`NOM_OP`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `operateur`
--

LOCK TABLES `operateur` WRITE;
/*!40000 ALTER TABLE `operateur` DISABLE KEYS */;
/*!40000 ALTER TABLE `operateur` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `passe`
--

DROP TABLE IF EXISTS `passe`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `passe` (
  `NUM_INS` varchar(20) NOT NULL,
  `DATE_INS` date NOT NULL,
  `NUM_PERMIS` varchar(45) NOT NULL,
  `NUMERO_FORMATION` int(11) NOT NULL,
  `GROUPE` int(11) NOT NULL,
  `NUMERO_AGREMENT` varchar(50) NOT NULL,
  `NOTE` float DEFAULT NULL,
  `REMARQUE` varchar(50) DEFAULT NULL,
  `BREVET` varchar(45) DEFAULT NULL,
  `LIV_BREVET` date DEFAULT NULL,
  `EXP_BREVET` date DEFAULT NULL,
  `PRINT` int(1) DEFAULT '0',
  `NUMERO` int(2) DEFAULT '0',
  `DATE_EMISSION` date DEFAULT NULL,
  PRIMARY KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`,`NUMERO_FORMATION`,`GROUPE`,`NUMERO_AGREMENT`),
  KEY `FK_PASSE` (`NUMERO_FORMATION`),
  KEY `FK_PASSE3` (`NUMERO_FORMATION`,`GROUPE`,`NUMERO_AGREMENT`),
  CONSTRAINT `FK_PASSE2` FOREIGN KEY (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) REFERENCES `candidat` (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `FK_PASSE3` FOREIGN KEY (`NUMERO_FORMATION`, `GROUPE`, `NUMERO_AGREMENT`) REFERENCES `formation` (`NUMERO_FORMATION`, `GROUPE`, `NUMERO_AGREMENT`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `passe`
--

LOCK TABLES `passe` WRITE;
/*!40000 ALTER TABLE `passe` DISABLE KEYS */;
INSERT INTO `passe` VALUES ('00056-2021-2','2021-08-01','209900051002890003',14,1,'283',0,'مؤجل للإستدراك',NULL,NULL,NULL,0,0,NULL),('00060-2021-2','2021-08-01','02/0317/2019',14,1,'283',13.62,'ناجح',NULL,NULL,NULL,0,0,NULL),('00061-2021-2','2021-08-04','02/379/2018',14,2,'283',0,'مؤجل للإستدراك',NULL,NULL,NULL,0,0,NULL),('00077-2021-2','2021-08-01','02/1129/2018',14,1,'283',11.87,'ناجح','577232','2021-08-18','2021-08-28',1,0,NULL),('00080-2021-2','2021-08-01','02/163/2018',14,1,'283',11.62,'ناجح',NULL,NULL,NULL,0,0,NULL),('00084-2021-2','2021-08-01','02/120/2017',14,1,'283',12.87,'ناجح',NULL,NULL,NULL,0,0,NULL),('00085-2021-2','2021-08-01','02/347/2017',14,3,'283',13.87,'ناجح',NULL,NULL,NULL,0,0,NULL),('00111-2021-2','2021-08-01','02/033/2020',14,2,'283',14,'ناجح',NULL,NULL,NULL,0,0,NULL),('00112-2021-2','2021-08-01','02/284/2020',14,2,'283',0,'مؤجل للإمتحان',NULL,NULL,NULL,0,0,NULL),('00113-2021-2','2021-08-01','02/108/2017',14,1,'283',11.25,'ناجح','21321','2021-08-18','2021-08-27',1,0,NULL),('00118-2021-2','2021-08-04','02/396/2020',13,1,'283',NULL,NULL,NULL,NULL,NULL,0,0,NULL),('00119-2021-2','2021-08-04','02/2884/2017',13,1,'283',NULL,NULL,NULL,NULL,NULL,0,0,NULL),('00131-2021-2','2021-08-01','02/1230/2019',14,1,'283',13.62,'ناجح',NULL,NULL,NULL,0,0,NULL),('00162-2021-2','2021-08-01','02/569/2020',14,1,'283',11.5,'ناجح',NULL,NULL,NULL,0,0,NULL),('00163-2021-2','2021-08-01','02/363/2017',14,2,'283',13.5,'ناجح',NULL,NULL,NULL,0,0,NULL),('00168-2021-2','2021-08-01','02/474/2017',14,3,'283',12,'ناجح',NULL,NULL,NULL,0,0,NULL),('00171-2021-2','2021-08-01','02/567/2020',14,2,'283',12.87,'ناجح',NULL,NULL,NULL,0,0,NULL),('00172-2021-2','2021-08-01','02/79/2017',14,1,'283',12.12,'ناجح',NULL,NULL,NULL,0,0,NULL),('00175-2021-2','2021-08-01','00013242',14,1,'283',12.87,'ناجح',NULL,NULL,NULL,0,0,NULL),('00179-2021-2','2021-08-01','02/49/2019',14,1,'283',12.12,'ناجح',NULL,NULL,NULL,0,0,NULL),('00180-2021-2','2021-08-01','02/65/2019',14,1,'283',11.5,'ناجح',NULL,NULL,NULL,0,0,NULL),('00194-2021-2','2021-08-01','02/31661/16',14,2,'283',0,'مؤجل للإستدراك',NULL,NULL,NULL,0,0,NULL),('00197-2021-2','2021-08-01','A00404356',14,3,'283',14,'ناجح',NULL,NULL,NULL,0,0,NULL),('00200-2021-2','2021-08-01','02/592/2020',14,2,'283',13.5,'ناجح',NULL,NULL,NULL,0,0,NULL),('00202-2021-2','2021-08-01','02/838/2019',14,2,'283',12.87,'ناجح',NULL,NULL,NULL,0,0,NULL),('00204-2021-2','2021-08-01','02/439/2017',14,2,'283',0,'مؤجل للإستدراك',NULL,NULL,NULL,0,0,NULL),('00207-2021-2','2021-08-01','02/331/2020',14,2,'283',12.12,'ناجح',NULL,NULL,NULL,0,0,NULL),('00220-2021-2','2021-08-01','02/294/2020',14,3,'283',14,'ناجح',NULL,NULL,NULL,0,0,NULL),('00223-2021-2','2021-08-01','02/183/2019',14,3,'283',0,'مؤجل للإمتحان',NULL,NULL,NULL,0,0,NULL),('00224-2021-2','2021-08-01','02/0186/2020',14,3,'283',14.87,'ناجح',NULL,NULL,NULL,0,0,NULL),('00225-2021-2','2021-08-01','02/318/2021',14,3,'283',12.75,'ناجح',NULL,NULL,NULL,0,0,NULL),('00235-2021-2','2021-08-01','02/158/2021',14,3,'283',14.25,'ناجح',NULL,NULL,NULL,0,0,NULL),('00236-2021-2','2021-08-01','02/520/2017',14,3,'283',13.12,'ناجح',NULL,NULL,NULL,0,0,NULL),('00237-2021-2','2021-08-01','00000727',14,3,'283',0,'مؤجل للإستدراك',NULL,NULL,NULL,0,0,NULL),('00251-2021-2','2021-08-01','02/0162/2016',14,3,'283',13.5,'ناجح',NULL,NULL,NULL,0,0,NULL),('2-01','2021-07-30','02/3598/36',1,1,'283',13,'ناجح','0','2021-07-30','2022-07-30',1,1,'2021-08-17'),('2-02','2021-07-30','3/0565/03',1,1,'283',10,'ناجح','02135148','2021-08-18','2021-08-26',1,3,NULL),('2-02','2021-07-30','3/0565/03',2,1,'283',13.5,'ناجح','11111','2021-08-19','2021-08-27',1,1,NULL),('2-02','2021-07-30','3/0565/03',3,1,'283',12,'ناجح','0202055','2021-10-10','2021-10-25',0,0,NULL);
/*!40000 ALTER TABLE `passe` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `per_circule`
--

DROP TABLE IF EXISTS `per_circule`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `per_circule` (
  `NUM_INS` varchar(20) NOT NULL,
  `DATE_INS` date NOT NULL,
  `NUM_PERMIS` varchar(45) NOT NULL,
  `MATRECULE` varchar(10) NOT NULL,
  `NUM_PER` varchar(40) NOT NULL,
  `DATE_LIV_PER` date DEFAULT NULL,
  `DATE_EXP_PER` date DEFAULT NULL,
  PRIMARY KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`,`MATRECULE`,`NUM_PER`),
  KEY `FK_PER_CIRCULE` (`MATRECULE`),
  CONSTRAINT `FK_PER_CIRCULE` FOREIGN KEY (`MATRECULE`) REFERENCES `vehicule` (`MATRECULE`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `FK_PER_CIRCULE2` FOREIGN KEY (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) REFERENCES `candidat` (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `per_circule`
--

LOCK TABLES `per_circule` WRITE;
/*!40000 ALTER TABLE `per_circule` DISABLE KEYS */;
/*!40000 ALTER TABLE `per_circule` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `travail`
--

DROP TABLE IF EXISTS `travail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `travail` (
  `NUM_INS` varchar(20) NOT NULL,
  `DATE_INS` date NOT NULL,
  `NUM_PERMIS` varchar(45) NOT NULL,
  `NOM_OP` char(50) NOT NULL,
  `DATE_RECRUT` date NOT NULL,
  `DATE_FIN` date DEFAULT NULL,
  `ETAT` varchar(10) DEFAULT NULL,
  PRIMARY KEY (`NUM_INS`,`DATE_INS`,`NUM_PERMIS`,`NOM_OP`),
  KEY `FK_TRAVAIL` (`NOM_OP`),
  CONSTRAINT `FK_TRAVAIL` FOREIGN KEY (`NOM_OP`) REFERENCES `operateur` (`NOM_OP`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `FK_TRAVAIL2` FOREIGN KEY (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) REFERENCES `candidat` (`NUM_INS`, `DATE_INS`, `NUM_PERMIS`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `travail`
--

LOCK TABLES `travail` WRITE;
/*!40000 ALTER TABLE `travail` DISABLE KEYS */;
/*!40000 ALTER TABLE `travail` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user` (
  `USERNAME` varchar(50) NOT NULL,
  `PASSWORD` varchar(50) NOT NULL,
  `ADMIN` varchar(10) NOT NULL,
  `NUMERO_AGREMENT` varchar(50) NOT NULL,
  PRIMARY KEY (`USERNAME`,`PASSWORD`,`ADMIN`),
  KEY `FK_CONTIENT` (`NUMERO_AGREMENT`),
  CONSTRAINT `FK_CONTIENT` FOREIGN KEY (`NUMERO_AGREMENT`) REFERENCES `centre` (`NUMERO_AGREMENT`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES ('assim','0000','admin','283');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `vehicule`
--

DROP TABLE IF EXISTS `vehicule`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `vehicule` (
  `MATRECULE` varchar(10) NOT NULL,
  `NOM_OP` char(50) NOT NULL,
  `GENRE` varchar(20) DEFAULT NULL,
  `MARQUE` varchar(20) DEFAULT NULL,
  `PTC` decimal(10,3) DEFAULT NULL,
  `PTAC` decimal(10,3) DEFAULT NULL,
  `CU` decimal(10,3) DEFAULT NULL,
  `NOMBRE_PLACE` int(11) DEFAULT NULL,
  PRIMARY KEY (`MATRECULE`),
  KEY `FK_APPARTIENT` (`NOM_OP`),
  CONSTRAINT `FK_APPARTIENT` FOREIGN KEY (`NOM_OP`) REFERENCES `operateur` (`NOM_OP`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `vehicule`
--

LOCK TABLES `vehicule` WRITE;
/*!40000 ALTER TABLE `vehicule` DISABLE KEYS */;
/*!40000 ALTER TABLE `vehicule` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-08-29 18:31:17
